{
  "channel_name": "Casey Niestat",
  "channel_id": "",
  "videos_count": 8,
  "fetch_date": "2025-11-04",
  "notes": "Converted from PDF - 11 pages",
  "videos": [
    {
      "video_id": "video_2",
      "title": "THE $21,000 FIRST CLASS AIRPLANE SEAT want to see the coolest thing I've ever seen in an airplane",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 seat this is the heavy heavy monster sound The Nest sounds around so if you coming up the street and you're Time: 00:10 - 00:20 beginning to feel the heat well listen Buster you better start to move your feet Time: 00:20 - 00:30 what I think of the greatest days in my entire life I think of when my children Time: 00:30 - 00:40 were born or perhaps when my son graduated high school or today when I was upgraded from business to First on Time: 00:40 - 00:50 Emirates I don't know what I did to deserve this I really don't oh my God snacks writing Time: 00:50 - 01:00 [Music] Time: 01:00 - 01:10 kit we're in the air just left Dubai I got my own doors it's like my own little house over Time: 01:10 - 01:20 here total privacy Time: 01:20 - 01:30 will Time: 01:40 - 01:50 to Time: 01:50 - 02:00 the TV here is enormous it's like a movie theater it's touchcreen Time: 02:00 - 02:10 but you can also control it with this Time: 02:10 - 02:20 thing it's like a mini iPad remote now if I want to drink and I don't want to have to call them Time: 02:20 - 02:30 and the fact that that's motorized is just ridiculous it's completely Time: 02:30 - 02:40 unnecessary purer told me that I just order whatever I want whenever I want it Time: 02:40 - 02:50 there's no meal time you just tell them to cook you something and they cook it like being at a real restaurant Time: 02:50 - 03:00 this this is caviar if you don't know caviar is fish Time: 03:10 - 03:20 eggs Time: 03:20 - 03:30 salty in addition to the amenities kit this lovely thing which has all kinds of great surprises in it like Time: 03:50 - 04:00 shaving cream and deodorant all kinds of like that they gave me this big bag see and in Time: 04:00 - 04:10 here slippers High Time: 04:10 - 04:20 Shades and pajamas very nice I brought my own pajamas but I appreciate the gesture all right this is what it looks like when it goes from a seat from a Time: 04:20 - 04:30 chair to a Time: 04:30 - 04:40 bed this is more comfortable than my bed Time: 04:50 - 05:00 at home it's so Time: 05:00 - 05:10 [Music] Time: 05:10 - 05:20 cozy the moment has arrived she just told me my shower is ready so you have to Res reserve the shower like make a Time: 05:20 - 05:30 reservation I reserved it for as close to Landing as possible we land in an hour and 45 minutes so it's shower time Time: 05:30 - 05:40 this is going to be so so Time: 05:40 - 05:50 awesome once you inside yeah you close Time: 05:50 - 06:00 the door to get the water and you adjust the temperature and once you you you you you find you press that button the water will come you press again it will stop Time: 06:00 - 06:10 perfect this is it the real deal the dream showering on an airplane I've got Time: 06:10 - 06:20 30 minutes in here I can do whatever I want I Got 5 minutes of running water in the shower that gives me 25 other minutes to Time: 06:20 - 06:30 fill that's a real Orit Time: 06:50 - 07:00 [Music] Time: 07:00 - 07:10 dreams do come true I am showering on their fr Time: 07:20 - 07:30 this is amazing it's everything I'd H it would be I am 43,000 ft in the air right Time: 07:30 - 07:40 now woo do I feel fresh and clean thus Time: 07:40 - 07:50 concludes my airplane shower spot experience Time: 07:50 - 08:00 thank you truly truly extraordinary experience did you shower yeah of course I did how Time: 08:00 - 08:10 was it amazing incredible right cool eh [Music] Time: 08:10 - 08:20 unbelievable see you later thank you it really does change your whole relationship with travel when you take Time: 08:20 - 08:30 what was the most painful part of traveling and instead of that being a terrible experience it goes from Pain the whole experience of traveling so Time: 08:30 - 08:40 much more [Music] pleasureable like a Time: 08:40 - 08:50 meatball Time: 08:50 - 09:00 fish thank you man Time: 09:00 - 09:10Upgrading him was the best marketing decision Emirates has ever made",
      "comments": [
        {
          "text": "business decisions that any company has ever made",
          "author": "Unknown",
          "likes": 8000,
          "timestamp": "“Total privacy”."
        },
        {
          "text": "*looks above door*",
          "author": "Unknown",
          "likes": 6562,
          "timestamp": "\"Total privacy\""
        },
        {
          "text": "*Proceeds to just stand up and look over into other peoples seats and the isle*",
          "author": "Unknown",
          "likes": 6173,
          "timestamp": "I just noticed that he asked Olympic swimmer James Magnussen if he enjoyed"
        },
        {
          "text": "his shower",
          "author": "Unknown",
          "likes": 6105,
          "timestamp": "When his airplane ticket is more than your life savings."
        },
        {
          "text": "flight attendant: am i a joke to you?",
          "author": "Unknown",
          "likes": 4428,
          "timestamp": "I remember the good old days when you could actually buy a plane ticket"
        },
        {
          "text": "swimmer, James Magnussen?",
          "author": "Unknown",
          "likes": 3821,
          "timestamp": "I'm 100% sure that Casey was born with theese sunglasses..."
        },
        {
          "text": "without noticing 😂",
          "author": "Unknown",
          "likes": 3498,
          "timestamp": "Did I seriously watch a dude flex on me for 9 minutes?"
        },
        {
          "text": "first class is the front seat on the bus aha",
          "author": "Unknown",
          "likes": 3246,
          "timestamp": "This video has made more money than it would cost to take the flight"
        },
        {
          "text": "headphones...",
          "author": "Unknown",
          "likes": 2921,
          "timestamp": "the cost of this plane ride could pay my rent for the next 3 and a half years"
        },
        {
          "text": "to me! I mean if I was a billionaire, that's a whole different story haha",
          "author": "Unknown",
          "likes": 2645,
          "timestamp": "Imagine paying 21k for first class just to sleep all the way"
        },
        {
          "text": "Casey: Showers with glasses on",
          "author": "Unknown",
          "likes": 2512,
          "timestamp": "Casey: did you take a shower?"
        },
        {
          "text": "Passenger: are you saying I stink?",
          "author": "Unknown",
          "likes": 2401,
          "timestamp": "This guy showered with glasses on an airplane... bravo"
        },
        {
          "text": "they upgrade him automatically. For the airlines it's a cheap advertising\nproposition.",
          "author": "Unknown",
          "likes": 2189,
          "timestamp": "Why do i always come back to this video?!"
        },
        {
          "text": "The next time I'm on a plane I'll take video and put it on my channel. Doesn't\nreally go with \"off grid\", but wth.",
          "author": "Unknown",
          "likes": 2088,
          "timestamp": "You will never know why I have so many likes and comments."
        },
        {
          "text": "glasses on 🤣🤣🤣",
          "author": "Unknown",
          "likes": 1913,
          "timestamp": "I feel like that guy with the Olympic shirt he talked to on the plane was important,"
        },
        {
          "text": "but I have no clue who he was.",
          "author": "Unknown",
          "likes": 1902,
          "timestamp": "And they say that money can't buy you happieness. Does this guy not look"
        },
        {
          "text": "happy to you? Tzzz",
          "author": "Unknown",
          "likes": 1842,
          "timestamp": "Meanwhile I'm sitting here on a tiny airplane eating pretzels..."
        },
        {
          "text": "experience for the whole 14 hours",
          "author": "Unknown",
          "likes": 1696,
          "timestamp": "If I'm paying $21,000 for a plane seat. Then I'm not sleeping I'm forcing myself to"
        },
        {
          "text": "stay awake.",
          "author": "Unknown",
          "likes": 1661,
          "timestamp": "my favorite part is when the flight attendant got mad at him for making up his"
        },
        {
          "text": "own bed.",
          "author": "Unknown",
          "likes": 1650,
          "timestamp": "You know it's fancy when the flight attendant gets mad at you for making your"
        },
        {
          "text": "own bed",
          "author": "Unknown",
          "likes": 1632,
          "timestamp": "a boosted in exchange for a first class ticket?"
        }
      ]
    },
    {
      "video_id": "video_4",
      "title": "THIS IS THE MOST EXPENSIVE PLANE TICKET IN THE WORLD | Etihad A380 The Residencemy airplane seat has three rooms this back here that's my bedroom [Music]",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 okay this is it I'm about to board the plane and fly in the residence which is a three room airplane seat with like a Time: 00:20 - 00:30 living room a bathroom and a bedroom and it's on an a380 this huge plane this is Time: 00:30 - 00:40 my seat I think we're taking off now so Time: 00:40 - 00:50 firstly we have your complimentary and we had Wi-Fi voucher we have your headset noise-canceling pajamas and also Time: 00:50 - 01:00 an additional lounge where actual signature of the pilot Tim okay I'll now Time: 01:00 - 01:10 begin with a little tour first is this room here this room is considered like the living room if you walk back here through my hallway Time: 01:10 - 01:20 you get to this room this is the bedroom an entire bedroom and then if you head back to the living room on the way there Time: 01:20 - 01:30 is this room alright back to the living room it's got two full-size seats and when I say full size I don't mean like like a regular airplane seat I mean I mean like Time: 01:30 - 01:40 what is effectively two fully reclining it really feels a lot more like a couch maybe now just a prosperous gigantic Time: 01:40 - 01:50 seat is this little bench here in addition to it serving as a great footrest here and then under this person Time: 01:50 - 02:00 refrigerator light room typically light room is measured in inches but in this seat and the seat you measure in feet Time: 02:00 - 02:10 so that there is about three feet of Time: 02:20 - 02:30 legroom but but if I move over about a foot and a half to the right my legroom increases by quite the margin and that's Time: 02:30 - 02:40 14 feet of legroom Time: 02:50 - 03:00 [Music] now when you're back here you have like Time: 03:00 - 03:10 a proper bedroom so the bed is like a real bed like a proper proper bed that's just a mirror now what feels really Time: 03:10 - 03:20 extraordinary about this besides the fact that I'm laying in a bed on an airplane it's just the sheer amount of privacy you have it's when you're in the seat you definitely have privacy because Time: 03:20 - 03:30 there's this wall here but look somebody can just kind of peek over there's no Time: 03:30 - 03:40 windows no one can get back here there's a big bed there's a TV for you Time: 03:40 - 03:50 [Music] Time: 03:50 - 04:00 that was the turndown service [Music] Time: 04:00 - 04:10 now an airplane bathroom is usually the grossest place on the whole plane it's basically a flying port-a-potty but with this seat you get a private Time: 04:10 - 04:20 bathroom you don't have to share this bathroom with anyone this is just my bathroom if you wanted to use the toilet with the door open you definitely could Time: 04:20 - 04:30 in addition to all these fancy amenities [Music] Time: 04:30 - 04:40 you have your own proper shower right here Time: 04:40 - 04:50 [Music] Time: 04:50 - 05:00 this is how much time you have and it gets the red you're out of water didn't Time: 05:00 - 05:10 bring any extra underwear I tried to wash these in the shower probably a Time: 05:20 - 05:30 terrible idea [Music] Time: 05:30 - 05:40 it's my first course Time: 06:10 - 06:20 they do main course it's funny a passion fruit sorbet Thank Time: 06:20 - 06:30 You palate cleanser second main course so we're just about there which means Time: 06:30 - 06:40 out to get off this plane soon which is unfortunate see there are two things that you never really get when flying on an airplane and that space and privacy and this plant had a borderline ridiculous amount Time: 06:40 - 06:50 of both of those things look this is an empty seat right here so in conclusion I didn't pay for this flight they gave it Time: 06:50 - 07:00 to me for free so I make a youtube video about it but but if you're looking to spend about the price of a new Toyota on one flight one experience Time: 07:00 - 07:10 wonderful Time: 07:20 - 07:30 [Music] Time: 07:30 - 07:40I cannot afford to watch this video",
      "comments": [
        {
          "text": "talking to himself non-stop.",
          "author": "Unknown",
          "likes": 16108,
          "timestamp": "People in economy class: ugh when will this flight finish"
        },
        {
          "text": "People in residence: No I don’t want this flight to end",
          "author": "Unknown",
          "likes": 15642,
          "timestamp": "Imagine just sitting in your cramped little seat and hearing some random guy"
        },
        {
          "text": "measuring his legroom in FEET.",
          "author": "Unknown",
          "likes": 12921,
          "timestamp": "Meanwhile, I'm over here trying to get sponsored by Spirit airlines for a free seat"
        },
        {
          "text": "in the back row by the toilet...",
          "author": "Unknown",
          "likes": 11659,
          "timestamp": "Does nobody care about the thick boi shoes he put on?"
        },
        {
          "text": "Edit: thanks for 10k likes ✌",
          "author": "Unknown",
          "likes": 11249,
          "timestamp": "When the airplane seat is bigger than most NYC apartments."
        },
        {
          "text": "Economy\nPremium economy\nBusiness class\nFirst class\nThe residence\nThe house\nThe village\nThe city\n(NEW) The city X",
          "author": "Unknown",
          "likes": 10180,
          "timestamp": "People in Economy: \" *I can't wait for this flight to end* \""
        },
        {
          "text": "People in Residence Class: \" *I don't want this flight to end* \"",
          "author": "Unknown",
          "likes": 9200,
          "timestamp": "90% of New York residents wish their apartment was this big."
        },
        {
          "text": "jet! Levels 󰤇",
          "author": "Unknown",
          "likes": 7261,
          "timestamp": "Bruh imagine telling your son that he was made on a plane..."
        },
        {
          "text": "Me: who showers with sunglasses on?",
          "author": "Unknown",
          "likes": 5811,
          "timestamp": "My private jet in gta 5 is better"
        },
        {
          "text": "Casey: that's 2 miles of leg room",
          "author": "Unknown",
          "likes": 5197,
          "timestamp": "Airline : advertises $27k airline seat to casey fans. Casey fans : asks for no ice"
        },
        {
          "text": "in my cup so I can have more soda.",
          "author": "Unknown",
          "likes": 5054,
          "timestamp": "If your planning to join the mile high club, this is the seat you want."
        },
        {
          "text": "cover the wifi of 3 countries.",
          "author": "Unknown",
          "likes": 4160,
          "timestamp": "Casey: “who takes a 10 minute long shower”"
        },
        {
          "text": "*me taking 2 hours showers*",
          "author": "Unknown",
          "likes": 4145,
          "timestamp": "Casey: “Who takes a 10 min long shower!?”"
        },
        {
          "text": "Me: .....yeah.....who does that.......",
          "author": "Unknown",
          "likes": 3995,
          "timestamp": "Casey: who takes a ten-minute long shower?"
        },
        {
          "text": "Me: Who showers with sunglasses?",
          "author": "Unknown",
          "likes": 3523,
          "timestamp": "Honestly, I'd rather fly economy. At least then you don't have to grieve over your"
        },
        {
          "text": "flight being over.",
          "author": "Unknown",
          "likes": 3502,
          "timestamp": "Fun fact: there are more planes in the water, then boats in the sky"
        },
        {
          "text": "And for you people Yes my bff told this to me and i got like SO THRUE so i\nhelpped her post it on YT so umm yea",
          "author": "Unknown",
          "likes": 3426,
          "timestamp": "Me: oh wow that looks interes—"
        },
        {
          "text": "Wallet: don’t even think about it",
          "author": "Unknown",
          "likes": 3210,
          "timestamp": "Like and comment if your weird."
        },
        {
          "text": "*checkmate*",
          "author": "Unknown",
          "likes": 3188,
          "timestamp": "Casey: who takes a ten minute long shower?"
        },
        {
          "text": "Me who showers for like an hour: um",
          "author": "Unknown",
          "likes": 3136,
          "timestamp": "Is no one going to mention how he took a shower with sunglasses on?"
        },
        {
          "text": "Me: zones out for 30 minutes in the shower",
          "author": "Unknown",
          "likes": 3076,
          "timestamp": "Surely if you could afford this flight u’d probably have a private jet"
        },
        {
          "text": "Boys during puberty: 2:23",
          "author": "Unknown",
          "likes": 2899,
          "timestamp": "Cabin crew are so polite they honestly deserve more recognition"
        },
        {
          "text": "Edit: thanks for the likes 1.1k !!!",
          "author": "Unknown",
          "likes": 2770,
          "timestamp": "Imagine bill gate’s scrolling and laughing on most expensive....."
        },
        {
          "text": "courtyard.",
          "author": "Unknown",
          "likes": 2623,
          "timestamp": "1980: I bet there will be flying cars in the future"
        },
        {
          "text": "2019: *FLYING HOTELS*",
          "author": "Unknown",
          "likes": 2502,
          "timestamp": "All this but no extra underwear !!! Ridiculous"
        },
        {
          "text": "Edit- Hello hello hello, thanks for the 2.6k likes, I appreciate it! I hope you all are\nhaving great holidays.\nRead my name btw",
          "author": "Unknown",
          "likes": 2451,
          "timestamp": "“When residence is better than your whole house”"
        },
        {
          "text": "Me: singing in the shower for an hour.",
          "author": "Unknown",
          "likes": 2406,
          "timestamp": "That litteraly looks 10 times better than my house."
        }
      ]
    },
    {
      "video_id": "video_5",
      "title": "Make It Count [Music] definitely make this splash no we're",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:20 - 00:30 cutting it close so far the trip is off to a fairly irresponsible star and so it begins Time: 00:30 - 00:40 we got to heresy 17 degrees outside the Time: 00:40 - 00:50 airport look up the barrel Time: 00:50 - 01:00 [Music] No [Music] Time: 01:00 - 01:10 all very successful we visited Tahir square we rode horses Maximas novice Time: 01:10 - 01:20 not the minutes don't dispense Cheetos for the faucet see forefathers Time: 01:20 - 01:30 educational we're in Johannesburg in South Africa right now just got cheese [Music] Time: 01:30 - 01:40 we're stuck in Nairobi Brett to that Time: 02:00 - 02:10 right now if we're leaving Rover rent-a-car the trouble is all of these street signs are written in squiggly line [Music] Time: 02:10 - 02:20 like boards two minutes ago we're in Bangkok in a terrible taxi drivers taking honey what's up we forgot to eat Time: 02:20 - 02:30 today and I've got the shakes real bad airplane food I've ever seen look at this wiener [Music] Time: 02:30 - 02:40 [Music] Time: 03:20 - 03:30 [Music] Time: 03:50 - 04:00 you Time: 04:30 - 04:40I come back and watch this video to remind myself how broke I am",
      "comments": [
        {
          "text": "make a movie. Nike expected an other movie but this one is beter then they\ncould ever imagine.",
          "author": "Unknown",
          "likes": 5740,
          "timestamp": "Video is 8 years old now and still incredible"
        },
        {
          "text": "Casey was always brilliant.",
          "author": "Unknown",
          "likes": 1788,
          "timestamp": "Doctor: You've got 10 days to live"
        },
        {
          "text": "Casey:",
          "author": "Unknown",
          "likes": 1758,
          "timestamp": "i come back to this video once in a while"
        },
        {
          "text": "world'\n*Makes a movie/documentary about it*",
          "author": "Unknown",
          "likes": 1598,
          "timestamp": "I love revisiting this vid. Seriously awesome."
        },
        {
          "text": "10 days. You can too, but if it's meant to be it's up to me.",
          "author": "Unknown",
          "likes": 955,
          "timestamp": "It may be an ad but its a really good damn ad"
        },
        {
          "text": "“Buy the ticket take the ride” - Hunter S. Thompson\n“You only live once but if you do it right once is enough” - Mae West\n“Above all, try something” - Franklin D. Roosevelt\n“I never worry about the future it comes soon enough” - Albert Einstein\n“One who makes no mistakes makes nothing at all” - Giacomo Casanova\n“Do one thing everyday that scares you” - Eleanor Roosevelt\n“In the end it’s not the years in your life that count, it’s the life in your years” -\nAbraham Lincoln\n“If I’d followed all the rules I’d never have gotten anywhere” - Marilyn Monroe\n“Action expresses priorities” - Gandhi",
          "author": "Unknown",
          "likes": 806,
          "timestamp": "Anyone else here after listening to the interview on How I Built This with Guy"
        },
        {
          "text": "Raz?",
          "author": "Unknown",
          "likes": 747,
          "timestamp": "You know it's a great ad when you watched it 100 times & Still not getting bored"
        },
        {
          "text": "Casey!",
          "author": "Unknown",
          "likes": 620,
          "timestamp": "I could make it count if Nike lowered their fucking prices."
        },
        {
          "text": "This video is also amazing in giving me motivation. I frankly have a much\ndifferent channel than Casey but this inspires me to make more and better\ncontent lol.",
          "author": "Unknown",
          "likes": 533,
          "timestamp": "Imagine the jet lag"
        },
        {
          "text": "would also use the opportunity to travel around the world. Casey you're one\nlucky bastard.",
          "author": "Unknown",
          "likes": 414,
          "timestamp": "Hey there! I'm a native speaker of the squiggly lines language."
        },
        {
          "text": "working my ass off to make it, wish me luck.",
          "author": "Unknown",
          "likes": 374,
          "timestamp": "Holy Shit I’m in 2020 and this video is still so relevant"
        },
        {
          "text": "“It’s not about the amount of years you live; but the amount we live in our years”\nUrghhh so good",
          "author": "Unknown",
          "likes": 353,
          "timestamp": "I wish I could make it count but I'm just a basic guy with no fucking company to"
        },
        {
          "text": "sponsor my ass into a 10 day world trip",
          "author": "Unknown",
          "likes": 347,
          "timestamp": "Oh Those Russian Girls! :)"
        },
        {
          "text": "in a passive way . It has changed my way of thinking when i was 15 years old\nnow i am studying medicine and chasing my dream to emigrate to the us .",
          "author": "Unknown",
          "likes": 333,
          "timestamp": "This is the best video I have ever seen"
        },
        {
          "text": "budget and instead gives himself a free vacation on Nike's dime lol.",
          "author": "Unknown",
          "likes": 322,
          "timestamp": "4:22 What if he would have chosen destinations in a such a way that when"
        },
        {
          "text": "drawn on a map, it would form the NIKE logo.",
          "author": "Unknown",
          "likes": 318,
          "timestamp": "*Travels around the world* *uses attractive women as thumbnail* what"
        },
        {
          "text": "a great message!",
          "author": "Unknown",
          "likes": 287,
          "timestamp": "who's watching this in 2017"
        }
      ]
    },
    {
      "video_id": "video_6",
      "title": "Bike Lanes by Casey Neistat [Applause]",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 I'm getting a ticket for riding my bike not in the bike lane can't busting my balls I'm doing the world of favor Time: 00:10 - 00:20 rideing my bike it's pouring rain out here doing the world of favor yeah look at this look at these [ __ ] look at this guy double parked right here in a bus lane you're not giving him a ticket Time: 00:20 - 00:30 smil it in guilty not guilty everything you need back you're a bicyclist so it's it's anywhere um from $10 uh up to 130 depending on your Time: 00:30 - 00:40 record but it's a bicycle summmer a bicycle summer just we're not riding in a bicyc you know red lights Time: 00:40 - 00:50 [Music] Time: 00:50 - 01:00 so I got a ticket for not riding in the bike lane but often there are Time: 01:10 - 01:20 obstructions that keep you from properly riding in the bike Time: 01:20 - 01:30 la [Music] Time: 01:30 - 01:40 [Music] listen up as you've been hearing on our show and elsewhere the police continue Time: 02:00 - 02:10 to crack down on biking infractions as the number of bikers explodes throughout the city ticketing is on the rise Casey in Manhattan you got a ticket this month Time: 02:10 - 02:20 uh yeah I got a a ticket about three weeks ago for riding my bike not in the bike lane not in the bike lane Alex is holding up a sign that says you could Time: 02:20 - 02:30 have just said it his sign says not illegal yeah I wish I had known that before I paid the $50 ticket well so Time: 02:30 - 02:40 [Music] Time: 02:40 - 02:50 [Music] Time: 02:50 - 03:00He crashed into all those obstacles with the potential to seriously injure himself just to prove a point. That is some serious dedication, respects.",
      "comments": [
        {
          "text": "happiest moment in his life 😂",
          "author": "Unknown",
          "likes": 25180,
          "timestamp": "This was ahead of its time"
        },
        {
          "text": "times just to prove a point is amazing. I adore him. I love how salty he can be.",
          "author": "Unknown",
          "likes": 15407,
          "timestamp": "took nearly 2 years but Bike Lanes just passed 10 MILLION VIEWS!"
        },
        {
          "text": "2nd: Casey gets $2000 in medical bills for proving a point",
          "author": "Unknown",
          "likes": 9495,
          "timestamp": "Let’s just appreciate how commited he was to proving his point"
        },
        {
          "text": "Edit:Thank you so much for 8.5k likes",
          "author": "Unknown",
          "likes": 8341,
          "timestamp": "This is the most wonderfully passive agressive thing I have ever seen. He has"
        },
        {
          "text": "earned my sub.",
          "author": "Unknown",
          "likes": 8028,
          "timestamp": "Idk why its funny to see casey’s revenge by hitting everything he see in the bike"
        },
        {
          "text": "lane",
          "author": "Unknown",
          "likes": 7662,
          "timestamp": "Dam'n you seriously made an effort to prove your point"
        },
        {
          "text": "have avoided it?” Well then he’d have to move out of the bike lane",
          "author": "Unknown",
          "likes": 7501,
          "timestamp": "I like how he's not slowing down, he just straight slamming his bike and his body"
        },
        {
          "text": "to the obstacles",
          "author": "Unknown",
          "likes": 7341,
          "timestamp": "Riding straight into the police car... parked on the bike lane you are supposed to"
        },
        {
          "text": "stay on: brilliant!!! 😂 Though I wonder: how much (& how many times) did you\ninjure yourself falling off your bike?... But hey, the demonstration was totally\nworth it!!!",
          "author": "Unknown",
          "likes": 6385,
          "timestamp": "Love how he crashes into a truck, rolls inside and NO ONE cares."
        },
        {
          "text": "place to ride\nRespect",
          "author": "Unknown",
          "likes": 5627,
          "timestamp": "I'm a cop and approve of this video as common sense, LOL."
        },
        {
          "text": "God bless this guy",
          "author": "Unknown",
          "likes": 4436,
          "timestamp": "Casey Neistat"
        },
        {
          "text": "still one of my absolute favorite videos on YouTube. Thumbs up from me.",
          "author": "Unknown",
          "likes": 3745,
          "timestamp": "I like how Casey has the biggest ever smile while slowly cycling right into a"
        },
        {
          "text": "police car he can see from two blocks away lmao",
          "author": "Unknown",
          "likes": 3676,
          "timestamp": "This video’s ad revenue sure got his $50 back..."
        },
        {
          "text": "Casey: um... another cop told me to ALWAYS ride in the bike lane soooooooo",
          "author": "Unknown",
          "likes": 3521,
          "timestamp": "“Hello Im Casey Neistat, Welcome to Jackass”"
        },
        {
          "text": "*Gets $50 fine*\ndeliberately crashes into cop car to prove a point\n*receives no fine*",
          "author": "Unknown",
          "likes": 3337,
          "timestamp": "2021, and he's still crashing his bike into every other NYPD car parked illegally"
        },
        {
          "text": "on a bike lane.",
          "author": "Unknown",
          "likes": 3229,
          "timestamp": "OMG that was your best movie Casey..."
        },
        {
          "text": "2011: waaait\n2012: waaait\n2013: waaait\n2014: waaait\n2015: waaait\n2016: waaait\n2017: waaait\n2018: waaait\n2019: GO",
          "author": "Unknown",
          "likes": 3171,
          "timestamp": "You can see him smiling as he approaches the police car. That one moment"
        },
        {
          "text": "probably made all the previous crashes worth it",
          "author": "Unknown",
          "likes": 2991,
          "timestamp": "Asking  8 years later"
        },
        {
          "text": "Did he get his 50 dollars back?",
          "author": "Unknown",
          "likes": 2963,
          "timestamp": "Some years later and he is snowboarding with the NYPD"
        },
        {
          "text": "2020: Viewer: Did he get back his 50$?",
          "author": "Unknown",
          "likes": 2169,
          "timestamp": "The 4.2 k dislikes are from cops"
        },
        {
          "text": "seriously injure myself or someone else.\nThe police: Excuse me *WHAT?*",
          "author": "Unknown",
          "likes": 2115,
          "timestamp": "This is the best protesting video i have ever seen xD"
        },
        {
          "text": "Neistat a ticket.",
          "author": "Unknown",
          "likes": 1874,
          "timestamp": "legal question: could he sue the nypd for that \"accident\"?"
        }
      ]
    },
    {
      "video_id": "video_7",
      "title": "INCREDIBLE LUFTHANSA FIRST CLASS REVIEW featuring WESLEY SNIPES[Music]",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 at 9:30 tonight. I'm flying to Germany. Now, I did upgrade. Wasn't that Time: 00:10 - 00:20 big of a deal. I was able to use miles. I was able to upgrade to uh first class. Time: 00:20 - 00:30 The lounge appears to be broken into three different parts. Downstairs is like the regular part of the lounge. It looked nice downstairs. This floor here, Time: 00:30 - 00:40 this is like the fancy lounge and they have delicious food. But then up here is like the first class lounge and it's so fancy up there that I wasn't actually comfortable being up there. It's like Time: 00:40 - 00:50 super intimate. There's a waiter and that I came down here cuz this is more my speed. This is the food situation here. I had like some chicken and some sort of Time: 00:50 - 01:00 steak. It was totally fine. Totally good. Kind of like buffet food. Uh and then I had a decaf cappuccino. Cappuccino cuz cappuccinos are great, Time: 01:00 - 01:10 but decaf cuz I want to I want to sleep on the plane. This is the bar. That's the That's the bar there. There doesn't seem to be anybody at the bar. Time: 01:10 - 01:20 But now I am traveling alone which is a little bit a little bit lonely but seem to be a lot of interesting people on this flight. Let's go see what's happening Time: 01:20 - 01:30 upstairs first class whining and dining. [Music] Nice. Time: 01:30 - 01:40 [Music] What? Going to have to have to rethink this one. Time: 01:40 - 01:50 Casey, right? I'm Casey. My husband know you all. Really? What's your name? Liza. Liz. Liza. Liz. Nice to meet you. That's it. Yes, sir. What do I do now? Time: 01:50 - 02:00 I'm not coming up here to eat. Okay. I'm just coming up. I'll come here to harass this guy. Come up here and have some have some chill out moments with Py. I Time: 02:00 - 02:10 was just telling the camera that I didn't know anybody here, but look at that. Wesley Snipes. Hey, and he didn't know that I was like a fan and a subscriber. And guess what I am? And Time: 02:10 - 02:20 guess who I see you in the airport. Casey, I appreciate it, Wesley. Hey, baby. How's that going, man? Always bet on Time: 02:20 - 02:30 black. About 15 minutes before the flight takes off. Just going to check out this bottom tour here. Hey ladies. How are you doing? I'm great. Time: 02:30 - 02:40 Oh, hey, look, another friend. How's it going? It's Marquez. Marquez, where you headed, buddy? Well, Germany, then France. I'm just kidding. I knew Marquez Time: 02:40 - 02:50 was on this flight, who I didn't know was on this flight. Is this girl? Oh, no, no, no. Hi, Casey. Can I not show your face, Coll? I'm really just not Time: 02:50 - 03:00 looking cute. Flight boards in 5 minutes. I'm take a quick shower. Uh, I got to pixelate Time: 03:00 - 03:10 this. Great shower. Rockolid shower. Just got to get dressed and uh yeah, now I got to go get my got to get my flight. Time: 03:10 - 03:20 Showering at the airport remains one of my favorite things in the world. From Kazakhstan. Time: 03:20 - 03:30 It's nice to meet you. Nice to meet you. Nice to meet you. See you later. Thank you for everything. You're very welcome. Bye. So nice. Hey, they're so nice. Everybody's so Time: 03:30 - 03:40 nice. Hi. So, welcome aboard. Hi. Three alpha. Time: 03:40 - 03:50 3A. That's my seat there. What's going on here? Time: 03:50 - 04:00 Nothing freaks people out more than video cameras on airplanes. You know what I'm talking about. So, this is the first class cabin. It's Time: 04:00 - 04:10 the front tip of the nose of the 747. There's like a little bar right here, which looks lovely. These seats all the way at the front are the best cuz nobody Time: 04:10 - 04:20 walks past you. Just own this front. But I'm not complaining. My seat's fantastic. Oh, hello. How are you? Seat is big and comfortable. Time: 04:20 - 04:30 You good? Good. [Music] All right, we're taking off soon. So Time: 04:30 - 04:40 far, this first class experience has been amazing. This is the menu and there's like a handwritten welcome. Honestly, I don't know if I'm going to Time: 04:40 - 04:50 have dinner tonight cuz I ate so much in the lounge. But um the pilot came out earlier to say hi. Like the actual pilot, not a flight attendant, the actual pilot. My own closet for my Time: 04:50 - 05:00 skateboard. Amazing. And your luggage as well. Okay, I'm going to put my skateboard. Use this one for the secret hiding things, you know. Okay, I appreciate it. And it closes. I got my Time: 05:00 - 05:10 own closet to hide my skateboard in. Please ensure that it cannot fall. To unfasten your seat belt, simply Time: 05:10 - 05:20 [Applause] [Music] Time: 05:20 - 05:30 All right, we're in the air now. I'm going to go to sleep and uh I'm going to Time: 05:50 - 06:00 go to sleep and then give you a comprehensive review of how the bed was when I when I wake up. Okay, good Time: 06:00 - 06:10 night. That's a That's a great bed. Time: 06:10 - 06:20 That's a great bed. I slept like one would in their bed at home. I mean, I slept like a baby. They're just so nice here. Time: 06:20 - 06:30 to consume our special in economic class. We will now collect the headsets. You will assist us by leaving. Thank you. Thank Time: 06:30 - 06:40 you. [Music] Okay. I think we landed like 5 minutes, Time: 06:40 - 06:50 something like that. Time: 06:50 - 07:00 All right, that's it. We are We are on the ground in Germany. Looks nice out there. Captain Shade and the crew would like to say goodbye to all passengers at Time: 07:00 - 07:10 this time. It was a pleasure having you on board this Starlight and we are looking forward to seeing you on one of our so long. Thank you. Time: 07:10 - 07:20 [Music] Time: 07:20 - 07:30apparently i spelled Luftanstia wrong about a dozen times in this video.  if you're new here please know i can't spell real good.  i hope that's not a deal breaker. apprecaite your understanding",
      "comments": [
        {
          "text": "Everyone on the the plane:Oh hi Casey!",
          "author": "Unknown",
          "likes": 6715,
          "timestamp": "i like to believe casey actually sleeps with his glasses on"
        },
        {
          "text": "not be nice if you paid like 10k or even more for your ticket. lol",
          "author": "Unknown",
          "likes": 2733,
          "timestamp": "\"I'm gonna give a comprehensive review of the bed when i wake up\""
        },
        {
          "text": "\"that's a good bed\"\nvery comprehensive Casey, thank you",
          "author": "Unknown",
          "likes": 2425,
          "timestamp": "M A R K A S S  B R O W N L E E"
        },
        {
          "text": "and Supermodel Karlie Kloss?? okkk",
          "author": "Unknown",
          "likes": 1179,
          "timestamp": "why is nobody talking about the fact that he met freaking wesley snipes"
        },
        {
          "text": "tissues and stuff.",
          "author": "Unknown",
          "likes": 902,
          "timestamp": "Plot Twist - Was an Ad for BILLY The whole time!!!!"
        },
        {
          "text": "economy class.",
          "author": "Unknown",
          "likes": 863,
          "timestamp": "turns out Wesley snipes ain't broke lol"
        },
        {
          "text": "him.",
          "author": "Unknown",
          "likes": 749,
          "timestamp": "No one will ever know why this comment has 700 likes"
        },
        {
          "text": "Random dude next to him: what the heck are you doing\n😂😂😂",
          "author": "Unknown",
          "likes": 723,
          "timestamp": "Was almost going to forgo watching this but you had me at Wesley Snipes."
        },
        {
          "text": "I look like Voldemort when I travel.",
          "author": "Unknown",
          "likes": 606,
          "timestamp": "I wonder if Casey's ever been editing at a lounge or while sitting next to"
        },
        {
          "text": "someone on a flight, and he forgets the whole \"stripping nude and hopping in/out\nof the shower\" part of his video. Must make for great conversation. Been there.\nDone that. Middle seat. Economy. Didn't even end up using the scene. SMH.",
          "author": "Unknown",
          "likes": 572,
          "timestamp": "Hide me in your suitcase next time please"
        },
        {
          "text": "I threw it\nIt did not fly\nI will stop messing with you go back to reading other comment",
          "author": "Unknown",
          "likes": 525,
          "timestamp": "Your plane videos make me less scared to go on a plane"
        },
        {
          "text": "edit: thanks for the likes!",
          "author": "Unknown",
          "likes": 469,
          "timestamp": "Who else is from Germany ?"
        },
        {
          "text": "pyramid review like:*\n-\"I was not hired by Ramses II, the Dynasty didn't know i was making it\"",
          "author": "Unknown",
          "likes": 446,
          "timestamp": "Casey Neistat: I know what my Job Would be, Making videos about Planes"
        },
        {
          "text": "Coronavirus: I will ruin this Man Wohle career",
          "author": "Unknown",
          "likes": 404,
          "timestamp": "People are so much more nicer when you have a camera pointing at them......."
        },
        {
          "text": "and fleeing to Switzerland to evade the IRS.",
          "author": "Unknown",
          "likes": 338,
          "timestamp": "Other people do Hotel reviews, Mobile Phone reviews, Restaurant reviews, Car"
        },
        {
          "text": "reviews, Playstation reviews etc. but Casey does *Airplane reviews* .",
          "author": "Unknown",
          "likes": 333,
          "timestamp": "The guy sitting next to him is like wtf when he is looking at the menu"
        },
        {
          "text": "Wesley Snipes. By the way, how awesome it is that even Wesley Snipes is a\nCasey subscriber? And who else thought initially that Marques was Wesley's\nson? 😜😝😛",
          "author": "Unknown",
          "likes": 329,
          "timestamp": "Someone, please, take me back to my Blade days"
        }
      ]
    },
    {
      "video_id": "video_8",
      "title": "INCREDIBLE First Class BAR AND SHOWER!!! hi how are you sir I'm ready right deposition team okay I don't even like champagne",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 [Music] Time: 00:10 - 00:20 I got to go it's 827 right now I want to be out of the house by 8 o'clock instead I spent Time: 00:20 - 00:30 all his time playing with Francine so she was being super cute and now what else is new I'm super late kind of over what I'm not even done packing yet all Time: 00:30 - 00:40 right are you gonna walk me out girls [Music] Time: 00:40 - 00:50 today by the calendar is my least favorite day of the year it is September Time: 01:00 - 01:10 11th I made a couple of videos one in particular that is right there or right there about why I hate this day so much I'm not going to get into it I am flying Time: 01:10 - 01:20 today which doesn't make me nervous at all [Music] Time: 01:20 - 01:30 are you doing taking Marvin Marvin Anthony Marvin I watched your video this morning by video this morning I won't Time: 01:40 - 01:50 and there's a lounge on the plane yes how big is the lounge if you could be sitting at the bar while it's landing Time: 01:50 - 02:00 how's that even possible this is my first time on Emirates and there's a there's a bar and a lounge on the plane have you flown em right before my first time Jhansi hey hey on the bar yeah you Time: 02:00 - 02:10 gonna be there yeah I'll be there minor issue did not realize any division to go to Australia Time: 02:10 - 02:20 Emirates said they can get me one right here [Music] all right Marvin I got the visa to Time: 02:20 - 02:30 incredible things I want to point out they serve real pure maple syrup it has a New Englander that's everything there Time: 02:30 - 02:40 are restaurants in New York City where waffles like 20 bucks and they serve you that corn syrup on top of that look up in the lounge I can board the plane directly from the lounge Time: 02:40 - 02:50 [Music] Time: 02:50 - 03:00 marvin am i the only passenger left in the lounge I'm coming I'm coming this size that plane I have had some fantastic airplane experiences in the Time: 03:00 - 03:10 last couple weeks hi sorry I'm late I was hanging out Marvin Risa I did get the visa to get your guns in the plane Oh finally Time: 03:10 - 03:20 that's your seat this is all me here are you kidding me with the seat there's Time: 03:20 - 03:30 like hi this is my own little snack bar this is just for my seat look soda water Time: 03:30 - 03:40 socks and eye shades I know you're thinking right now you're like okay see that TV it's kind of small that's not the TV that's the remote the Time: 03:40 - 03:50 TV's right here besides this TV this is how you can fool it I am very very excited about this flight Time: 03:50 - 04:00 welcome aboard this separates a380 service to divine to National Airport we're all set to go a short one we'll be on our way towards [Music] Time: 04:00 - 04:10 I could've just as easily changed at my seat and just in one of the rude plus it Time: 04:20 - 04:30 was a window in this bathroom 11 hour flight to Dubai [Music] competing in Shifu Time: 04:30 - 04:40 allow myself one movie and then is sleep so I'm rested when I arrive that's plan anyways Time: 04:40 - 04:50 there's a bar this airplane but it's less of a bar it's more of a nightclub enormous image this is the bar here Time: 04:50 - 05:00 that's the bartender there this guy's time went on it gets snacks all over the place Time: 05:00 - 05:10 these snacks if you want to watch TV or something it's here they have snacks here and then it'll like these snacks you can order some snacks Time: 05:10 - 05:20 [Music] there was a touch of turbulence Time: 05:20 - 05:30 didn't ask us to go to our seats instead we sat on this bench and put seatbelts on the party's film I did a costume change because Robin and George were Time: 05:30 - 05:40 helping me take pictures go to the photo shoot and the yellow sort of blended in so yeah but the photo came up ray was straight up partying with the flight Time: 05:40 - 05:50 crew at the bar this is the most fun I've ever had on a plane before okay one of my new homies George the guy was hanging with him back he works the Time: 05:50 - 06:00 first-class cabin this is not as good as it gets better than this he has invited me up the first-class cabin to check it out pretty excited again this is not like a Time: 06:00 - 06:10 branded commercial forever if they didn't know I was on I said this was just booked for me by like I didn't this airplanes amazing Time: 06:10 - 06:20 it going up to first class with permission going up to first class they can even get to we're rolling oh yeah Time: 06:20 - 06:30 we then usually do this but yet Time: 06:40 - 06:50 your magic yes you did this is the bathroom yeah so door just give me a tour of this spa Time: 06:50 - 07:00 that's on this play I got proper smell hey why are my feet so hot is the floor heated it is indeed Time: 07:00 - 07:10 a be corrected like that you can control the floor this is bigger than my house there we go oh is that a real rose Time: 07:10 - 07:20 how long does a person get to shower in here I can get 30 minutes in here my gosh in the whole third session you do where's the water way around for five Time: 07:20 - 07:30 four five minutes but you can stop me then you know pause and just chill on your couch have you ever showered on this airplane absolutely you have absolutely not no Time: 07:30 - 07:40 that's a big no I did not get the chance yes these are really something else these are good that's expense that's Time: 07:40 - 07:50 fancy stuff that's rich people products that's how we roll yeah okay is there a way that you can just Time: 07:50 - 08:00 rent this spot out for the whole flight because I could sleep in here you got a little TV up there pretty much you got everything son there Time: 08:00 - 08:10 that's incredible put this mattress on the sea to the sea is like Maui proper Time: 08:10 - 08:20 Mikey's a morning Mohammed slept like a baby sounds like it is popping off in the Time: 08:40 - 08:50 lounge in the lab yeah hey you back that absolutely Time: 08:50 - 09:00 but holding it down out here we were looking for you ready for the video we emptied all the bar and like we were sleeping soundly you you fell asleep Time: 09:00 - 09:10 so you missed all the action gonna get gonna drink my woods half I'll have a double thank you Time: 09:10 - 09:20 [Music] Time: 09:20 - 09:30 we had an hour and a half left I've got breakfast now and maybe do a little bit Time: 09:30 - 09:40 more work and then say goodbye which is really really sad because and it having a blast this guy's president Bob way he hasn't clearly Suns coming up Time: 09:40 - 09:50 first those you're helping out thank you so much Time: 09:50 - 10:00 maybe survived by captain I asked for coffee but they offered Time: 10:00 - 10:10 cappuccino and I graciously accepted we are just about to land now and I can confidently say this is one Time: 10:10 - 10:20 awesome there's only a half nightlife I got layover and that this whole thing over again like another 11 hours I can't Time: 10:20 - 10:30 wait - I am right so we're working for works Time: 10:30 - 10:40 [Music] Time: 10:40 - 10:50Hello random person watching kinda old Casey Neistat videos because there just entertaining. Hope your good",
      "comments": [
        {
          "text": "Hostess- Oh the peasants",
          "author": "Unknown",
          "likes": 7425,
          "timestamp": "Casey made more friends on that plane than I did in school 😔"
        },
        {
          "text": "3 days and the hard part of flying and making youtube vids is finding an internet\nconnection good enough to upload.  SO FRUSTRATING!!!  please be patient -\nim trying.  also making some really really fun videos that I am super duper\nexcited to share.",
          "author": "Unknown",
          "likes": 4898,
          "timestamp": "Guy: “Got your visa?”"
        },
        {
          "text": "Casey: “Yeah, *_got your guns on the plane?_* ”",
          "author": "Unknown",
          "likes": 4799,
          "timestamp": "I have absolutely no idea how Casey makes vlogs of this quality every single"
        },
        {
          "text": "day. If you really think about it, it's so incredibly difficult and he's mastered it.",
          "author": "Unknown",
          "likes": 3530,
          "timestamp": "Watching this, I actually felt like I was on the plane and got excited then I paused"
        },
        {
          "text": "it and remembered that I was at home and have school in 6 hours :/",
          "author": "Unknown",
          "likes": 3370,
          "timestamp": "When you realize that the plane is better than your house"
        },
        {
          "text": "*goes closer*\n“That’s not the tv, that’s the remote”",
          "author": "Unknown",
          "likes": 3285,
          "timestamp": "This was definitely one of the best vlogs you've had in a long time, i was smiling"
        },
        {
          "text": "the entire time",
          "author": "Unknown",
          "likes": 2991,
          "timestamp": "It's fun watching people live life to the fullest"
        },
        {
          "text": "Flight attendant  : \"economy Class\"\nMe : Cries in poor",
          "author": "Unknown",
          "likes": 2253,
          "timestamp": "\"Sorry I'm late.....I was hangin' out with Marvin.\""
        },
        {
          "text": "fucking died.",
          "author": "Unknown",
          "likes": 1787,
          "timestamp": "\"Did you get your guns in the plane\" lmao"
        },
        {
          "text": "guns on the plane is probably not the best idea",
          "author": "Unknown",
          "likes": 1507,
          "timestamp": "I've *still* haven't been in a plane yet"
        },
        {
          "text": "Edit:\n*EVERY TIME I WILL ADD A FLOWER AND BTW THIS IS THE MOST LIKES\nI'VE EVER GOT! *\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸\n🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸🌸",
          "author": "Unknown",
          "likes": 1507,
          "timestamp": "I AM OBSESSED with this video!! I'm a flight attendant so it was so cool to see"
        },
        {
          "text": "the behind the scenes view like this of their plane 😍✈",
          "author": "Unknown",
          "likes": 1475,
          "timestamp": "how is he affording this always ????"
        },
        {
          "text": "with socks pulled all the way up lol",
          "author": "Unknown",
          "likes": 1219,
          "timestamp": "9:13 how to tell they're drunk."
        },
        {
          "text": "One does a dodgy laugh\nOne doesn't have a clue what's going on\nAnd the other asks for more alcohol\nWtf",
          "author": "Unknown",
          "likes": 1114,
          "timestamp": "The Emirates best marketing plan: UPGRADE HIS SEAT"
        },
        {
          "text": "“Hello, would you like a free tour to our economy cabin?”",
          "author": "Unknown",
          "likes": 920,
          "timestamp": "Ahhhh Emirates.. The multi billion dollar company who sponsors the super-team"
        },
        {
          "text": "Real Madrid with the most expensive players. Only seems fit, never knew it was\nthis nice though.",
          "author": "Unknown",
          "likes": 873,
          "timestamp": "When the traveling is better than the trip"
        },
        {
          "text": "\"Yeah. finally. Did you get your guns on the plane?\"\nHahahahahahah",
          "author": "Unknown",
          "likes": 728,
          "timestamp": "To the 0.000001% of people who read this happy holidays"
        },
        {
          "text": "\"...The economy class cabin\"\nI don't know why but her tone sounded so petty 😂",
          "author": "Unknown",
          "likes": 650,
          "timestamp": "THIS LOOKS WAYYYY BETTER THAN A PRIVET JET"
        },
        {
          "text": "Casey Neistat- I love flying and wanna live on the plane\nProof that money can buy happiness",
          "author": "Unknown",
          "likes": 608,
          "timestamp": "This is the life of being rich"
        },
        {
          "text": "💸💸💸💸💸💰💰💰💰💰💰💸💰💸💰💸💸💰💸💰💰💰💰💰",
          "author": "Unknown",
          "likes": 601,
          "timestamp": "Flight attendants: So here is the bar and back there is the peasants"
        },
        {
          "text": "Casey: *sleeps with an eye mask and sunglasses*",
          "author": "Unknown",
          "likes": 538,
          "timestamp": "who says money can't buy happiness"
        },
        {
          "text": "George: Absolutely!",
          "author": "Unknown",
          "likes": 521,
          "timestamp": "Casey : \"What's down there?\""
        },
        {
          "text": "Flight Attendant  : \"The Poor\"\nFrench Monarchy: \"Let them eat cake\"",
          "author": "Unknown",
          "likes": 503,
          "timestamp": "Damn Casey, Emirates be treating you like a KING! hahaha"
        }
      ]
    },
    {
      "video_id": "video_10",
      "title": "WHY I ALWAYS WEAR SUNGLASSES it was no major equipment as you to be my guy",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 quick run this morning because this Time: 00:20 - 00:30 morning is morning is daddy-daughter swim class going swimming Time: 00:30 - 00:40 I had a meeting in Midtown this morning took the subway I don't feel like a change of pace today's episode in its Time: 01:00 - 01:10 entirety is going to be about my sunglasses now I've made an entire movie about the design of my sunglasses and Time: 01:10 - 01:20 then like a year ago I made an entire vlog episode about how to make these sunglasses you want a sharp knife and Time: 01:20 - 01:30 you just kind of straight today I want to really get into like the why why wear sunglasses plus I need to buy a new pair and these are kind of whoa these are not Time: 01:30 - 01:40 sunglasses so it'd look crazy don't lie it's superhero oh look this is like a heads-up display set up for this little Time: 01:40 - 01:50 drone that was a gift it's one of those like you shoot like 60 mile an hour racing drones let me stand subject Time: 01:50 - 02:00 today's video is going to be just about my sunglasses a long time ago somebody asked Jack Time: 02:00 - 02:10 Nicholson why he always wears sunglasses and he responded when I'm not wearing sunglasses and just another old guy and Time: 02:10 - 02:20 when I am wearing sunglasses I'm Jack Nicholson he wanted to get me on my back the following scene is not sponsored by Time: 02:20 - 02:30 nor made an affiliation with this sunglass store Time: 02:30 - 02:40 does your sunglasses they are my sunglasses not as good as yours but do Time: 02:40 - 02:50 you ever wear sunglasses at night always really only way to rid of them I'm Casey hi Casey okay let's see what these are virgin Time: 02:50 - 03:00 glasses they feel so good these are mine that's why thank you nice to meet you Time: 03:00 - 03:10 now I just want to be SuperDuper clear this is not an endorsement of this brand these glasses are the only vices that fit on my gigantic head so that's why I Time: 03:10 - 03:20 wear them if you're thinking of making your own glasses I suggest finding a pair that works for you and start there Time: 03:20 - 03:30 Chloe asked hey Chloe on a scale of 1 to 10 how much does Candace dislike me Time: 03:30 - 03:40 wearing my glasses it's not that she doesn't like me wearing the glasses that she doesn't like me wearing the glasses like when I'm not outside or when it's not sunny out Time: 03:40 - 03:50 has anyone ever has anyone ever stolen a pair from you no does Candace ever accuse you of using them to check out other beautiful no no Time: 03:50 - 04:00 how often do you get new ones well I did just get a new pair but typically like less than once a year I rarely lose them that's one of the good parts of always wearing them is that you always know Time: 04:00 - 04:10 where they are do you wear them all the time off camera not really how much they cost I think they're like 150 dollars minus the spray paint are you Time: 04:10 - 04:20 uncomfortable showing your eyes know what spray paint Brandie is krylon the Time: 04:20 - 04:30 spray painted champions why do you make your nice glasses look like they came from the dollar store well I think nice is in the eye of the beholder that was a play on words Time: 04:30 - 04:40 I think these glasses are nicer because I made them than sunglasses that were made in Italy in a factory just because they're new doesn't mean they're nice I Time: 04:40 - 04:50 don't think those are nice I think those are generic these are mine how do you keep them clean I don't throw is filthy do you sleep with them on no but they're Time: 04:50 - 05:00 usually on my bedside table when I wake up here's a good question Oscar asks why do you buy real expensive ray-bans and remove the logo instead of buying cheap fake ones because these are actually Time: 05:00 - 05:10 higher quality glasses what makes a Mercedes or a Lamborghini nice is not just the thing that says Mercedes our Lamborghini it's actually a better car if you were to write Lamborghini on a Time: 05:10 - 05:20 Hyundai it wouldn't be a Lamborghini it would be a Hyundai that says Lamborghini so these are actually really good quality glasses that's glass not plastic and they're tough and I wear them Time: 05:20 - 05:30 everyday and they don't break usually so I like to wear good glasses I just don't like the name brand so I take it off Time: 05:30 - 05:40 Casey when are you going to make another pair how about right now making these things it's not that hard I don't know how many pair of made over the years the truth is Time: 05:40 - 05:50 I don't lose them and they don't really break but they do expire it's like all the balance that's in the plastic that makes up the frame it just starts to stretch out in time right now I'm Time: 05:50 - 06:00 scraping the logo off of the lens see I have a tendency to lose things and I'm Time: 06:00 - 06:10 making these so I've got a fresh pair and then this old pair here will become my backup hair just taking down the logo there don't paint in it Time: 06:10 - 06:20 the last step here is just hitting them with the paint you break every rule of spray painting because what you want is you want it to sink into the crack see you just flood them with paint that is Time: 06:20 - 06:30 the sloppiest worst spray paint job Time: 06:30 - 06:40 you'll ever see me do now I'll just leave them there to sit overnight when I wake up in the morning I'll scrape the paint off and they'll look kind of like these probably with just a touch more paint now the biggest question that I Time: 06:40 - 06:50 get asked is why why do I always wear sunglasses the first part of the answer is I just like believe glasses look there's a really pragmatic reason okay Time: 06:50 - 07:00 you know how when I'm talking to camera like I'm talking to camera right now I can always point at things like hey look at this screen right here or check out these lights behind me or check out this blue lunchbox right here or this movie Time: 07:00 - 07:10 poster movie I produced right there The Godfather it's right here I'm not looking into the lens I'm looking into this screen right here and that way I can frame things up I know what I'm Time: 07:10 - 07:20 looking at but what I do with my glasses off I don't look like I'm looking at you I look over here so like imagine if in all my vlogs I'm looking like this it Time: 07:20 - 07:30 starts to feel really weird and I can look back here and then look over there try to pretend to look over there but in the end it's just like if I want to point at this I can either look over Time: 07:30 - 07:40 here or I look here and just sort of guess but when I have glasses on it always looks like I'm looking at camera so that's why I started wearing glasses Time: 07:40 - 07:50 and all my vlogs it's like a really practical reason that's why at night it's just like it's the only way I can check my framing without Time: 07:50 - 08:00 having it look weird I hope see when people vlog and they're not looking into the lens it's like it doesn't what about my glass they're awesome that's you're Time: 08:00 - 08:10 lying no I'm not noise yelling you're gonna put them on there because your eyes are so cute and pretty and then you cover them with these glasses I Time: 08:10 - 08:20 know what you're talking about just such pretty broad I think I just like my glasses okay Time: 08:20 - 08:30 that's it Time: 08:40 - 08:50 will you help me cut my hair tonight No why not Time: 08:50 - 09:00The answer is at 6:50 Your welcome.",
      "comments": [
        {
          "text": "time, and yet I never think about it. It's like they're a part of you at this point.",
          "author": "Unknown",
          "likes": 3390,
          "timestamp": "He answers the question at 6:50"
        },
        {
          "text": "Without them, I'm fat and 60.\" /Jack Nicholson/ What a legend!",
          "author": "Unknown",
          "likes": 2750,
          "timestamp": "2016 - Nah."
        },
        {
          "text": "2017 - Nope.\n2018 - No way.\n2019 - Let's recommend this.",
          "author": "Unknown",
          "likes": 2592,
          "timestamp": "The glasses make such a huge difference though, he's like a whole new person"
        },
        {
          "text": "with the glasses on haha",
          "author": "Unknown",
          "likes": 2057,
          "timestamp": "I love that Casey never changed like most youtubers do once they go huge. The"
        },
        {
          "text": "only way that he has changed is becoming more successful, becoming an even\nbetter father/ husband, and making even better videos. Keep doing your thing,\nCasey.",
          "author": "Unknown",
          "likes": 2030,
          "timestamp": "Casey neistat is the only person, I know looks the best in sunglasses"
        },
        {
          "text": "I don't need sleep, I need answers",
          "author": "Unknown",
          "likes": 1350,
          "timestamp": "As time goes by... and Candice seem more and more comfortable on the"
        },
        {
          "text": "camera... one day she may do a takeover of Casey's vlogs!",
          "author": "Unknown",
          "likes": 1332,
          "timestamp": "Casey, i dare you to not wear sunglasses for an in tire vlog!"
        },
        {
          "text": "nailed it withe the sunglasses. Smart guy.",
          "author": "Unknown",
          "likes": 1066,
          "timestamp": "he answers the question at 6:55"
        },
        {
          "text": "Sunglasses make him look lit",
          "author": "Unknown",
          "likes": 952,
          "timestamp": "He looks like 10 years older without the glasses."
        },
        {
          "text": "and honest individual. You go, girl.",
          "author": "Unknown",
          "likes": 826,
          "timestamp": "so honest..."
        },
        {
          "text": "now I think I'm beginning to understand how his mind works ... and I LIKE it.\nPlus Casey is a very talented and imaginative cinematographer (if that's the\ncorrect expression to use).",
          "author": "Unknown",
          "likes": 794,
          "timestamp": "I love this guys videos the plane ones are the best"
        },
        {
          "text": "eyebags",
          "author": "Unknown",
          "likes": 771,
          "timestamp": "Anyone else watching from Europe?"
        },
        {
          "text": "is always high",
          "author": "Unknown",
          "likes": 586,
          "timestamp": "Did you guys notice that the gas door thingy on the side of the first peoples car"
        },
        {
          "text": "was open",
          "author": "Unknown",
          "likes": 575,
          "timestamp": "6:56 u welcome"
        },
        {
          "text": "Your welcome.",
          "author": "Unknown",
          "likes": 571,
          "timestamp": "let's be honest though: He does look better with sunglasses on"
        },
        {
          "text": "throws it",
          "author": "Unknown",
          "likes": 499,
          "timestamp": "This guys fame is confusing"
        },
        {
          "text": "$1500 after Casey NEISTAT modification",
          "author": "Unknown",
          "likes": 393,
          "timestamp": "Does it annoy anyone else the way he just throws thousands of dollars of"
        },
        {
          "text": "equipment around?",
          "author": "Unknown",
          "likes": 383,
          "timestamp": "I don't know why i keep watching this guy videos, youtube autoplay keeps going"
        },
        {
          "text": "on and on.. awesome channel mate",
          "author": "Unknown",
          "likes": 372,
          "timestamp": "I couldn't see the kid in the beginning?"
        },
        {
          "text": "me.)",
          "author": "Unknown",
          "likes": 353,
          "timestamp": "I like this guy. He's very real. It's not about the name brand it's about the quality."
        },
        {
          "text": "But then he gives himself a butchers haircut lol I can trust this guy. He does\nwhatever the fuck he wants as long as it makes him feel happy.",
          "author": "Unknown",
          "likes": 351,
          "timestamp": "A brand of sunglases should sell casey's glasses"
        }
      ]
    },
    {
      "video_id": "video_11",
      "title": "DO WHAT YOU CAN'T to the haters the doubters my seventh",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 grade vice principal to everyone who's ever told anyone with a dream they can't this video is for Time: 00:10 - 00:20 you keep your head down follow the rules do as you're told play it safe wait your turn ask permission learn to compromise Time: 00:20 - 00:30 this is terrible advice if I were to write an autobiography a book about my life one title that would work would be do what Time: 00:30 - 00:40 you can't because that idea encapsulates everything I've ever done like when I wanted to move to New York City and my dad was like you can't you don't have any money or when I first said I wanted Time: 00:40 - 00:50 to make movies and it was you can't you didn't go to film school I want to have a TV show you can't Casey you're not pretty enough Time: 00:50 - 01:00 and to go even further like if I were to characterize what this new generation of content creators and filmmakers what what we all do on YouTube and everywhere Time: 01:00 - 01:10 else is we do what we [Music] can't you can't be an action movie Time: 01:10 - 01:20 filmmaker but you get your parkour friends to dress up like video game characters jump off some buildings and you can right Devon yes you can't have a Time: 01:20 - 01:30 talk show but you have a webcam and you can up You Beautiful Bastard what this is my first YouTube video ever next thing you know you're interviewing the president I heard that you're going to Time: 01:30 - 01:40 be out of a job soon maybe I'll start a YouTube show that's what I'm thinking you can't fly around New York City on a magic carpet but get your electric skateboard some PVC pipe a great outfit Time: 01:40 - 01:50 give Jesse a call and you can what do you think this going be so dope you don't need gear you don't need trucks or a crane you don't need some big expensive camera that never worked when Time: 01:50 - 02:00 you're a Creator you don't need someone in your ear telling you what you can and can't do I'm racing the subway what you can and can't say I accidentally did the Time: 02:00 - 02:10 Shocker oh my God they call us Gamers influencers internet famous what the [ __ ] does that mean but we know something they don't you can start a vlog or a makeup Channel we travel Time: 02:10 - 02:20 around the world with a gigantic piano playing in beautiful places for interested people when you're a Creator all you need is your phone an internet connection and a g idea a story you want Time: 02:20 - 02:30 to share something you need to say confidence is within yourself and the rest is [Music] Time: 02:30 - 02:40 history if you do it right you get to quit the day job make friends from places you've never been meetups Time: 02:40 - 02:50 collaborations just two boys and two video cameras a life moving so fast and so full you won't even have time to process it [Music] Time: 02:50 - 03:00 so to my fellow creators I say keep creating keep doing the [Music] Time: 03:00 - 03:10 work and never forget you don't have to listen to anyone because in this new world no one knows anything hi the haters the doubters are all drinking champagne in the top deck of the Titanic Time: 03:10 - 03:20 and we are the [ __ ] iceberg [Music] Time: 03:20 - 03:30 do what you can't [Music] Time: 03:30 - 03:40that really is my 7th grade principal.  when i was 12 he told me i'd be a loser, that i'd 'either be working at a gas station or in jail when i grow up'.  never discourage a child.  fuck that guy.",
      "comments": [
        {
          "text": "He became Mark Zuckerberg",
          "author": "Unknown",
          "likes": 4206,
          "timestamp": "This feels like an ad for being a youtuber."
        },
        {
          "text": "not smart enough\" and applied to nursing school. I'm halfway through my\nprogram and I couldn't be happier.",
          "author": "Unknown",
          "likes": 1395,
          "timestamp": "Better then YouTube rewind"
        },
        {
          "text": "what I can't.  I grew up with everyone telling me what I could and could not do.\nHow to do what I should do.  And when to do what I should do.  How to dress,\nwhen to dress and the result is I am a well above average IQ, brave adult who\ndid not do what I was created to do but did what I was told to do.  I deeply\nappreciate your message Casey.  Good on you.  You are half my age and one of\nmy heros.  The creators and wishers will do well to take your advice.",
          "author": "Unknown",
          "likes": 1169,
          "timestamp": "\"All the haters are on the top deck of the Titanic, and we are the FUCKING"
        },
        {
          "text": "iceberg.\"\n- Casey Neistat, 2017",
          "author": "Unknown",
          "likes": 1101,
          "timestamp": "Great video Casey! Thanks for helping tell all of our stories. Can't wait to see"
        },
        {
          "text": "what you can't do next 😂",
          "author": "Unknown",
          "likes": 1080,
          "timestamp": "I watched this video when it first came out. 5 years later I can confidently say"
        },
        {
          "text": "that what Casey's talking about WORKS",
          "author": "Unknown",
          "likes": 945,
          "timestamp": "\"The haters, the doubters are all drinking champagne at the top deck of the"
        },
        {
          "text": "Titanic, and we are the fucking iceberg\"  BEST... STATEMENT... EVER!",
          "author": "Unknown",
          "likes": 892,
          "timestamp": "Damn, this gave me the chills. So inspiring."
        },
        {
          "text": "titanic - and we are the fucking iceberg\" - Casey Neistat 2017",
          "author": "Unknown",
          "likes": 790,
          "timestamp": "Who's watching this in August 2020? I needed this..."
        },
        {
          "text": "Also Casey: “listen to me”",
          "author": "Unknown",
          "likes": 628,
          "timestamp": "That's it, I'm moving to New Mexico and starting my own Drug Empire."
        },
        {
          "text": "proved them wrong! Thankyou casey neistat.",
          "author": "Unknown",
          "likes": 556,
          "timestamp": "Whos here after seeing Casey leave New York?"
        },
        {
          "text": "piece of joy to throw at people!!!",
          "author": "Unknown",
          "likes": 473,
          "timestamp": "The haters, the doubters, are all sipping champagne on the deck of the titanic"
        }
      ]
    }
  ]
}