{
  "channel_name": "Mark Rober",
  "channel_id": "",
  "videos_count": 10,
  "fetch_date": "2025-11-04",
  "notes": "Converted from PDF - 11 pages",
  "videos": [
    {
      "video_id": "video_2",
      "title": "World's Largest Jello Pool- Can you swim in Jello? This is the world's first ever actual pool of Jell O.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:03 And while it may look simple, it's actually a very difficult engineering challenge to pull off. As proof, if you Google Jell O pool, you will either find bad CGI or a handful of videos of people who tried to to do this, but it really didn't work out. So today, we're gonna answer possibly the longest standing question from my childhood. What would it be like to actually belly flop in a pool of jello? But before we do that, I want to talk about what we actually had to go through for the past six months to pull this off. The idea of a jello pool has been on my bucket list for over four years. In fact, when Kevin from the backyard scientist and I made the 25,000,000 Time: 00:05 - 00:38 Orbeez pool, our first idea was to do a pool of jello. But it's really hard because if you've ever made jello, you might recall you first have to boil water then mix in the powder and then you have to refrigerate it for it to actually get firm. And that's easy enough to do for a small dish, but how do you boil and then refrigerate an entire pool? This seemed like a very worthy engineering challenge. So last year at Thanksgiving, my brother and I came up with a plan and then in the middle of winter, we started digging a hole in his backyard. Then over the course of two months, we set up a bunch of small scale experiments because we needed to answer questions like how much gelatin powder does it actually take to get to the ideal firmness and how hot and then cold does the mixture actually need to get for the jello chemical reaction to take place so it will actually get firm. From our experiments, we learned the jello always got firm as long as the mixture got hotter than a 60 degrees Fahrenheit. So we decided we could scale this up by using six fifty five gallon drums with a custom propane burner underneath and a spigot we welded to the sides, but more on that later. So now we knew how we were going to heat it up, but how do you refrigerate an entire pool? For that, we teamed up with mother nature and just picked the perfect location and time of year. We installed a thermometer and starting in January, we tracked the temperature in his his backyard every night. We needed refrigerator temperatures at night, but not freezer temperatures because that would freeze the jello and our experiments showed that totally ruins it. And so after looking at our data plus historical temperature plots, we knew we had about a three week sweet spot window towards the April to pull this off. Our goal was to have a jello pool party in his backyard that would make even Phineas and Ferb jealous. So the plan was to start seven days before the party and and fill the pool with an average of 10 barrels every day. That would give each layer a chance to get exposed to the cold night air to more efficiently get rid of the heat. And so with that, first thing Saturday, a full week before the party, we got to work. Time: 00:38 - 02:29 We didn't want to waste actual food, so this is just water and gelatin powder and food coloring, but there's no Time: 02:35 - 02:42 sugar. Time: 02:49 - 02:50 We intentionally placed our barrels much higher than the pool, so when we were ready, we could use the potential energy to move the jello from the barrels to the pool. Time: 03:13 - 03:20 We had to tackle about a thousand other issues that came up that I won't bore you with, but day by day and layer by layer, Time: 03:22 - 03:29 the pool began to fill up. Because the gel went in with so much heat energy we needed to remove before it could get firm, in addition to using the cold night air, my brother's neighbor Nick happened to have a spare swamp cooler in his shop. So we kept that running over the top of the pool pretty much the whole week. This gave us convection cooling. It's the equivalent of rolling down a car window for the pool or like when you blow on the top of a hot cup of soup. This constantly replaces the boundary layer of air right at the surface with fresh cold air air that will suck out the heat more efficiently. And so as we put in the final batch Friday night with ominous weather threatening to ruin the whole effort, at this point we had done all we could. We were exhausted after a week and I wasn't feeling super confident because my specialty is more of mechanical things and this project was more about chemistry and thermodynamics. Time: 03:29 - 04:14 And I didn't want that lame jelly box stuff people try and pass off as jello. And so even if it didn't last long in the sun, I wanted to at least have the experience of seeing even a single belly flop on a smooth pool of actual jello. If this was gonna be a total failure, it wouldn't be from lack of effort. And so we woke up Saturday morning with a forecast for a warm sunny day and we pulled off the tarp to find a pool filled with actual Time: 04:14 - 04:37 freaking jello. Time: 04:38 - 04:39 By this point, word in the neighborhood had definitely spread around as to what we were up to. And my brother asked if some of their friends kids could have first dibs. And so with that, I'm happy to report, this is what it looks like to belly flop in a pool of Jell O. Time: 04:46 - 05:01 Not yet. Time: 05:18 - 05:18 When I first got in myself, it was closer to the middle of the day, and one of the things we discovered was that direct sunlight over time had the effect of undoing some of the solidness of the lower layers. Time: 06:56 - 07:06 When you go in, it just like feels fills your nose Time: 07:10 - 07:13 and like ears. It's a very surreal feeling of just being like it's kinda hard to move, Time: 07:14 - 07:20 but it's just slimy and slippery. It actually feels really cool. We have some pool toys, Time: 07:21 - 07:26 hidden underneath. Time: 07:27 - 07:27 Got it. Time: 07:31 - 07:32 Wow. It's unlike anything. It's I mean, it's like swimming in snot, if that makes any sense. But like a good snot. To keep it solid for even longer, if we were to do it again, we might put in a heat exchanger pipe system beneath the surface, sort of like how they freeze indoor ice skating rinks and maybe use a little sugar. That's disgusting. Time: 07:33 - 07:51 Now at this point you might be thinking why would anyone spend the effort of six months of planning and then a solid week of backbreaking effort just to make a stupid pool of Jell O. And to that I say, why do people go through the effort of climbing Mount Everest? Why did Neil Armstrong go through the effort of stepping on the moon? And why did Pam and Jim go through the effort of convincing Dwight that Jim had always been Asian? Time: 07:52 - 08:15 This is Jim. Sometimes you don't do a thing because you should, but simply to prove that you can. Now that my curiosity was fully satiated and in my ongoing quest to be the favorite uncle, I told my nephews they can invite some of their friends over and my brother's family set up a neighborhood barbecue. And at this point, after a lot of hours of belly flops and bowling balls and direct sunlight, the Jell O was pretty broken down, but that didn't stop us from setting up a Jell O pool slip and slide. Time: 08:15 - 08:41 And I love their sense of adventure, but it was a bit of an uncle fail moment because apparently none of them have ever used a slip and slide. Time: 08:55 - 09:02 Didn't actually put any sugar in here, so it's kind of disgusting, so we've got some Time: 09:45 - 09:49 real ju- Time: 09:54 - 09:55Growing up as a kid with Mark as your uncle is honestly a dream",
      "comments": [
        {
          "text": "me: \"yea right\"\nme: *sees who made the video*\nme: \"oh ok, this might be legit\"",
          "author": "Unknown",
          "likes": 44922,
          "timestamp": "Shoutout to Mark for letting the kids get first dibs, even though he was the one who"
        },
        {
          "text": "worked so hard to make this",
          "author": "Unknown",
          "likes": 19347,
          "timestamp": "Your videos are the definition of quality over quantity."
        },
        {
          "text": "I bet it was something along the lines of \"Yo, that NASA guy is doing some weird sh*t\nagain.\"",
          "author": "Unknown",
          "likes": 6726,
          "timestamp": "dude you gave these kids an epic lifelong memory"
        },
        {
          "text": "A+ job my man",
          "author": "Unknown",
          "likes": 6581,
          "timestamp": "Those kids now officially have an S tier childhood."
        },
        {
          "text": "never get.",
          "author": "Unknown",
          "likes": 5452,
          "timestamp": "When his kids are grandparents, they'll have plenty of stories to tell about their childhood"
        },
        {
          "text": "Why the heck did their neighbor have a spare swamp cooler",
          "author": "Unknown",
          "likes": 4704,
          "timestamp": "Wife: “We should get a house with a pool”"
        },
        {
          "text": "Mark: “There’s potential in that.”",
          "author": "Unknown",
          "likes": 4703,
          "timestamp": "Can you imagine these kids going to school and telling their friends and teachers what"
        },
        {
          "text": "they did over the weekend but nobody believed them...",
          "author": "Unknown",
          "likes": 4168,
          "timestamp": "Mark Rober is probably the best uncle you could have"
        },
        {
          "text": "world record. Freaking legend.",
          "author": "Unknown",
          "likes": 3499,
          "timestamp": "I was scared that if you jumped in you would go under and suffocate"
        },
        {
          "text": "How to have fun: Have Mark Rober be your uncle.",
          "author": "Unknown",
          "likes": 3337,
          "timestamp": "Does anyone ever think that mark puts way too much effort to his videos that we dont"
        },
        {
          "text": "deserve",
          "author": "Unknown",
          "likes": 3308,
          "timestamp": "Everybody gangsta till your neighbor's pool is red"
        },
        {
          "text": "out what this comment was 😂",
          "author": "Unknown",
          "likes": 3129,
          "timestamp": "This is what “Cloudy and a Chance of Meatballs” wanted to be."
        },
        {
          "text": "I thought, at first, that it was a mrbeast vid.",
          "author": "Unknown",
          "likes": 2990,
          "timestamp": "The amount of work that went into this is mind blowing"
        },
        {
          "text": "Mark: So I need to borrow your backyard.",
          "author": "Unknown",
          "likes": 2695,
          "timestamp": "Im guessing Mark's \"bucket list\" is long enough to reach the moon and back"
        },
        {
          "text": "perfecting it, then after all that he lets the kids have first dibs. Good guy.",
          "author": "Unknown",
          "likes": 2463,
          "timestamp": "Having Mark as an uncle would be amazing like come on give him the title as The best"
        },
        {
          "text": "uncle ever!",
          "author": "Unknown",
          "likes": 2408,
          "timestamp": "I hope you realize that you just gave half a dozen or so kids a once-in-a-lifetime"
        },
        {
          "text": "experience that nobody else will likely ever be able to have.  That, in and of itself, is\namazing.",
          "author": "Unknown",
          "likes": 2368,
          "timestamp": "Everyone: *'nice video!'*"
        },
        {
          "text": "Me: *'how the F did u clean this up?!'*",
          "author": "Unknown",
          "likes": 2358,
          "timestamp": "Best paying job: Mr Beast’s friend"
        },
        {
          "text": "Most fun job: being related to Mark Rober",
          "author": "Unknown",
          "likes": 2304,
          "timestamp": "Good thing you didn't add sugar. Otherwise you would have made the perfect bacterial"
        },
        {
          "text": "medium ;)",
          "author": "Unknown",
          "likes": 2292,
          "timestamp": "The question is"
        },
        {
          "text": "How does one dispose of 15 tons of flavourless jelly",
          "author": "Unknown",
          "likes": 2189,
          "timestamp": "\"I fear no man. But that thing...\""
        },
        {
          "text": "**Mark's bucket list**\n\"It scares me...\"",
          "author": "Unknown",
          "likes": 2145,
          "timestamp": "The amount of work that went into this is unbelievable"
        },
        {
          "text": "Me: ...\nMe: It's complicated",
          "author": "Unknown",
          "likes": 2103,
          "timestamp": "I can’t stress enough how important that watermark is. I see your videos on Instagram"
        },
        {
          "text": "that claim they’ve made your videos. I respect this fully",
          "author": "Unknown",
          "likes": 2077,
          "timestamp": "imagine being a kid whose parents are friends with mark rober"
        },
        {
          "text": "Hey Ferb I know what we’re gonna do today *grabs bat*",
          "author": "Unknown",
          "likes": 1961,
          "timestamp": "I like how all of Mark's videos are fun for kids but also do in depth on explaining the"
        }
      ]
    },
    {
      "video_id": "video_3",
      "title": "Liquid Sand Hot Tub- Fluidized air bed I'm sitting in a hot tub filled to the brim with solid sand.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:03 This is one of the coolest things ever. If you take a tub of sand like this, and then add air in just the right way, it basically becomes a liquefied soup. Time: 00:09 - 00:17 In science, this is known as a fluidized bed. It's used in industrial applications such as powder coat painting, or in grain silos to make sure that the grain flows smoothly to the Time: 00:47 - 00:57 outlet. Time: 01:02 - 01:02 With air on, the top surface is nearly frictionless. Time: 01:07 - 01:10 It's like an air hockey table. Time: 01:10 - 01:11 And then when you cut off the air, it freezes everything exactly where it's at. Time: 01:15 - 01:19 So today, I'm gonna show you how to make a simple version like this yourself, and then because I became curious what it would feel like to be fully immersed in something like this, we made a hot tub sized version. As you can see from the sixty year old video from the Royal Institute of Science, this demo isn't exactly new. I've wanted to build one for a long time, but you can find literally no information online on how to make one like that. So I started combing through a bunch of patent drawings for massive industrial sized fluid beds and I noticed that instead of one big inlet, they all had a bunch of small holes to deliver the air. So starting with that in mind, it still took us 25 failed versions before we arrived at this design. Time: 01:37 - 02:13 As you can see, it's just a bunch of half inch PVC pipes arranged sort of in a ladder. But the key is to drill two one millimeter holes 90 degrees apart from each other and then do a bunch of those spaced 25 millimeters apart. Then you glue all the pipes together and just make sure you orient the holes down so that will keep the sand from getting in. And then you just seal off the container with some hot glue. And then fill your container with either fine sand or we found glass beads worked really well. And you could power with a small air compressor like this or you could just rent a large nitrogen container like this for about $30 and that'll give you ten minutes of run time. As usual, I will put a link to all of parts I used to build in the video description. So my buddy Ken had an old broken spa in his backyard, which we decided to put to good use. Time: 02:14 - 02:54 It just stops and you're like locked in place. It's like a weighted blanket on every surface of your body. Time: 03:15 - 03:21 Now that it was tested and ready, in my ongoing quest to be the favorite uncle, Time: 03:50 - 03:54 I decided to surprise my nephews with it. Time: 03:57 - 03:59 But before we get to swimming in sand, let's talk about the science behind a fluidized bed. And where we don't click away if you think science is boring. If you're new here, you should know that my approach to science is similar to Velociraptor hunting patterns. I try to bring people in with a catchy thumbnail or a cool thing to see and then when they least expect it. Time: 04:16 - 04:34 Clever girl. Time: 04:37 - 04:38 I mean, the analogy breaks down a little at the end, but if you promise to hang with me for the next two minutes, I promise to try and walk the delicate line between trying to make things simple to understand without oversimplifying or being condescending. Fluidization is just when you have enough upward air so that the force of the air pushing on each grain of sand is equal to the downward force of gravity or weight. And when that happens on any individual grain of sand, it hovers in equilibrium like this. You can think of forces acting on an object like a tug of war. If an object is in equilibrium, that that means there's a tie and it doesn't accelerate in either direction. Just like in a real tug of war if the sides are even. However, if you add stone cold Steve Austin to this side, that will make it totally unbalanced and will start to move this way, which is actually what happens if you accidentally turn the air up too high. Time: 04:39 - 05:24 As a fluidization occurs in that sweet spot where the sand particles hover in equilibrium, which makes them easy to move around. This is also the reason sometimes you'll see pools pumped with air to cushion the landing for the divers. Then you notice that some stuff floats in the sand and other stuff sinks. This has to do with the buoyancy force, which is a function of the density of the surrounding fluid and the volume of the object itself. Whenever an object exists in a pressure gradient, there are forces from pressure pushing in on all sides, but they push a little bit harder the deeper that you are. Which is why it hurts more to be the bottom guy in a dog pile or it hurts your ears more the deeper you dive in the pool. And this makes sense because the deeper you dive, the more water there is above you pushing down. And if you add up the size and direction of all those arrows, a bunch of stuff cancels out and you're left with one net force pointing upwards. That is the buoyancy force. And if your buoyancy force happens to be greater than your force from gravity, you float. And if your buoyancy force happens to be less than the force from gravity, you sink. Now we usually think of buoyancy with water, but you could think of things like helium balloons being buoyant in our atmosphere. So here's a trick question, which of these has a higher buoyancy force? It's actually Time: 05:25 - 06:32 the rubber ball. Buoyancy force has nothing to do with the density of the object, just the volume. So since the rubber ball takes up more space, it has a higher buoyancy force. But you might object, then why does the rubber ball sink and the balloon Time: 06:33 - 06:47 floats? Time: 06:48 - 06:48 Remember it's a tug of war. The rubber ball sinks because the force from gravity on the thick rubber skin and the air inside is bigger than the buoyancy force. But for the balloon, even though it doesn't have as big of a buoyancy force compared to the ball, it still floats up because that buoyancy force is bigger than the weight arrow from the helium and the thin rubber shell. And the helium will keep rising like a ball floating up from deep in a lake, and then it will eventually hang out where the density of the atmosphere is roughly equal to the density of the helium in the balloon because that's where the tug of war becomes equal. Time: 06:48 - 07:18 We made it through. Now back to my nephews. Time: 07:18 - 07:20 Okay. Cut it. Time: 08:23 - 08:24 Bank Time: 08:26 - 08:27 up. Time: 08:31 - 08:32The ultimate prank: do this to a beach",
      "comments": [
        {
          "text": "In every right way",
          "author": "Unknown",
          "likes": 9049,
          "timestamp": "Yo imagine the amount of sand that got in their underwear"
        },
        {
          "text": "weeks.",
          "author": "Unknown",
          "likes": 7096,
          "timestamp": "Me: Sand is a solid."
        },
        {
          "text": "Mark: *Well yes, but actually no.*\nEdit: Y'all it was supposed to be a joke, stop fighting",
          "author": "Unknown",
          "likes": 6797,
          "timestamp": "How the heck did nobody get an eyeful of sand??? I would have been so paranoid."
        },
        {
          "text": "pressure ulcers. It’s like laying on a cloud.",
          "author": "Unknown",
          "likes": 5455,
          "timestamp": "That hot tub is terrifying imagine if you were underneath when the air turned off"
        },
        {
          "text": "you!!!!  AWESOME",
          "author": "Unknown",
          "likes": 4856,
          "timestamp": "I just realized that he said liquidified soup does he have solid soup or something"
        },
        {
          "text": "sinuses.",
          "author": "Unknown",
          "likes": 4070,
          "timestamp": "“On the quest to be the favorite uncle”"
        },
        {
          "text": "WHO IS THE OTHER UNCLE WHAT DOES HE DO",
          "author": "Unknown",
          "likes": 3737,
          "timestamp": "*Learns in school* :understands nothing"
        },
        {
          "text": "*Learns on youtube* :Understands completely\nIm no genius but i think their doing something wrong",
          "author": "Unknown",
          "likes": 3434,
          "timestamp": "Everyone gangsta until the pool hardens around you"
        },
        {
          "text": "But nobody’s talking about the bird that sunk beneath the grain in the silo",
          "author": "Unknown",
          "likes": 3056,
          "timestamp": "Mark: wants to be favourite uncle"
        },
        {
          "text": "Kids: all want to be spiderman\nMark: * *_intense sweating_* *",
          "author": "Unknown",
          "likes": 3042,
          "timestamp": "Who’s binge watching his videos after watching his latest video car package theif v.s"
        },
        {
          "text": "glitter bomb trap",
          "author": "Unknown",
          "likes": 2967,
          "timestamp": "“Sorry if the science behind this bore you”"
        },
        {
          "text": "Me at 2am: I must know how this works.",
          "author": "Unknown",
          "likes": 2923,
          "timestamp": "Put this on a beach and scare somebody when they walk into it..."
        },
        {
          "text": "cool stuff",
          "author": "Unknown",
          "likes": 2912,
          "timestamp": "I wouldn't have failed science if my teacher was interesting like him"
        },
        {
          "text": "Edit : 2 years passed and them child prodigies still taking the joke literally. Do I really\nhave state that I in fact did not fail any Science in my life?",
          "author": "Unknown",
          "likes": 2779,
          "timestamp": "Paint that sand gold and I'm even close to living my Scrooge McDuck life"
        },
        {
          "text": "Mark in the footage : * *THROWS A CHILD IN IT* *",
          "author": "Unknown",
          "likes": 2670,
          "timestamp": "You are my favorite uncle, and I don't even know you!"
        },
        {
          "text": "bed.",
          "author": "Unknown",
          "likes": 2437,
          "timestamp": "Anakin Skywalker: “I don’t like sand. It’s coarse, rough, and irritating, and it gets"
        },
        {
          "text": "everywhere.”\nMark Rober:",
          "author": "Unknown",
          "likes": 2428,
          "timestamp": "“We made a hot-tub sized version”"
        },
        {
          "text": "*dunks child in sand*",
          "author": "Unknown",
          "likes": 2291,
          "timestamp": "Kid At Their School: \"What did you do over the weekend?\""
        },
        {
          "text": "Them: \"Nothin' much, just swam in sand.\"",
          "author": "Unknown",
          "likes": 1942,
          "timestamp": "2019: Mark and his nephews still pulling sand out of their buttcracks"
        },
        {
          "text": "sand water. (MOM I GOT TO THE TOP OF THE COMMENT SECTION!)",
          "author": "Unknown",
          "likes": 1783,
          "timestamp": "Imagine going to a beach and this guy just show's up and pushes a fluidizing button"
        },
        {
          "text": "off.\noooooh damn, thanks guys ha. Also Thanks Jeff maybe one day ha",
          "author": "Unknown",
          "likes": 1754,
          "timestamp": "meow"
        },
        {
          "text": "Imagine a glitter version",
          "author": "Unknown",
          "likes": 1623,
          "timestamp": "I’m jealous that these kids have such a cool uncle"
        }
      ]
    },
    {
      "video_id": "video_4",
      "title": "Backyard Squirrel Maze 1.0- Ninja Warrior Course This is a bird feeder, and everything to my left is my attempt at making it squirrel proof. If they want the bird seed, they will first need to pass through what is basically an eight part Ninja Warrior obstacle course for squirrels. This course is extremely challenging. It is not for the timid of heart. But out of the gate, I will admit that in hindsight that I completely underestimated",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:20 my adversary. Time: 00:20 - 00:21 Now if you're wondering why I would go through all this trouble, we need to go back eight weeks ago when I found myself stuck at home and very bored. So I installed a bird feeder and decided to become a bird watcher. And it was just so lovely. Time: 00:21 - 00:34 Until they showed up. Now luckily my bird feeder had a wire cage around it, big enough for the birds to slip inside, but small enough to prevent the squirrels from getting the food. And that worked really well Time: 00:35 - 00:47 until right here. For me, this was like the moment in Jurassic Park when they realized the Velociraptors can open door handles. And once the door was open, it was clear this wasn't their their first rodeo. They basically cleared this whole tube of bird seed by the end of the day. Mind you, this bird feeder was advertised as being squirrel proof. So I bought another squirrel proof bird feeder to replace it. It's got this outer cage suspended by some springs and so if a bird comes and lands here, it doesn't weigh that much and it has access to the seeds. However, if a squirrel comes, they'll grab onto this cage, its weight will force the springs down, thereby preventing access to the seeds. I have no idea how the squirrels could possibly outsmart this, Time: 00:47 - 01:27 but let's see. And this one worked exactly as intended. You can see the birds love it, but when the squirrel comes along, the cage shifts down and now all the seed ports are covered up. Every time they tried, it was the same results. However, the next morning, this guy manages to unclip the springs that hold the cage up, which means the cage stays in the lowered position where it blocks all the seat openings. Problem with that is now they can get to the lid. But this bird feeder lid doesn't hinge open to give direct access, so he goes with a different tactic. Time: 01:27 - 01:57 Where he now has access to all the bird seed he wants. And so I decided I would try one more bird feeder design. Okay. Time: 02:00 - 02:07 Wow. Time: 02:08 - 02:08 It almost feels intentional at this point. This one's supposed to work well because it's got this baffle, which is supposed to keep the squirrels from just coming straight down and getting to the seeds. And more importantly, there's no way for them to rip this off. We'll see. This one debuted to similar results. Time: 02:09 - 02:24 As he hangs by a few toes, this is when I really started to gain an appreciation Time: 02:24 - 02:28 for what they were capable of. It definitely seemed like this bird feeder was their favorite. Okay. Time: 02:28 - 02:34 Yeah. They're flexing on me for sure. And at this point, a plan was forming in my head, but just to be thorough, I moved the post away from the fence and I can't say I was surprised when they just climbed it. Nor was I surprised to see they could shimmy up and down a small metal pole or even a large one for that matter. And whether they could climb a certain pool material was a moot point anyways because of this. Look at this. These guys are basically freaking rodent sized Simone piles. And on some level, this is what it felt like when someone stole a package from my porch that didn't belong to them. And I harnessed that indignation, spending a year designing the glitter bomb bait package. Time: 02:34 - 03:08 Hello. Time: 03:09 - 03:10 Complete with special fragrances. Time: 03:12 - 03:13 Oh. If I could design a package to deter thieves, Time: 03:14 - 03:17 could I design a bird feeder to deter squirrels? And so after a couple weeks of brainstorming, designing, and building with my buddy John, we put it all together in this twenty second build montage. Time: 03:17 - 03:28 Here are the basic elements. Time: 03:45 - 03:46 For starters, here's where I've placed their favorite bird feeder. At the end of the course and to sweeten the deal, right below that there's a trap door. And if they step here, Time: 03:47 - 03:56 it releases a butt ton of walnuts and unfurls some celebratory banners. Why walnuts? I'm glad you asked. I'm using walnuts because over the course of a week, I put out out a buffet of seven different nuts and seeds. And all four times I repeated the experiment, walnuts were always the one they ate first. What's great about placing this here is it levels the playing field as the birds can fly up and get as much food as they want anytime they need it. The squirrels however will have to work for it because the only way to make it to this platform is if they work their way through my eight part Ninja Warrior obstacle course, which all starts right here. This is the only platform on the course that has a pole that isn't covered in slippery Time: 03:57 - 04:35 stuff, which means this is where they have to climb up to enter the course. If they try and get up any other way, they can't keep a good grip and they just slide back down. So the first challenge is the bridge of instability. Now this may look easy, but the trick is it attaches at a single point on each end, end. And from a physics standpoint, that makes it no different than trying to crawl across a tightrope. It's the same deceptive principle with that one carnival game that's so impossible. I broke it down in another video where I use physics to show which carnival games were basically scams and the science on how to beat them. Next up, the maze of a thousand corridors. Time: 04:37 - 05:08 This one's a bit more cerebral, but if they make it through that, it will bring them to the pitchfork tumblers, which are inspired by the show Wipeout. But unlike Wipeout, I should point out that all these contraptions are squirrel friendly and even with a little back force, they will break away and stop spinning. Now if they can make it past the pitchfork tumblers of treachery, they come to one of my personal favorites, the homewrecker. Time: 05:08 - 05:28 I put her into temp the squirrel to lose focus on the real prize at the end of the course. Because this pad has a pressure sensor underneath it, and it connects to a microcontroller that has a relay that connects to a solenoid that connects to a pneumatic piston that connects back to this platform with the pressure sensor. And so if they stand here for more than three seconds, Time: 05:35 - 05:51 they've got to start the course all over again. Next up is the sneaky bridge of deception. I've suspended a juicy walnut right in the middle, but there's no way this bridge will support their weight, so it'll be interesting to see how they approach it. The sixth challenge is called the tourist trap. It's actually a bit of a reward for making it this far. If the squirrel sticks their head through this board my wife painted, it's just a photo op they can hang on the wall of their tiny squirrel nest. I'll place a walnut here as an incentive for them not to miss this unique opportunity. The penultimate challenge are the quad steps of great elevation. This is taken straight from Ninja Warrior and this is super tricky because these paths are all totally smooth and placed at a 45 degree incline. And now for the last challenge. At this point, they are a near few feet away from their ultimate goal. But if they're not careful, they'll have to deal with the orbital assist platform, AKA the final countdown, AKA it's not a catapult, Time: 05:53 - 06:42 it's a squirlipolts. Time: 06:42 - 06:43 Which means they now have to go back and start all the way over from the beginning. Now if they want to avoid that fate, they just need to stand on this pad for less than three seconds. But once again, I've placed a diversion here. This one projects an optical illusion of anything you place in the bottom Time: 06:46 - 07:00 this Time: 07:01 - 07:02 dish. It's actually super trippy and Time: 07:02 - 07:03 looks even more impressive in real life because the projected image is three d. They're like $9 on Amazon and I put a link that explains the juicy physics of how they work in the video description. Now with regards to squirrel safety, I know I seem to have this reputation of Time: 07:03 - 07:15 Improvised high speed projectiles and so this one might worry a few animal lovers out there including my wife. We have five pets and one child and the child was the only one I had a say in. So rest assured, I can adjust the pressure on the piston and we'll be staying way below any launch force that could hurt any of our adorable backyard contestants. And so finally after making it through all that, we're back here at the world's most satisfying bird feeder. As far as I'm concerned, if they make it here, they've earned the right to gorge next to the birds for as long as they want. And so after nearly a month of prep work, the course was officially open for business. Time: 07:22 - 07:56 They could snow the walnuts at the final station, and you could see the gears turning because right above that was their favorite bird feeder. Time: 07:58 - 08:05 And so before long, we had our first contender. Time: 08:06 - 08:09 That didn't exactly go as planned, so Rick decides to regroup. Speaking of which, that's Rick. There are a total of four competitors that will be attempting the course. First up is Rick and he weighs five hundred grams. I know this because he's actually standing on a custom made scale. Rick is very clever as you'll see here in a minute, but he also gets spooked easily. Next up is Marty. He's basically indistinguishable from Rick. Rick and Marty are inseparable and pretty much spend all their time together as a pair. Our third contender is Frank also coming in around five hundred grams. He's very gutsy. He's also kind of dumb. Finally, we've got my personal favorite, fat Gus. He's just really charming and will strike a pose if he sees a camera. He also really likes to eat and he tips the scales at an impressive 800 grams. While most of the squirrels are kind of particular before making a selection and then gracefully leaping away, Fat Gus just goes for it. Hands free. Just makes himself real comfortable. Here he is laying out with a light snack from the bird feeder. I mean, you can't fault the guy for just clearly appreciating a good meal. So now that you know our four contenders, let's get back to Rick. So he hops back on and he's actually doing better than his first attempt. Time: 08:26 - 09:33 Just barely. Time: 09:34 - 09:35 This is the best because he's like, okay, I got this. Never mind. Well, maybe I No, I definitely don't. Time: 09:36 - 09:42 And this was the exact moment I realized I just might be outmatched here. Time: 09:43 - 09:47 Marty was watching Rick and after a quick dip of his toes in the water, adopts his strategy right out of the gate. Oof, so close. Time: 09:53 - 09:59 But an excellent recovery. And Fat Gus perhaps predictably comes up a little short. Which brings us to the maze of a thousand corridors, Time: 10:00 - 10:07 which to be honest, they mastered this one pretty quickly. Time: 10:07 - 10:10 Here's a solid run from Fat Gus. Time: 10:12 - 10:14 And now for the pitchfork tumblers of treachery. Time: 10:16 - 10:18 Marty was like, Time: 10:19 - 10:20 yeah, that's a hard pass. Fat Gus is just like, abort. Time: 10:20 - 10:24 Frank is just like, Time: 10:25 - 10:26 nope. Then he's like, wait a second. Time: 10:27 - 10:28 Still nope. Then Marty flies in real hot over the top. He didn't make it through, but that's partial credit as far as I'm concerned. And then here's Fat Gus with my favorite attempt by far. Time: 10:29 - 10:38 And then Frank shows no fear which helps him pull off this near flawless run. And finally, Smart Rick surgically weaves his way through essentially untouched. And I should mention the squirrels were most active from six to 10AM. So every morning I've been getting up before the sunrise to start filming from in my house like one of those camouflage nature photographers. Only like a suburbanized Time: 10:44 - 11:04 version. I've also had a handful of streaming cameras rolling twenty four seven, which has allowed me to make such discoveries as we have the world's worst guard dog. Time: 11:04 - 11:11 Thanks for the help, pal. Now back to the home wrecker. You could see Rick is instinctively Time: 11:12 - 11:16 suspicious of this gold digger and only for a brief moment puts his full weight on the platform. I told you he was smart. His buddy Marty on the other hand Time: 11:16 - 11:24 she is a cruel mistress. Time: 11:31 - 11:33 And because I know my wife is going to ask me, no, this will not hurt the squirrel for two reasons. Number one, they are amazing like cats and always land on their feet. And two, they themselves were jumping from this height all the time and in some cases much higher. In fact, squirrels are one of the few mammals that can survive a fall from any height because they make their terminal velocity so low. You can see it right here. They make their body as flat as possible then put their tail back to increase drag. Time: 11:34 - 12:01 They basically become their own parachute and then right before they land they pull in and fully extend their arms and legs to act as shock absorbing landing gear. This is so cool. Now back to the course where even smart Rick eventually lets his guard down, Time: 12:01 - 12:14 which is exactly when she strikes. Time: 12:16 - 12:18 But just like all the other obstacles so far, after a day or two they'd mastered it. In this case, even disregarding her offering of a fresh walnut. Time: 12:20 - 12:28 Now on to the slinky bridge of deception, and this was the sleeper obstacle in my book. That is not a large gap, which they can easily jump, but having the slinky there just threw them off somehow. You can see how much Frank is struggling here, and he's the brave one. Time: 12:30 - 12:43 And Rick only jumps when Marty shows up for emotional support. Time: 12:45 - 12:48 But like all the obstacles so far after a day or two they'd mastered it. Now on to our third to last obstacle, the tourist trap. And this one was just a freaking delight. A little peanut butter really did the trick here. Time: 12:50 - 13:01 Now here comes fat Gus and I mean how fat Gus is this he sees the Time: 13:13 - 13:17 and he's like, paint me like one of your French squirrels. Yeah? No? No takers? Time: 13:18 - 13:23 Alright. Here's another classic Gus where he looks at the camera. Wait a second. Time: 13:23 - 13:27 Play that back. Time: 13:28 - 13:29 And freeze. Time: 13:30 - 13:31 Zoom. Enhance. Time: 13:31 - 13:33 Well, turns out Fat Gus is not a dude, and he's pregnant, which meant I was suddenly feeling real uncomfortable about all those weight comments. So after a bit of a pivot to smooth things over, we soldiered on to the quad steps of great elevation. Time: 13:43 - 13:56 Frank comes in rather confident almost to his demise, Time: 13:57 - 14:00 but he pulls off the smooth recovery. Time: 14:01 - 14:03 So after not much time at all, they were looking pretty good here. In fact, one morning, I noticed Marty totally skipped the last step altogether, which I took as a challenge. And so I removed the middle step to see what they would do. And who else but fantastic Gus? Let's slow that down a bit. Time: 14:08 - 14:23 There's such amazing jumpers, so I suppose the quick mastery here wasn't a surprise. I mean this right here is probably a 10 foot jump. And here's some classic brave but dumb Frank. He'd already entered the course normally and made it to the home wrecker at least a dozen times by this point. And yet for some reason, he decides this 12 foot jump is his best course of action. Time: 14:24 - 14:42 Smart Rick was the first one to enter the course, so in the end, after about a week of effort, it was fitting he was the one to make it to the jackpot first. And he's so stoked, he apparently wants to run the whole course in reverse. Time: 14:43 - 14:53 In hindsight, we probably should have made the jackpot a little quieter. Time: 14:54 - 14:57 Here's Marty, as always, not far behind. Time: 14:57 - 15:00 He's also a bit flighty, as you know, which worked against him here because down below Fantastic Us, ever the opportunist, Time: 15:05 - 15:11 comes through with a real stroke of brilliance. Time: 15:11 - 15:14 But pretty soon Marty comes back like, Time: 15:14 - 15:16 I'm the one who kinda earned that. And then Fantastic Us is like, you snooze you loose sucker. Time: 15:17 - 15:22 And might I just say Fantastic Us, when you sit like that, you don't look an ounce over seven hundred Time: 15:22 - 15:27 grams. Eventually, they learned that sound was a good thing and they quickly returned for their reward before fantastic Gus got any ideas. So here's a single camera shot of a full run and by the end all of them could do the full course in less than forty seconds. And while we're watching, you might be wondering what happened to the squirrel afoot. Unfortunately, they didn't really fall for my illusion much, but I'm about to show you the two times they did. And as a promise to my wife, I turned the pressure to only 40% full power. So the acceleration the squirrel would feel is about half a g, which is 10 times less than a typical roller coaster. Additionally, I never turned on either the home wrecker trapdoor or the launch platform when I wasn't actively watching from inside my house where I had a manual override button. Because the save as it was, something about launching fantastic gust just didn't feel right. Now what you're about to see is gonna look pretty chaotic, but when we check the slow mo, amazingly, I'll show you how the squirrel is totally in control pretty much the whole time. Time: 15:27 - 16:19 Alright. Now here's a second angle. Time: 16:21 - 16:23 Also, even if you don't trust my calculations, I can assure you that the squirrels Time: 16:26 - 16:29 did not care. In both launch cases, they were back up on the course in like five minutes. Here's the slow mo and see if you could spot the two critical things he does to make sure he lands feet down. Time: 16:30 - 16:40 Did you catch it? Time: 16:41 - 16:42 The first critical moment is right here. He's already done the predictive math and he's locked his head on the spot where he plans to land and now his head will not lose that lock the whole way down. Time: 16:44 - 16:54 What's crazy is the time it takes him to do all the predictive math to know exactly where he will land and to lock his head is three hundred milliseconds. That's exactly this long, literally less than the blink of an eye. That blows my mind, but if you think about it, it makes sense these reactions would have evolved to be razor sharp if you live your life in the trees constantly making split second decisions. Now besides picking a landing spot with his head, the second trick is with his arms. When he wants to keep his upper body from rotating, he has his arms out. But the moment he wants to rotate his upper body quickly, he tucks them in. And then when he wants to stop rotating, he extends them out again. Time: 16:55 - 17:28 This is straight up conservation of angular momentum. It's the same trick ice skaters use. Time: 17:28 - 17:33 Basically bring your limbs in if you want to rotate fast, extend them out if you want to slow the rotation. My buddy Destin from Smarter Every Day also made a video analyzing how cats always land on their feet and they do the exact same two tricks. The head target lock and bringing limbs in to rotate and out to stop rotation. Here's the second launch. Time: 17:33 - 17:51 So this may look like pure luck in real time, but the slow mo tells a different story. In that amount of time, he's already made a slight lateral push in that direction and locked his landing target with his head. We know from the previous clip he can rotate his body to any orientation, Time: 17:52 - 18:05 but he doesn't in this case because he sees his small push has already aligned him for the perfect landing. That's just so cool. And so after those two physics demonstrations, I disabled both the launcher and the homewrecker trapdoor and just let them enjoy the course in peace. As far as I was concerned, they had earned it. Plus, after spending a month together, we were sort of bros by this point. If they saw me coming out to work, they would certainly jump away. But then they just quickly be right back. And sadly, all good things must come to an end and because I didn't want them to develop an unhealthy dependence on my handouts, after about a week of free reign, I took down the course. But in its place, I put up a specialized squirrel sized picnic table. Every morning, this door opens to release just a few walnuts as a little treat to remind them of our good times together. Although I had to laugh that after all this somehow I didn't anticipate on day one Frank would immediately try and figure out and partially succeed in finding a way to beat the system. Like everything else though, they quickly caught on and now in some mornings I'll catch them just waiting for the daily ration Time: 18:06 - 19:00 chilling patiently on the bench seat. That is everyone but Fantastic Gus. Time: 19:00 - 19:05 Don't ever change, buddy. When I started this two month long adventure trying to bird watch, I had no idea I would enjoy squirrel watching so much more. It's also made me realize that even amongst the structures and pavement and power lines, Time: 19:06 - 19:18 how interesting nature can be in a single suburban backyard if you just really stop to look. Even the plants are amazing. I had no idea that as vines grow, they spin around looking for something to grab on to. I didn't anticipate the wide variety of animals that use fences as inner yard highways to get around as a substitute for all the trees that existed before we got here. Even little interactions like this spider extending his life with this very timely leap into the unknown were just so delightful to see. But of all the animals, I can definitively say now that squirrels are my absolute favorite, and they're certainly a more formidable adversary than porch pirates. Time: 19:19 - 19:55 They're kind of adorable, Time: 19:55 - 19:56 incredibly crafty, curious by nature, athletic, and persistent. Turns out squirrels can live to be 20 years old, and so I like to think that someday, Fantastic Gus will bring his grand squirrels to the fence, and regale them with tales of cowboys, and courage, and legendary walnut Time: 19:57 - 20:13 piles. Time: 20:16 - 20:17lets be honest, when we clicked on this video we never thought it would be this good.",
      "comments": [
        {
          "text": "check up on the squirrels",
          "author": "Unknown",
          "likes": 38128,
          "timestamp": "I would literally watch a whole season of Squirrel Wipeout."
        },
        {
          "text": "Mark: Yeah, I've been training them with a special obstacle course.",
          "author": "Unknown",
          "likes": 27684,
          "timestamp": "This is the closest we'll get to the Olympics this year"
        },
        {
          "text": "Squirrels are smarter than the average package thief.",
          "author": "Unknown",
          "likes": 10530,
          "timestamp": "Meanwhile ... 17 squirrels learned to raid Mark's fridge between 6am and 10am while he"
        },
        {
          "text": "was being distracted by 4 of their mates.",
          "author": "Unknown",
          "likes": 10507,
          "timestamp": "Now i feel like i know these squirrels personally,"
        },
        {
          "text": "the content top notch in quality.",
          "author": "Unknown",
          "likes": 6745,
          "timestamp": "That shot of gus chillin on the picnic table was probably the best thing ive seen in my life"
        },
        {
          "text": "- An engineer who spent 9 years at NASA\n-Three fluffy bois and girl",
          "author": "Unknown",
          "likes": 5354,
          "timestamp": "2019: glitter bomb for porch pirates"
        },
        {
          "text": "2020: obstacle course for squirrels\n2021: obstacle course for porch pirates",
          "author": "Unknown",
          "likes": 5053,
          "timestamp": "This is what Quarantine Boredom looks like when you're a NASA Engineer."
        },
        {
          "text": "ever watched.",
          "author": "Unknown",
          "likes": 4280,
          "timestamp": "Moral of the story:"
        },
        {
          "text": "Squirrels are smarter than porch pirates",
          "author": "Unknown",
          "likes": 3808,
          "timestamp": "I just got emotionally attached to 4 squirrels in 20 minutes."
        },
        {
          "text": "day 3: bird watcher\nday 6: bird feeder and watcher\nday 12: bird feeder and watcher annoyed at squirrels\nday 14: squirrel watcher\nday 45: *squirrel ninja warrior host*",
          "author": "Unknown",
          "likes": 2599,
          "timestamp": "I like how he talks about the squirrels like they’re speedrunners."
        },
        {
          "text": "“A solid run”\n“A time under 40 seconds”\n“A near perfect run by Frank”",
          "author": "Unknown",
          "likes": 2575,
          "timestamp": "When you accidentally call a pregnant lady a phat man ...."
        },
        {
          "text": "Left learning that Squirrels do math better than me",
          "author": "Unknown",
          "likes": 2281,
          "timestamp": "A squirrel sitting at a tiny picnic table is the cutest thing I've seen."
        },
        {
          "text": "about.\nPure joy, creativity and originality.\nGreat video Mark, this is the type of content i would work for to get. Loved it, especially\nGus.",
          "author": "Unknown",
          "likes": 1881,
          "timestamp": "This was so fun to watch."
        },
        {
          "text": "Lowkey you can make a whole series on this",
          "author": "Unknown",
          "likes": 1802,
          "timestamp": "Mark: builds the best squirrel proof bird feeder"
        },
        {
          "text": "Everyone at NASA: who the f let this man quit his job?",
          "author": "Unknown",
          "likes": 1705,
          "timestamp": "The squirrels sitting on the picnic bench is so cute lol"
        },
        {
          "text": "doing a ninja course 😅",
          "author": "Unknown",
          "likes": 1652,
          "timestamp": "Imagine having squirrels in your backyard waiting on a picnic table for some walnuts"
        },
        {
          "text": "literally sitting at the picnic table waiting for the door to open, these squirrels are\ngeniuses lol.",
          "author": "Unknown",
          "likes": 1577,
          "timestamp": "normal people: il just buy more bird seeds"
        },
        {
          "text": "Mark Rober: let me build a squirrel  version of wipeout",
          "author": "Unknown",
          "likes": 1564,
          "timestamp": "The neighbors be like: the first season of American Squirrel warrior"
        },
        {
          "text": "My phat cat: Couldn’t even reach his own butt 󰣼",
          "author": "Unknown",
          "likes": 1510,
          "timestamp": "\"Turns out Phat Gus is not a dude and he's pregnant\": exactly what happened with my"
        },
        {
          "text": "hamster lol",
          "author": "Unknown",
          "likes": 1498,
          "timestamp": "Mark:  Turns out Phat Gus is not a dude!"
        },
        {
          "text": "Also Mark: And *he's* pregnant",
          "author": "Unknown",
          "likes": 1429,
          "timestamp": "Friends: “So, got any interesting quarantine stories?”"
        },
        {
          "text": "This mad lad:",
          "author": "Unknown",
          "likes": 1397,
          "timestamp": "\"Doctors trying to find a way to cure the virus\""
        },
        {
          "text": "Mark Rober:\"trying to find a way to outsmart a squirrel...\"",
          "author": "Unknown",
          "likes": 1375,
          "timestamp": "This is probably one of the best YouTube videos I've ever seen. Great job"
        },
        {
          "text": "storytelling editing timing… Just flawless. Perfectly entertaining without a missed step",
          "author": "Unknown",
          "likes": 1366,
          "timestamp": "Me: 'Let's see what fun video Mark has for us this month!\""
        },
        {
          "text": "Mark: **yeets a squirrel**",
          "author": "Unknown",
          "likes": 1359,
          "timestamp": "How to build a squirrel obstacle course"
        },
        {
          "text": "Step 1: get wood\nStep 87: decapitate Barbie",
          "author": "Unknown",
          "likes": 1337,
          "timestamp": "Most people : “Ehh who cares anymore”"
        },
        {
          "text": "Mark: “ THIS IS WAR” and proceeds to make a parkour course.",
          "author": "Unknown",
          "likes": 1336,
          "timestamp": "''Turns out Phat gus is not a dude, Hes pregnant\" - Mark Rober"
        }
      ]
    },
    {
      "video_id": "video_5",
      "title": "Egg Drop From Space This is space and this is an egg moments before I attempted the world's highest egg drop. Now in an egg drop competition, in case you never had the chance to do it yourself in school, the goal is to build a contraption that could protect a raw egg from breaking when dropped from the tallest type possible. So my original plan was to drop an egg in a contraption I built from the world's tallest building. But humans are always building taller buildings. So if I really wanted to future proof this record, I realized I would need to go all the way to the top and straight to outer space. And when I started on this journey three years ago, I knew if I could draw my experience of landing stuff on other planets, I would be guaranteed the record. But what I didn't know is this would be the most physically, financially, and mentally draining video I would ever attempt. But first, let me just explain what I was thinking. The plan was to clamp an egg to the front of a rocket, then attach that rocket to a weather balloon and take it up to space. Once there, the weather balloon would release it and just by using gravity only, the rocket would eventually accelerate past Mach one, breaking the speed of sound. And then it would autonomously adjust the four fins on the back to steer itself to the target location. And then at three hundred feet above the ground, it would release the egg, which would free fall onto a mattress that we'd placed on the ground. And that all seemed pretty straightforward.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 01:11 So like any good engineers would, we broke the problem down into smaller steps starting first with calculating the terminal velocity of an egg. And by terminal velocity, I mean that any object, including humans, have a maximum speed at which they fall once the force of Earth pulling you towards it balances with the pushback force for bumping into more and more air molecules as you start to fall faster. For humans, that max speed is about a 20 miles per hour. And after doing some simple math for an egg, it tops out at 75 miles per hour. So to make sure the egg wouldn't break if we dropped it onto a mattress at its terminal velocity, we ran our first test. And since we couldn't find a tall enough building whose lawyers would agree to let us hurl an egg off the side and onto a mattress, we had to improvise a bit. Time: 01:11 - 01:51 83. Time: 01:56 - 01:56 Yes. Time: 01:57 - 01:57 Check the egg. No cracks. So our mattress will protect an egg even if it's traveling faster than its terminal velocity. Time: 01:58 - 02:06 It's a good start. Time: 02:06 - 02:07 The next step in our DIY space program was to head back to my friends in the small farming town of Gridley, California, which is the place where we broke the elephant toothpaste world record, where the plan was to set out a target mattress for the egg to land on in the middle of a field with a little bit of margin built in just in case. Alright. So we've got the smoke charge back here so that as we're like coming down from the sky, we wanna be able to pick it out. This is the computer. Here's the fins. Time: 02:08 - 02:31 This by the way is Joe and he has a fascinating channel called bps space. And what makes him especially cool is he didn't go to school for any kind of engineering degree. He's all self taught and recently even landed a launched rocket SpaceX style after seven years of trying. Joe was in charge of tracking and guiding the rocket to the mattress using these movable tail fins, whereas I was in charge of the payload. In other words, how we would keep the egg from freezing on the way up in a little oven with heaters which would break away before we dropped, along with the mechanisms to release the egg itself. Release the egg. Time: 02:31 - 03:01 And the purpose of this first trip to Gridley was a flight characterization Time: 03:02 - 03:05 test. Basically, before we spend all the time and money taking the balloon all the way up to space, we are here just to do a low altitude test at 10,000 feet just to prove to ourselves we could steer the rocket using the fans. We're setting all sorts of world records out here. World's largest mattress, Time: 03:06 - 03:20 fastest egg Yep. Tallest egg drop. What could possibly go wrong Time: 03:20 - 03:25 besides like 4,000 Time: 03:25 - 03:27 things? And so with everything more or less in place and ready to go, all we needed now was an official egg, which thankfully, Cridley has an abundance. Hi. Time: 03:27 - 03:36 I'm sorry. Time: 03:37 - 03:37 This is terrifying. Time: 03:38 - 03:39 Okay. Okay. Okay. Okay. No. No. No. Time: 03:41 - 03:44 Hey. Time: 03:45 - 03:45 Precious egg. In the history of our universe, Time: 03:50 - 03:53 this is the first chicken that's ever laid an egg that will go faster than this pew sound, supersonic Time: 03:53 - 03:59 mach one. Thank you. Thank you. I'm sorry. I'm leaving. Congratulations. Time: 04:00 - 04:04 So the next morning we got up at 4AM when the winds would be the most calm to run through all our final pre launch preparations. Time: 04:04 - 04:10 Loading up our lovely egg. Including the last minute decision to add a metallic streamer to the back of the rocket to make it easier to visually track. We've got redundancy all over the place here. We've got redundant leads, redundant igniters. Mark has two servos on the fairing. There's enough. No dumb failures. And that's exactly when we had our first dumb failure. Alright. Time: 04:11 - 04:30 The GPS is mad. Time: 04:31 - 04:33 We gotta scrub the launch. We were just walking back. I get the eggs all bloop and it pooped it out. And scrubbing the launch meant we unfortunately had to release all the helium out of the balloon, which is an opportunity I'm not gonna let just pass on by. Hello. Wow. That's so cool. And back at home base, we ran some tests that confirmed our hypothesis. And since the GPS unit was right at the back of the rocket, the last minute addition of the metallic streamer was interfering with the GPS signal. And that messed up the rocket's math in calculating its speed, so it thought it was time to release the egg. So early the next morning, we were back at it with a few modifications. The most important being swapping the metallic tracking streamer with one made from plastic. Good news is there's hardly any wind today. Bad news is about 20 degrees colder, which means our mattresses Time: 04:33 - 05:19 are kind of frozen. Time: 05:19 - 05:20 Nevertheless, Time: 05:21 - 05:21 we pushed forward Don't Time: 05:21 - 05:23 trip. Mark. As I very carefully delivered the rocket to the new balloon launch site. Send it. Suck it baby. Full sun Time: 05:24 - 05:32 It's happening. Did you already see it? Time: 05:40 - 05:42 Oh, yeah. Yeah. I see it. I did. I did. Time: 05:42 - 05:45 Oh, there it is. Time: 05:50 - 05:51 And while the whole thing looked really cool So we, Time: 05:52 - 05:55 might be in trouble. We quickly realized the balloon was rising at a slower rate than we anticipated We're already south and we're only halfway up. Which totally threw off the predicted trajectory. And so after a few more minutes, we decided to manually drop the rocket because we were already way too far off course for the rocket to make up the lateral distance of the mattress using just the fins and gravity. Time: 05:56 - 06:15 Three, two, one, clicked. Time: 06:16 - 06:17 Oh, boy. That's not good. And that's when we encountered the second problem of the day as the Finns actively forced the rockets into an uncontrolled death spiral. Altitude is 1,400 Time: 06:22 - 06:33 coming down fast. Time: 06:33 - 06:35 Well, it landed somewhere. Checks in the address just in case. And since we have the GPS corded to the rocket, we headed out to track it down. The real question is what's the status of the egg? Mark, I think I might have some bad news for you. At which point we stumbled on an entire field of sitting birds, which is another opportunity Time: 06:42 - 06:59 I'm not gonna let just pass on by. Time: 06:59 - 07:01 That's a zoo, man. That's not a zoo. Time: 07:04 - 07:06 There's no egg. The egg did release. The fact that this is out means the egg didn't come out. So that's good. But despite that silver lining, the movable fins seem to be actually forcing the rocket into that tailspin, which was surprising because Joe had definitely run through a lot of analysis and testing before coming here. So after conducting a thorough review of the footage and firmware, he was able to locate and fix a single rogue negative sign in the code that seemed to be causing all the control issues, which meant we were ready to give this one final try. We had run out of spare parts and spare weather balloons, so regardless of outcome, this would be the final attempt. If we couldn't land the egg on a mattress from 10,000 feet up, we wouldn't have any hope of pulling it off coming all the way down from space. Phenomenal. Time: 07:08 - 07:51 That's nerdy space talk for everything is exactly as expected. Time: 07:52 - 07:56 I'm standing in the middle Time: 07:56 - 07:58 of the world's largest mattress where hopefully the egg will be landing in like forty five minutes. Time: 07:58 - 08:04 Otherwise, we're pivoting Time: 08:05 - 08:06 on my new video's world's largest mattress. So I'm arming the rocket right now. Time: 08:06 - 08:11 The last step. Time: 08:12 - 08:13 Alright. Old girl, you're in for a ride. Time: 08:14 - 08:16 Three, two, one. Time: 08:16 - 08:18 Let it ride, baby. Time: 08:19 - 08:20 Looking good so far. We're at 500 meters. Now, in order for the balloon to hit the target mattress, for each launch, we'd start it from different spots around Gridley which raises an interesting question maybe you've wondered yourself. How do big balloons like hot air balloons steer themselves? Time: 08:24 - 08:38 Or I guess even just know where they're going to land? And the answer is computers know the wind direction Time: 08:39 - 08:44 and speed at every height as you go up. So on a given day, if these are the predicted wind directions and speeds, we would need to launch here to be directly above the mattress when we got to 10,000 feet. But how we know all this information is the fascinating part because every day it's someone's job to launch two balloons like this into the sky at noon and midnight Time: 08:45 - 09:03 London time. But this is done in over a thousand locations all around the world at those same two exact moments. And these balloons all have something called a radiosonde attached to them that measures things like altitude pressure, temperature, and wind, and then they transmit the information back to the ground stations, which gets fed into supercomputers, and that's the reason weather and wind predictions can be so accurate. So 2,000 of these massive weather balloons go up every day and then eventually pop and just land somewhere. And since they're transmitting a signal, some folks make a hobby out of just trying to track them down. Time: 09:03 - 09:36 How close are we to the drop point? Balloon release? Balloon Time: 09:36 - 09:39 release. That's it. And this time we were releasing right in the target drop zone, which was good news on one hand, but it raised some new challenges on the other. Where is it? Time: 09:40 - 09:49 400. Gravit sure. Time: 09:55 - 09:57 You Time: 09:58 - 09:58 see something? Time: 09:59 - 10:00 Altitude 98 meters. Time: 10:03 - 10:05 I think we're down. Time: 10:09 - 10:10 Everyone okay? Yeah. Time: 10:11 - 10:12 That was exhilarating. Time: 10:13 - 10:14 So we were much closer this time and we even managed to steer the rocket in the right direction just slightly. We found it. Time: 10:15 - 10:21 Egg. No egg? Wait a minute. Time: 10:25 - 10:27 It's the egg. It's the egg. Oh, I mean it's Time: 10:28 - 10:31 not not cracked. So after three failed attempts, we still seemed pretty far off from where we needed to be, which meant it was time for the ultimate phone of friend with my buddy Adam Steltzner, who you might recognize as this guy from when we landed curiosity on Mars. Touchdown confirmed. Proceed on Mars. He has a PhD from Caltech and he's also the chief engineer for Perseverance and Mars Sample Return. And so after explaining to Adam what we were trying to do, he immediately spotted a fatal flaw in our brilliant plan. And you're doing terminal guidance to something about the size of a house. How are you gonna do that? How do you do that? I mean, I know how you physically do that. How do you not get busted by the FAA? In other words, we were basically attempting to make a precision guided missile. Dude, there are thousands of people who've done this before, and they are Time: 10:32 - 11:18 sworn by federal law not to say a single word to you. And to be fair, he raised a good point. The people who could help us actually can't. And even if we figured it out ourselves, the ethics of just slapping that how to video up on YouTube are questionable Time: 11:18 - 11:32 at best. And so after a fruitful discussion with Adam But we release at about the height and then we do a lobbying. The thing you start to worry about is heating. You might want to start with a two stage thing. We decided to pivot and instead of a precision guided egg landing on a mattress in a small town, we would set our sights on a much more general egg landing target by heading out to the desert. But as part of the pivot, we completely scrapped our old design and spent a couple months designing and building a new system that borrowed heavily from the curiosity landing. Because we figured if it could safely put a rover on Mars, it could safely land an egg on Earth. So we would still go to space on a weather balloon, but this time the rocket would have fins that didn't move, and it would be three times as long and four times as heavy to guarantee we would get the egg to supersonic speeds on the way down. Then just like NASA separates the cruise stage in the upper atmosphere and then uses aerobraking to dissipate a bunch of the energy and speed, we would separate from the back half of the rocket about halfway down after we'd already broken the sound barrier. And because this is now weighed much less, it would naturally aerobrake and reduce its speed to the new lowered terminal velocity. Then on Mars, the next step is the parachute deploy followed by the heat shield separation, and we would follow in kind by launching our own parachute and then release our own nose cone which would then expose our set of cushioning airbags as you can see here which we borrowed from the spirit and opportunity landings. It was intentionally ambitious and extremely complicated but after a couple months of complete redesigning and and building, we found ourselves in the desert feeling cautiously optimistic. And that was due in part to our lucky orange parachute because when I left NASA, my friends gave me this rectangular piece of nylon. And for scale, that's the exact same rectangle here that's part of the parachute the curiosity rover used to land. So that piece of parachute is actually one of the 80 rectangles you see here as they were running the final tests in the world's largest wind tunnel. And so it only felt fitting that after some scribing, Time: 11:33 - 13:26 a bit of cutting, and a little sewing, it had nobly repurposed itself for the new mission. So as the sun went down, back at the hotel, we worked late into the night on final preparations. Time: 13:26 - 13:37 This was an idea and a passion project three years in the making. Time: 13:37 - 13:41 And it took a staggering amount of work even to get us to this point. Time: 13:41 - 13:45 We had thought and prepared for so many things that could go wrong. And while I was feeling optimistic, I knew at the end of the day, it was the laws of physics that would ultimately determine our fate. Time: 13:46 - 13:56 So early the next morning, the crew in charge of the balloon got to the launch site to start filling it up. And this balloon looks a little different than the others because it's a zero pressure weather balloon. The advantage these have over a typical weather balloon is they can go higher up into space, carry more weight and they're open on the bottom which means they equalize to the pressure and it's impossible for them to pop. So when you want it to come down, you send a signal that will pull down on the string that's sewn into the side of the balloon and it opens like a zipper and self destructs. The downside is they're incredibly lightweight and so thin and delicate, you have to be really careful and touch it with gloves. And they were about an hour into filling it with the four massive tanks of healing we had on hand when we made a gut wrenching discovery. Time: 13:58 - 14:38 Hey, dude. Time: 14:44 - 14:44 I got bad news. Time: 14:45 - 14:46 We have to scrub. Start taking the helium out of the balloon. Time: 14:47 - 14:50 A lot scrubbed. Time: 14:54 - 14:56 They Time: 14:57 - 14:58 had some issues that I guess they can't resolve by today. Time: 14:58 - 15:01 So we're sucking out the helium Time: 15:01 - 15:03 from the balloon Time: 15:04 - 15:05 and trying for another day. Time: 15:06 - 15:08 So Time: 15:09 - 15:09 So no? No. Yep. Yeah. What are you talking about? Are you serious? I don't know what it sounds like. Now for context, Joe was in charge of this part of the rocket and me and my team were in charge of all of this. And while we'd each tested our individual systems ad nauseam, it wasn't until that morning that we were able to test the integration of the two systems together. And when we did, it became immediately clear to me I had made a critical oversight. Time: 15:12 - 15:36 So tension compression, Time: 15:37 - 15:38 this is great. It's holding on to that thing fantastically. Time: 15:39 - 15:42 The problem is this is so long and heavy, as soon as it wiggles, it's going to want to bend. Great intention compression, Time: 15:43 - 15:49 but this happening at Mach two is That's not gonna work out. Time: 15:51 - 15:55 There's no other balloons in the world of this size that we can get access to. This is the only one for, like, another month. We're trying to save this one so we could hopefully reuse it, but any slight little damage, you touch it in the wrong spot, Time: 15:56 - 16:10 and now that's an imperfection that may actually be a failure point for a future mission. Time: 16:10 - 16:15 And this was an absolute low point for me. The integration of two independent systems is such a classic failure point in engineering. Time: 16:16 - 16:24 I was crushed. I had missed this. And financial concerns aside, I felt like I had just let everyone down. Not just my team and the rest of the crew helping out, but all the other folks, some of whom drove six hours to come out and watch as well. Time: 16:24 - 16:40 But that's the thing with failures. They can sting like crazy, but it's really just a process Time: 16:40 - 16:45 to learn one more way not to do a thing. And so even as I sat there feeling pretty bad like any good engineer, I was already coming up with a list of all the things we were going to fix to get back out here and try this dang thing one more time. And this principle of resiliency is something I think can be learned. In fact, I believe this so much. I started a toy company called Crunch Labs with the express goal of helping kids think like an engineer. So with the build box, box, not only do you get a super fun toy that you put together every month, but you do it alongside me while I teach you all the juicy physics of how it works. We're right there in the trenches building and succeeding together so the principles really sink in. So if you're a kid and you're looking for something to put at the top of your Christmas wish list or you wanna gift it to someone else so you can be the household hero, just head to crunchlabs.com Time: 16:45 - 17:33 or use the link in the video description. Time: 17:33 - 17:35 Now as far as my plan to bounce back from my own failure, we did four things to really get serious and stack the dice in our favor for the final launch. First of all, we fixed the connection point with more of a sheath design that could handle the bending moment. And then at the right altitude, it would autonomously Time: 17:36 - 17:50 separate the two halves with a black powder charge. Second, we ran some vacuum and Time: 17:51 - 17:55 temperature tests on a raw egg. There's no air pressure and it's really, really cold in space. So if you don't do something to protect the egg for the two hours it takes the balloon to get up to space, it will freeze and crack the egg every time. So we tested some heaters in our egg chamber and proved that they keep the egg warm enough. Third, we built redundancy into our system. When NASA sends something to Mars, they can't go there to fix it. So it just has to work. And for that reason, a lot of critical systems have backups. Even the part of my own hardware and curiosity that accepted a dirt sample from the arm into the belly of the rover had two doors that opened to the exact same place in case one of the doors ever stopped working. In our case, redundancy meant making a two foot wide custom beach ball that we would stuff with a second egg surrounded in packing materials with a 20 foot streamer on the back, we would just drop like a rock. It would be dead simple. No parachutes to deploy, no autonomous timing sequences, Time: 17:56 - 18:49 and no fancy mechanisms. This would be our redundant, yet I would argue kind of boring, second chance opportunity Time: 18:50 - 18:56 to land a safe egg. And fourth and finally, we went to a local crane yard to test both our solutions at their Time: 18:56 - 19:03 terminal velocities, starting first with the beach ball. Come on, baby. Time: 19:04 - 19:07 She's alive. Time: 19:11 - 19:11 And after that, we tested the final landing configuration Time: 19:12 - 19:15 of the rocket. Time: 19:15 - 19:16 Oh, yeah. Time: 19:17 - 19:18 Oh, yeah. By the way, the actual rover parachute held perfectly. Time: 19:19 - 19:23 And so after all that, we made the six hour trek back to the desert for what I was really, really hoping would be the last time. Hey, guys. Time: 19:24 - 19:32 After four failed attempts, we had learned so much, which left me feeling cautiously optimistic. Time: 19:33 - 19:38 And right out of the gate, we got two bits of really good news. The first relates to that super delicate zero pressure balloon we had to reuse from the last launch because there was no possible way to get a replacement. Time: 19:38 - 19:49 Just barely touching the balloon leaves it stressed and creates a weak point for it to tear, so I was obsessively checking the fish scale reading that would give us the verdict. The force reading is 37.6 Time: 19:49 - 20:00 kilograms Time: 20:00 - 20:01 of buoyancy force pulling this up. Importantly, Time: 20:01 - 20:05 it's not changing. If it were changing and going down, that means we would have a leak, but it's holding steady at 37.6. Time: 20:05 - 20:12 That's a big deal. And the second piece of good news is my buddy and warm blooded good luck charm, Al Chen had arrived. You might recognize Al as the other guy here with Adam, and he's the one who actually said this. Touchdown confirmed. We're safe on Time: 20:12 - 20:26 Mars. If we were successful, Time: 20:27 - 20:28 he'd be the one to make the official call. And so after all the requisite last minute preparations, Time: 20:29 - 20:33 in three long years Here we go, girl. It was finally time for liftoff. Time: 20:34 - 20:38 Ready? Three, Time: 20:40 - 20:41 two, one. Time: 20:41 - 20:42 You're ready. Time: 20:44 - 20:45 And everything was looking good. The blue rate was just we predicted and that meant we for sure didn't have a leak and things were finally breaking our way. Is that how it's supposed to look? Yeah. And it takes about two hours to get all the way up to space. Time: 20:53 - 21:08 Woah. Time: 21:09 - 21:09 So once the balloon hit 30,000 feet, we decided to hop in the car so we could drive over to the predicted landing spot about forty five minutes away. Time: 21:10 - 21:17 So far, it's all systems nominal. Time: 21:17 - 21:20 Balloons in the air, it's ascending at the right rate. We've passed some critical Time: 21:20 - 21:24 threshold points, Time: 21:24 - 21:25 and we're we're still in the game. Time: 21:26 - 21:27 Fifth time is the charm as they say. We eventually started outrunning the balloon in the car, so we pulled over for a bit as we reached an important altitude milestone of of a hundred thousand feet. I would say over a hundred. Time: 21:28 - 21:39 Woah. Over a hundred. Time: 21:40 - 21:41 That's 19 miles up and two and a half times higher than a typical commercial plane flies. And because the balloon expands so large as it rises, we realized we could actually even spot it from the ground, which was awesome. Oh, yeah. No. I see it. Yeah. Time: 21:42 - 21:56 Dude, that's that's totally it. What wasn't awesome was when moments later, Joe, while looking through the binoculars, Time: 21:56 - 22:02 made this gut wrenching observation. It looked really big and then it looked really small. You saw it Time: 22:03 - 22:04 Yeah. It it like seems to be smaller. But it's just weird that it would just completely disappear. Which was followed by a devastating call from the balloon tracking team. It dropped within the last two minutes. Time: 22:09 - 22:20 Yeah. That's 30,000 feet over the last however, so it's just popped. But these don't pop. There's zero pressure. And that's true. They don't pop. But unbeknownst to us, while we were looking at it from the ground, the rocket and beach ball had been spinning around and around relative to the balloon for about ten minutes. This meant the cord that attaches to the string that self destructs the balloon was getting wrapped around tighter and tighter until it was so tight, it pulled down on the balloon string that is designed to essentially unzip and destroy itself. And so before we even had the chance to release the rocketed beach ball from the balloon, it all started coming down in one big tangled heap at a 50 miles per hour, which is way faster than the eggs could survive. Oh, let's start driving. Time: 22:21 - 23:03 And as we drove over, all I could think about was how our fate would rest solely in the hands of the redundant systems we'd put in place. Time: 23:05 - 23:12 We think it's probably Time: 23:12 - 23:14 about two miles up that way. Time: 23:14 - 23:17 This was our Apollo thirteen moment. If our payload could autonomously jettison itself from the tangled rocket balloon mess at 20,000 feet, then it would be able to deploy our lucky orange parachute and land the egg safely on its airbags. Time: 23:17 - 23:30 And as we parked, we knew what was done was done. There was nothing left to do but go on a hunt to find the wreckage Time: 23:30 - 23:37 and reveal our fate. Time: 23:37 - 23:38 I see something orange. Time: 23:39 - 23:40 That looks like a rover parachute. Time: 23:41 - 23:42 Okay. Time: 23:43 - 23:44 We've got a thing. And seeing the payload all by itself was a huge deal because it meant it had actually autonomously Time: 23:46 - 23:53 ejected itself from the mangled weather balloon mess at 20,000 feet. And later when we checked the footage, this is exactly what it confirmed. And while that was incredible news, I knew by this point not to get my hopes up. I mean, so let's look through the window, a little bit of dirt. Let's see. Good. Definitely touchdown, but Touchdown confirmed whether or not we're safe on earth. It's TVD right? Let's check it out to be sure. Oh man. Time: 23:53 - 24:16 Touchdown confirmed. We're safe on earth. We're safe on earth. Time: 24:22 - 24:26 That is the hot egg. Time: 24:28 - 24:29 It was in space and now it's on Earth and it's not broken. After that, we tracked down the beach ball which as far as I was concerned is just extra credit at this point. This is the backup, the simple solution, the true engineer solution here. Time: 24:30 - 24:43 Oh my god. Time: 24:45 - 24:46 That's now confirmed. Look at that. We're safe on earth. We are safe on earth. Time: 24:48 - 24:52 Two for two, baby. Two for two. Time: 24:52 - 24:55 And as we walked away with two uncracked eggs in hand, I was reminded that in life, things rarely unfold how we think they will. But by learning from your failures coupled with a bit of tenacity, us humans can accomplish a feat as incredible as the world's smartest Martian robots or as ridiculous Time: 24:55 - 25:11 as the world's tallest egg drop. Time: 25:12 - 25:14 You know what would be cool? Because, like, I hope you learned something by watching this video. But how much more would you have learned if you were out there in the desert with me helping to, like, troubleshoot and put the rocket together? Well, I got great news for you because I got the next best thing, Time: 25:15 - 25:31 and it's called the Crunch Labs Buildbox. Time: 25:31 - 25:33 It's a toy that gets delivered right to your doorstep every month and then we build it together while I teach you all the juice of physics that make it work. You're basically unlocking your own personal Mark Rober video every month where you learn a new engineering principle that will have you not just building like an engineer, but more importantly, Time: 25:34 - 25:49 thinking like an engineer. So you develop that resilience and those problem solving skills. And by the way, don't go sleeping on just how cool the toys we'll be building together actually are. Time: 25:50 - 26:01 Like this insanely Time: 26:02 - 26:03 accurate rapid fire disk launcher, or this linkage powered drawing machine, or this Rube Goldberg style catapult launcher that will leave you feeling like you just landed your own dang egg from space. And I should mention that Crunch Labs is a real place. It's where we design all these boxes and it's got a tennis ball cannon and the world's longest Hot Wheels track and a foam pit and a bunch of other cool inventions. And each month when you open your box that comes in the mail, you have a chance to find the platinum ticket. And if your box has it, that means you and your family get to come And if your box has it, that means you and your family get to come out and visit me and my team for a day, and we'll build some cool stuff together. So if you wanna embark on this year long journey with me and make a sad Christmas tree like this, a happy Christmas tree, Time: 26:04 - 26:43 just go to crunchlabs.com Time: 26:44 - 26:45 or use the link in the video description where we're giving away two months free as a holiday special. Time: 26:45 - 26:51I especially like the part where you finally realize you're trying to make a precision guided missile, and the acknowledgment that those who know.... Literally cannot help you.",
      "comments": [
        {
          "text": "make some cool stuff together.   https://crunchlabs.com",
          "author": "Unknown",
          "likes": 23559,
          "timestamp": "Mark can engineer an egg to drop from space without breaking. Meanwhile, I can't get"
        },
        {
          "text": "my eggs home from the grocery store without one of them breaking.\nEngineer 1 🥚 Egghead neuroscientist 0 🍳\nThat said, my egg goal is to dive deep into how we each transform from 1 egg to 30\ntrillion cells. Vids forthcoming. 🧠⚡",
          "author": "Unknown",
          "likes": 10115,
          "timestamp": "Those final two eggs should've been incubated and hatched afterwards so they could be"
        },
        {
          "text": "space chickens or space Avians.",
          "author": "Unknown",
          "likes": 7907,
          "timestamp": "My specialty is firearms but I feel for the expert here. How many times has someone"
        },
        {
          "text": "come to me with some “great idea” and then I go “that’s at least ten years in prison”",
          "author": "Unknown",
          "likes": 7552,
          "timestamp": "It's insane to realize halfway that what they were trying to make so hard, essentially"
        },
        {
          "text": "covered the basics for a Kinetic Orbital Strike weapon.",
          "author": "Unknown",
          "likes": 6242,
          "timestamp": "Mark is the only guy who accidentally make a guided missle"
        },
        {
          "text": "shows just how much perseverance and dedication Mark has to these things.",
          "author": "Unknown",
          "likes": 4833,
          "timestamp": "\"Which was surprising because Joe had definitely run through a lot of analysis and"
        },
        {
          "text": "testing before coming here. So after conducting a thorough review of the footage and\nfirmware he was able to locate and fix a single rogue negative sign in the code that\nseemed to be causing all the control issues\" - The perfect description of my entire\nengineering degree",
          "author": "Unknown",
          "likes": 4619,
          "timestamp": "I absolutely never heard of balloons being sent to space on daily basis around the world."
        },
        {
          "text": "Thanks",
          "author": "Unknown",
          "likes": 4265,
          "timestamp": "The fact this one egg has traveled much higher than probably anyone watching this"
        },
        {
          "text": "video will ever go is just insane",
          "author": "Unknown",
          "likes": 4208,
          "timestamp": "I love you calling the expert:"
        },
        {
          "text": "“Dude can you help us with this silly egg thing?”\n“Um you’re trying to make a guided missile so no”\n🤣",
          "author": "Unknown",
          "likes": 4097,
          "timestamp": "No way! So cool to see Joe in this video, was not expecting that!"
        },
        {
          "text": "dedication to his craft is unmatched!",
          "author": "Unknown",
          "likes": 3556,
          "timestamp": "- I love you calling the expert:"
        },
        {
          "text": "“Dude can you help us with this silly egg thing?”\n“Um you’re trying to make a guided missile so no” 😂",
          "author": "Unknown",
          "likes": 3309,
          "timestamp": "Imagine sitting on an airplane and suddenly an egg breaks on your window..."
        },
        {
          "text": "bunch of guys with an egg building a rocket and guiding it back down to a particular\nlocation without breaking the egg being seen as a 'passion project' is wild.",
          "author": "Unknown",
          "likes": 3177,
          "timestamp": "Marks video here is a perfect example of \"you don't lose, you learn\""
        },
        {
          "text": "and instantly back pedals to building a rocket since that is legal and way easier with his\nknowledge",
          "author": "Unknown",
          "likes": 2777,
          "timestamp": "That section with Adam was hilarious, the way he pointed out that you were making a"
        },
        {
          "text": "guided missile made me laugh!! So cool to be able to call someone like that too",
          "author": "Unknown",
          "likes": 2546,
          "timestamp": "Was constantly expecting Mark to say \"and then a bird flew into the balloon and we cried"
        },
        {
          "text": "for days\"",
          "author": "Unknown",
          "likes": 2263,
          "timestamp": "Love how the information Mark needed to help his “precision guided missle” was literally"
        },
        {
          "text": "CLASSIFIED",
          "author": "Unknown",
          "likes": 2191,
          "timestamp": "As an engineer, the most relatable thing I’ve ever heard on this channel is “Our project"
        },
        {
          "text": "ending death spiral was caused by a single rogue negative sign”",
          "author": "Unknown",
          "likes": 2143,
          "timestamp": "I literally gasped when I saw the zero pressure balloon prematurely popped.  Watching"
        },
        {
          "text": "engineering fail and succeed simultaneously is refreshing.  I work hard to teach my kids\nthat failing is not the goal but it is not bad. Just part of the process.",
          "author": "Unknown",
          "likes": 2101,
          "timestamp": "The bigger question is: if it falls for like 8 mins from space, is it well cooked when its"
        },
        {
          "text": "come down?",
          "author": "Unknown",
          "likes": 2079,
          "timestamp": "The Most Phenomenal thing about this is that this didnt feel like a youtube video, it felt"
        },
        {
          "text": "like it was a documentary about a mission with such a high hill to overcome it felt\nimpossible.",
          "author": "Unknown",
          "likes": 1957,
          "timestamp": "When he said the guidance system on the first prototype failed because of \"a single"
        },
        {
          "text": "rogue negative sign in the code\"..\nI felt that.",
          "author": "Unknown",
          "likes": 1771,
          "timestamp": "imagine waking up one morning and seeing an egg tied to a missile to a giant balloon"
        },
        {
          "text": "flying past your house",
          "author": "Unknown",
          "likes": 1693,
          "timestamp": "I love that instead of grabbing an egg from any other nest, he chose to grab an egg from"
        },
        {
          "text": "underneath the one chicken in the roost",
          "author": "Unknown",
          "likes": 1571,
          "timestamp": "I love that the majority of the video is about failure. None of that prevents you from"
        },
        {
          "text": "moving forward. This video would have been amazing even if the eggs had broken. It’s\nyour great attitude and joy of learning that is so valuable",
          "author": "Unknown",
          "likes": 1488,
          "timestamp": "When Mark says \"congratulations\" when he leaves the chicken coupe, like\" congrats"
        },
        {
          "text": "were taking your kid for a world record he'll probably never return!\"",
          "author": "Unknown",
          "likes": 1319,
          "timestamp": "i'm blown away by how much effort this was...you just say \"a couple months later\" and it"
        },
        {
          "text": "takes us three seconds to watch. i'm so amazed. props to you for all the hard work you\nput into this and all of your videos. they are a joy to watch.",
          "author": "Unknown",
          "likes": 1259,
          "timestamp": "That mother hen must be very proud of her little \"eggstronaught\"!"
        },
        {
          "text": "worked the same",
          "author": "Unknown",
          "likes": 1086,
          "timestamp": "I cant imagine what it feels like to work on something for months only to recognize a"
        },
        {
          "text": "critical error at the very end and have to postpone or even scrap those months of work.\nSo much respect for yalls fortitude and determination for pushing forward regardless of\nsetbacks.",
          "author": "Unknown",
          "likes": 967,
          "timestamp": "I was incredibly shocked when mark started cutting the nylon. It seemed so priceless"
        },
        {
          "text": "and is really a one of a kind",
          "author": "Unknown",
          "likes": 950,
          "timestamp": "Hello"
        },
        {
          "text": "Electrical engineering student here mid semester\n30 minutes ago I was in a real bad mood about the amount of homework we got over the\nweekend and the upcoming mid semester tests, and now, after watching your video of\nthe whole process and the final outcome, I got cheered up and motivated again for  the\nstudy of my passion.\nYou inspired and continue inspiring a generation of future engineers and for that I'm only\ngreatfull.\nThanks Mark.",
          "author": "Unknown",
          "likes": 924,
          "timestamp": "I myself am in the space industry and I know personally what it’s like to fail, and I loved"
        },
        {
          "text": "how you kept going even if you failed and persevered throughout the whole journey.\nThanks for being an inspiration to all future engineers and current ones.",
          "author": "Unknown",
          "likes": 922,
          "timestamp": "The fact that this 26 minute video was 3 years in the making is insane to me"
        },
        {
          "text": "eggs in the other baskets not armed by chickens",
          "author": "Unknown",
          "likes": 918,
          "timestamp": "Dude is a next-level content creator. I have a lot of work and hobby interests and"
        },
        {
          "text": "therefore a lot of fave YouTubers but Mark is top dog, full stop.",
          "author": "Unknown",
          "likes": 890,
          "timestamp": "Imagine just being an egg on a shelf in a"
        },
        {
          "text": "Grocery, and going to SPACE.",
          "author": "Unknown",
          "likes": 847,
          "timestamp": "Literally went to college to be an engineer because of your videos. Stuff like this is"
        },
        {
          "text": "amazing and so cool that you can get so many people involved in these types of videos.",
          "author": "Unknown",
          "likes": 840,
          "timestamp": "The best part of the whole thing is that they try again and again, this truly gives the urge"
        },
        {
          "text": "of succeeding the goal. It's overall a thrill to watch this.",
          "author": "Unknown",
          "likes": 840,
          "timestamp": "Just imagine a plane flying in their direction and they collide with that balloon"
        }
      ]
    },
    {
      "video_id": "video_6",
      "title": "Shark Attack Test- Human Blood vs. Fish Blood This is a specialized human shaped shark cage I designed and this is me in the middle of a shark feeding frenzy in that cage, which as it happens,",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:09 doesn't actually keep the sharks out. They're in the freaking cage. But to understand how I ended up in the middle of The Bahamas with buckets of blood surrounded by a butt ton of sharks, we've got to go back exactly one year. Because that's when I ran a test to see what really happens if sharks smell a drop of human blood in the water. For that experiment, I pumped out 15 drops of human blood per minute for an hour pretty close to a bunch of sharks that in the end just weren't really that interested. So this busted the myth from the movies that sharks are these ruthless killers that just go crazy if they smell a drop of your blood from a mile away. But those results made me really curious if the sharks would react differently to fish blood versus human blood. And if they did go crazy for fish blood, could I use that to put myself right at the center of a shark feeding frenzy? And so to satiate my curiosity, Time: 00:09 - 00:59 my friends at Discovery helped me make my way back to The Bahamas as part of Shark Week this year. But this time, I wouldn't be alone. Time: 00:59 - 01:05 What up, Robes? Oh, wow. Mark's jumping in on this? What's up, y'all? Time: 01:06 - 01:10 Look. Last Shark Week, Shark tried to kill me. Time: 01:10 - 01:13 I figured we'll have a little bit of science with Rover, Time: 01:15 - 01:17 a little bit of fun with Dude Perfect, and a little bit of me. Alright. Y'all ready to do this? We were born ready, sir. Alright. Time: 01:18 - 01:26 Chop chop. Let's get to it, fellas. We will not let you down. Looking forward to it. See you. Yeah. I've got this idea for a build to just really get me in close with the sharks. Time: 01:27 - 01:37 Last year, I was in the water. Rover. Time: 01:38 - 01:40 That was me saying I'm finished with the call, bro. No. Time: 01:41 - 01:44 Of course. Alright. See you guys later. Let's get to it. Let's do this. Looking forward to it. See you then. And so in the direction of Shaq Diesel, it was time to head to The Bahamas. All that was left was to swab my nose to prove to the Bahamian government that I didn't have coronavirus. Time: 01:44 - 01:58 The only problem was Time: 01:58 - 01:59 my test came back Time: 02:00 - 02:01 positive. Time: 02:03 - 02:03 And this just made me really sad because not only was I gonna miss Time: 02:04 - 02:07 out on this epic adventure, but as far as I was concerned, I was basically just waiting to die. And I had to interact with my family through the glass door to the backyard using a laser pointer, and not even fat Gus would get within six feet of me. Time: 02:08 - 02:20 Now I'm happy to say I eventually beat the Rona and tested negative, but the only problem now is I missed my chance because they were no longer accepting any commercial flights from America because we're number one, baby. Time: 02:21 - 02:32 So I was once again incredibly Time: 02:33 - 02:34 sad Time: 02:35 - 02:35 until I found a loophole because while you couldn't go to The Bahamas on a public commercial flight, there were no rules against going to The Bahamas Time: 02:36 - 02:43 on a private jet. Time: 02:43 - 02:45 And since this was the first and last time I would ever have my own personal g six, I acted like I've been here before, like the true professional I am. I mean, mostly. Time: 02:46 - 02:55 Put Elon on hold and transfer to Oprah. Time: 03:21 - 03:23 I should mention flying across country on your own plane isn't the most ecologically responsible choice. So while I was in the air, I utilized this website called teamtrees.org, Time: 03:35 - 03:44 you might have heard of it, to plant enough trees to suck up the carbon not only for my flight, but the next 100 flights this plane would take. Time: 03:44 - 03:51 In the end it's important you guys know I'm still super grounded, and I didn't let the experience Time: 03:54 - 03:59 change me one bit and Time: 03:59 - 04:01 So now that I was in The Bahamas the first thing I did was check-in with my marine biologist shark diving expert buddy Luke Tipple because we need to figure out how to somehow get blood Time: 04:02 - 04:11 out of a fish. Time: 04:11 - 04:12 Oh. Time: 04:12 - 04:13 Just like that. This is how we do it. Time: 04:14 - 04:16 The first thought is like, Time: 04:17 - 04:18 can you just freaking blend a fish? Give it a shot. I'll be over here. Dude, you've clearly never seen Will It Blend. There's a whole YouTube channel dedicated to this. Ready? Time: 04:19 - 04:27 Okay. I think if we add a little bit of water Time: 04:33 - 04:35 Yeah. Time: 04:36 - 04:37 Oh, yeah. Oh, yeah. Okay. Time: 04:38 - 04:40 This looks like the number 32 from Jamba Juice. We tried a variety of other techniques and eventually started hitting our stride and the bucket started filling Time: 04:42 - 04:50 up. Time: 04:50 - 04:50 If Time: 05:05 - 05:06 I could smell this, that looks pretty delicious. Time: 05:09 - 05:12 A good thing about Mark is it's his stupid idea, but he's not making other people do it. I respect that about me too. Yeah. Time: 05:14 - 05:20 I also learned this is what fish gills look like on the inside. They're like pages in a book to increase the surface area which maximizes the oxygen they can pull out of the water. So we've taken about 20 fish Time: 05:28 - 05:39 with a little bit of help from the blender, Time: 05:39 - 05:41 turn them into this. Time: 05:42 - 05:43 If I'm a shark, I'm like that's freaking delicious. Now that we had five gallons of mouth watering fish blood smoothie, it was time to get some answers. We already know that sharks don't necessarily go nuts in the presence of a little bit of human blood, but would they go nuts in the presence of a little bit of fish blood and as a firm believer in the scientific method it was time to test our hypothesis Time: 05:44 - 06:04 by heading out to sea once we were far enough from land Luke and I came up with a game plan for the experiment. Basically, we would have two surfboards in the water. One would have a five gallon bucket of our fish blood smoothie and then another would have five gallons of human blood. We would also have a third board that just had seawater as a control to make sure the sharks weren't just interested in the surfboards. Then we would pump out the contents of each of the buckets over the course of an hour and observe how many sharks approached each board. And once we know which one they prefer after this, we'll use that tomorrow in the cage just to create the most wild feeding frenzy. Right? Which sounds super fun to me. Because you're not in the cage. Time: 06:04 - 06:39 And so with the plan in place, all that was left to do was put the boards together and get them out with the sharks. Time: 06:40 - 06:45 One of the limitations to last year's test was that the boards might have been too close to the boat. So it's possible some of the sharks actually smelled the blood, but didn't investigate it because they were just waiting for a handout from the boat. So this time, we basically placed the boards in the middle of the freaking ocean, super far away from the boat so it wouldn't be a confounding variable. Oh, and I should also mention we ended up using cow's blood because it's really hard to legally find five gallons of human blood. And after talking with a couple shark scientists, they've shown experimentally that all mammal blood essentially smells the same to sharks. So it wouldn't affect the results to use cow blood in place of human blood. So now that all three boards were in place, we double checked to ensure each was anchored down to the ocean floor. Then I just had to start all three custom built pumps using our custom built remote trigger, which is the exact moment I realized it must have got busted while being shipped out here because it wasn't sending a signal, which Time: 07:09 - 08:04 sucks Time: 08:05 - 08:05 because there's absolutely no way to run the pumps manually. Luckily, a trick I learned while working at NASA is you always build redundancy into your systems just in case. So we have it in the code that if no remote signal is received after an hour, each of the pumps will just automatically start up on their own. It's just a feature we never had time to test. So we just had to firmly cross our fingers and hope for the best. I'm hopeful. We've had to overcome a lot to get here for this this video. Well, it's one more little challenge. And at exactly one hour, Time: 08:05 - 08:38 right on cue, the backup code kicked in and saved our whole experiment. With blood now officially in the water, we put the drone into the air and started our observations. Time: 08:40 - 08:49 Mammal blood board. Shark? Yeah. Shark, baby. Shark. Time: 08:58 - 09:01 Oh, yeah. Yeah. But pretty soon there after, things started heating up for the fish blood smoothie board. Time: 09:02 - 09:07 Oh, my gosh. Time: 09:08 - 09:09 There's one two three four five six seven eight nine ten eleven Time: 09:09 - 09:12 sharks around the fish smoothie board. And then ten minutes later, things were only more intense. Time: 09:13 - 09:19 Here you can see the difference in activity between the three boards. And while you're running an experiment and still collecting data, you really need to keep an open mind. But given what we were seeing, it was getting pretty difficult to remain objective. And so after an hour, we called the experiment and went inside to officially tally up the results using the drone Time: 09:20 - 09:35 mammal blood board was approached eight times, the seawater control board was at zero, and the fish blood board had a whopping Time: 09:41 - 09:49 134 Time: 09:50 - 09:51 approaches Time: 09:51 - 09:52 from a shark. It definitely seems like the fish smoothie is worth that. Right? It's pretty obvious. Massive blob of sharks. No sharks. I think that's the go for tomorrow for maximum feeding frenzy. Now we had a game plan for my feeding frenzy cage the next day, we headed back to shore and to our hotel to get some rest for what was to come. Oh, and fun side note, if the only way to get to a vacation destination is by private jet, it really cuts down on the crowds. Time: 09:52 - 10:17 We literally had this whole resort to ourselves. Time: 10:19 - 10:22 Well, almost to ourselves. There were like 40 cats who apparently must also fly Time: 10:23 - 10:28 private. We woke up bright and early the next morning feeling refreshed and headed right back out to sea where Luke and I prepared some massive bags of fish blood smoothie for me to burst open once I went down. Time: 10:29 - 10:40 It just seemed like a cool idea to make a cage to get in the middle of a freezing frenzy until this moment. Time: 10:42 - 10:46 Now that they're making me put on freaking chain mail, it makes me reconsider my life choices. If something terrible happens, Shaq, you gotta take care of my family because this is all your fault. Time: 10:47 - 10:56 Yeah. Let's go. Time: 10:58 - 10:59 And after several months of prep, unfortunately, Time: 11:04 - 11:06 it was time for me to get in. It also just so happens, I might have forgot to mention this part to my wife. I'm not looking under the water yet on purpose. Time: 11:07 - 11:15 She might have been under the impression I was just doing another experiment with surfboards and pumps. Time: 11:18 - 11:23 Sorry, sweetie. Time: 11:24 - 11:25 Sweetie. Not only was I wearing 10 pounds of steel chainmail for protection, but my vest is also filled with 20 pounds of lead weights. That means I sank pretty fast, but also that the buoyancy to weight ratios were perfect for giving me practice for walking on the moon. That's one small step for man. Because like many of you, I will definitely go to space in my lifetime. Again, just haven't mentioned that to the wife Time: 11:26 - 11:51 yet. Alright. You ready for the trip? Time: 12:00 - 12:02 Now that I have the fish smoothie bags and everyone was back at a safe distance, I just had to pop these stupid things. Time: 12:15 - 12:21 Okay. Time: 12:22 - 12:22 There you go. Time: 12:23 - 12:24 Oh, this is crazy. What am I doing? Time: 12:25 - 12:28 Oh, now they're literally like moving circles around me. Time: 13:12 - 13:15 Oh, gosh. Time: 13:16 - 13:17 Oh, it's kinda moving ginge. Time: 13:18 - 13:19 Oh, it's a crab. Time: 13:20 - 13:21 It's surprisingly Time: 13:22 - 13:23 insane. Time: 13:24 - 13:24 The sharks were literally trying to eat me through the bottom of the cage, so they left me no choice but to defend my honor. Yeah. Get out of my cage. Get out of my cage. Time: 13:26 - 13:36 I'm gonna kill you, Jack. Time: 13:37 - 13:39 Put the heck out. Time: 13:40 - 13:41 Hey. Time: 13:43 - 13:44 Get Time: 13:47 - 13:48 out of my cage. Alright? Time: 13:48 - 13:50 My lungs are blending to talk then. Time: 13:50 - 13:53 We knew all along that the most dangerous part would be when I exited the cage because they'd still be agitated and they'd be stoked to finally have access to the soft chewy center. Time: 13:54 - 14:04 Okay. Time: 14:04 - 14:05 We're pulling the bait away, mate. So the plan was for one of the other divers to distract them way off to the side with the bait box, and then I would get out as silently as possible, so they wouldn't notice me. Time: 14:09 - 14:20 Oh, crap. Time: 14:49 - 14:50 That was loud. Time: 14:52 - 14:54 Don't be rash. Time: 14:56 - 14:58 Holy crap. I'm gonna close this back up. Time: 15:00 - 15:02 Oh, jeez. Luke, I need help, man. Time: 15:07 - 15:10 Holy crap. Time: 15:11 - 15:12 Jeez. Time: 15:12 - 15:13 If you're off it, baby, jump back out of the way. I wanna get you back to the surface. Time: 15:14 - 15:18 I need someone to tell Shaq he can do his Time: 15:32 - 15:34 Main takeaway for me for this experience is that sharks have been on this planet longer than the dinosaurs or even trees have. So they've had four hundred million years of evolution to develop these instincts that are rewarded for smelling fish blood. Humans and cows will be an extremely rare delicacy. So it makes sense that it's not just hardwired into their brains. And so with all my limbs intact and with my curiosity fully satiated, I will leave you with these profound words that in my defense might have been the drama of me speaking. As humans we're always the predator and not really ever the prey. But this gave me a sense of what it's like to be a tuna Time: 15:38 - 16:12 fish. Time: 16:20 - 16:20Sorry this took awhile.  I've got 8 absolute banger videos I'm currently working on through April 2021 but it turns out the Rona slows things down a bit.  They will be worth the wait!  For updates, follow me on social stuff @MarkRober.",
      "comments": [
        {
          "text": "to see his new video",
          "author": "Unknown",
          "likes": 45795,
          "timestamp": "Can't wait for the video when Mark actually goes to space"
        },
        {
          "text": "so great",
          "author": "Unknown",
          "likes": 15890,
          "timestamp": "Can we appreciate this man kept his channel so family-friendly that he said \"heck\" while"
        },
        {
          "text": "being eaten by sharks",
          "author": "Unknown",
          "likes": 6149,
          "timestamp": "Mark doesn’t post A lot but when he does post. He teaches me stuff that school never"
        },
        {
          "text": "does. Thanks Mark!",
          "author": "Unknown",
          "likes": 5840,
          "timestamp": "“It’s really hard to get 5 gallons of human blood legally.”"
        },
        {
          "text": "Can confirm.",
          "author": "Unknown",
          "likes": 4427,
          "timestamp": "I love that the term \"legally\" was added to \"It's hard to get 5 gallons of human blood\","
        },
        {
          "text": "because it implies that there are ways to get that much blood _illegally_ , and that Mark\nknows about them",
          "author": "Unknown",
          "likes": 3940,
          "timestamp": "\"It turns out it's really hard to find 5 gallons of human blood legally\""
        },
        {
          "text": "Mate, your Google search history must be a treat 🙂",
          "author": "Unknown",
          "likes": 3578,
          "timestamp": "This man's vids don't come in quantity, they come in quality."
        },
        {
          "text": "Edit: So I realized through the replies and I came  across the same comment that was\nposted before mine. So credit to Frosteyzz for this. There was probably someone even\nbefore him but for this video he was probably first.",
          "author": "Unknown",
          "likes": 3240,
          "timestamp": "Mark: “I’m in the Bahamas with a bucket of blood.”"
        },
        {
          "text": "Me: “Mark... not again...”",
          "author": "Unknown",
          "likes": 3070,
          "timestamp": "true discipline is being in a cage underwater with 20 sharks circling you and not cursing"
        },
        {
          "text": "once",
          "author": "Unknown",
          "likes": 2951,
          "timestamp": "If this would have gone wrong:"
        },
        {
          "text": "*Former nasa scientist dies while trying to prove that sharks don't eat humans*",
          "author": "Unknown",
          "likes": 2880,
          "timestamp": "Mark: \"Get outta the cage,alright\""
        },
        {
          "text": "Sharks: Understanable, have a great day!",
          "author": "Unknown",
          "likes": 2827,
          "timestamp": "Normal people in quarantine: watching Netflix"
        },
        {
          "text": "Mark: swimming with sharks and popping bags of fish blood",
          "author": "Unknown",
          "likes": 2347,
          "timestamp": "Mark: has corona and doesn’t die"
        },
        {
          "text": "Also mark: okay I have to go in a shark cage where I could die\nMarks wife: he survived twice but he won’t survive me for not telling me",
          "author": "Unknown",
          "likes": 2172,
          "timestamp": "Mark: “oh! not so tough now shark?”"
        },
        {
          "text": "**cage door slams**\nShark: *”you what mate?”*",
          "author": "Unknown",
          "likes": 2119,
          "timestamp": "Bahamas: “No you can’t just go to here from america”"
        },
        {
          "text": "Mark: *haha private jet go brrrr*",
          "author": "Unknown",
          "likes": 1993,
          "timestamp": "Mark: it’s really hard to get 5 gallons of human blood legally***..... 🤫"
        },
        {
          "text": "camera man: just swimming with sharks man, just swimming with sharks.\nedit: thx for the likes: love yall ❤",
          "author": "Unknown",
          "likes": 1951,
          "timestamp": "\"As you can see, sharks aren't interested in humans, they went for the fish blood.\""
        },
        {
          "text": "\"As you can see, the sharks are literally trying to eat me.\"",
          "author": "Unknown",
          "likes": 1880,
          "timestamp": "Mark Rober: *trying to die by sharks*"
        },
        {
          "text": "Corona: just stay home buddy",
          "author": "Unknown",
          "likes": 1764,
          "timestamp": "ok using cow blood makes sense, this whole time i was just concerned about how in the"
        },
        {
          "text": "world you managed to get 5 gallons of human blood",
          "author": "Unknown",
          "likes": 1762,
          "timestamp": "Really hard to \"legally\" find human blood...... was not expecting him to say that"
        },
        {
          "text": "Dude perfect",
          "author": "Unknown",
          "likes": 1672,
          "timestamp": "\"Let's give it up to Mark Rober for risking his life just to"
        },
        {
          "text": "1. Answer his questions\n2. Entertain us",
          "author": "Unknown",
          "likes": 1388,
          "timestamp": "“We used cows blood because is actually really hard to LEGALLY find human blood”"
        },
        {
          "text": "🤣🤣🤣🤣🤣🤣",
          "author": "Unknown",
          "likes": 1386,
          "timestamp": "\"Its very hard to get 5 gallons of human blood legally\""
        },
        {
          "text": "Hard but not impossible.",
          "author": "Unknown",
          "likes": 1383,
          "timestamp": "Why is no one talking about the cameraman. He was outside of the cage the whole time"
        },
        {
          "text": "taping.",
          "author": "Unknown",
          "likes": 1332,
          "timestamp": "Only Mark Rober says \"geez\" when he's surrounded by hungry sharks and covered in"
        },
        {
          "text": "fish blood.",
          "author": "Unknown",
          "likes": 1324,
          "timestamp": "Nobody:"
        },
        {
          "text": "Mark just 'calmly' kicking the sharks away while yelling: Get Out Of My Cage, Sir!",
          "author": "Unknown",
          "likes": 1322,
          "timestamp": "I’m surprised that nobody was talking about how Mark got the “Rona”."
        },
        {
          "text": "boys:",
          "author": "Unknown",
          "likes": 1250,
          "timestamp": "Mark: *dumps fish blood out of the cage*"
        },
        {
          "text": "The fish right outside: *chuckles* “I’m in danger”",
          "author": "Unknown",
          "likes": 1238,
          "timestamp": "Imagine Marks Browser History: \"How to get human blood?\", \"Can you make a smoothie"
        },
        {
          "text": "with a fish?\"",
          "author": "Unknown",
          "likes": 1217,
          "timestamp": "\"There was 40 cats, who must also fly private.\""
        },
        {
          "text": "*R i c h  C a t*",
          "author": "Unknown",
          "likes": 1212,
          "timestamp": "This is a horror movie for fish, blood everywhere, blended, dismantled, dismemberd"
        },
        {
          "text": "corpses, and many serial killers",
          "author": "Unknown",
          "likes": 1151,
          "timestamp": "Mark is the most professional, unprofessional guy ive ever seen."
        },
        {
          "text": "Mark Rober: Swimming with sharks and gallons of blood",
          "author": "Unknown",
          "likes": 1127,
          "timestamp": "Mark: \"Get outta my cage\""
        },
        {
          "text": "Sharks: \"Understandable, have a good day\"",
          "author": "Unknown",
          "likes": 1127,
          "timestamp": "Mark : Yo, dude, get out of my cage"
        },
        {
          "text": "Shark : *Understandable, have a great day*",
          "author": "Unknown",
          "likes": 1126,
          "timestamp": "Me:*leaves for a water*"
        },
        {
          "text": "Me:*comes back*\nMark:*blending a fish*",
          "author": "Unknown",
          "likes": 1124,
          "timestamp": "Mark: Mouth Watering fish blood smoothie"
        },
        {
          "text": "Vegans: *Dies inside*",
          "author": "Unknown",
          "likes": 1095,
          "timestamp": "He casually gets the coronavirus, beats it and swipes it off like nothing happened"
        },
        {
          "text": "5 gallons of human blood",
          "author": "Unknown",
          "likes": 1083,
          "timestamp": "disclaimer : sharks never harm the camera man .."
        },
        {
          "text": "camera",
          "author": "Unknown",
          "likes": 1029,
          "timestamp": "“Everyone was back at a safe distance.”"
        },
        {
          "text": "Camera shows them ten meters away.",
          "author": "Unknown",
          "likes": 1027,
          "timestamp": "No one:"
        },
        {
          "text": "Mark's Tombstone: \"As a firm believer in the scientific method, I decided to test this\nhypothesis\"",
          "author": "Unknown",
          "likes": 1010,
          "timestamp": "\"luke i need your help man\" that was actual fear, that line."
        }
      ]
    },
    {
      "video_id": "video_7",
      "title": "Testing if Sharks Can Smell a Drop of Blood I texted this clip to my wife who wanted proof I wasn't doing anything stupid on a recent trip to The Bahamas. Now if you're wondering what my feet are doing in shark infested waters with a bucket of blood 20 miles away from any land. Well, that comes down to a conversation I had with my friends at the Discovery Channel six months ago. They told me Shark Week is coming up and they want to know what I would do if they could put me in the middle of the ocean on a boat surrounded by sharks. For as long as I can remember, I've always wanted to test if sharks can really smell a drop of blood in the water from a mile away. Now before you say Mythbusters already did this,",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:02 - 00:34 they kind of did this? As you can see, to test this, they poked their fingers and then stuck them in a barrel with these tiny lemon sharks. And since they didn't really seem to turn around and look at their fingers, they said it was busted. Now, I'm friends with both Carrie and Adam, but I think even they would admit, at least in this case, the methodology was less than scientifically rigorous. So I came up with a more robust test procedure, built some NASA grade hardware for the experiment, hopped on a plane, and then a speedboat, and soon enough, I was 20 miles offshore of The Bahamas. What's up? Hey, Mark. Dude, there's sharks. A Time: 00:35 - 01:07 shot. That's the first time I've ever seen a shark like in the wild. Time: 01:07 - 01:11 See some science. Time: 01:13 - 01:14 To kick things off, I sat down with my marine biologist shark diving expert friend, Luke Tipple, and explained my plan down. Eventually, I planned to test just how far they could smell a single drop of blood in the water. But first, I wanted proof that they actually preferred blood over any other scent. So for my first experiment, I plan to put four surfboards in the water equidistant from the back of the boat. Each board would host two liters of a different liquid that we would pump into the ocean over the course of an hour. Then using a three meter radius around each board as a gauge, we would use drone footage and count how many sharks went over to check out each board. So this board would be fish oil, which I heard was a general attractant for lots of fish. Then we would have cow's blood here, then seawater here as a control to make sure the sharks weren't just interested in the surfboard, and then finally urine. I've heard from surfers that a lot of them won't pee in their wet suits because they feel like it's gonna attract a shark. I don't know a surfer alive who doesn't pee in their wet suits. Time: 01:14 - 02:05 But, yes, it's definitely something that I've heard a lot. They're liberating surfers everywhere. Time: 02:06 - 02:10 We show that it's cool to pee in your wet suit. And so after a bit more discussion, Luke was on board for the first of our two experiments. Well, as a firm believer in the scientific method, we'll test it out. And then you die. Well, depending on the results I've had. Time: 02:11 - 02:24 I can't pee the deals off. Time: 02:25 - 02:26 And so with that, we started putting the four boards together. Time: 02:27 - 02:30 We also started collecting Time: 02:37 - 02:39 scientific donations from the crew. Time: 02:39 - 02:41 Alright. So now it's time to fill these bags. Mhmm. What do you wanna do first? Pee or blood? Yeah. You. Let's do pee. Okay. Let's do rock, paper, scissors for who holds the fuck. Time: 02:43 - 02:52 Alright. Alright. Well, I gotta strategize. Okay. I know what I know what it is. Are you ready? One, two, three. Shoots. Time: 02:53 - 02:59 Yeah. Damn it. Oh, that smells so bad. Time: 02:59 - 03:02 It's urine. Time: 03:03 - 03:03 Whoever it is, they need to hydrate. Dude, this is gonna be a nightmare. Time: 03:04 - 03:07 Oh. Time: 03:08 - 03:08 Oh, it's warm. Time: 03:09 - 03:10 Oh, dude. It's all in my hand. Time: 03:10 - 03:12 Your pouring sucks. Time: 03:12 - 03:14 Okay. Time: 03:18 - 03:18 Oh, that's snake. We're good. We're good. Time: 03:18 - 03:21 All in the name of science. Time: 03:21 - 03:23 It's a great time of day to be doing this because we have a lot of sharks looking down here. We got oh, three or four lemons on the surface and I can actually see two tigers down on the bottom and that's actually a massive tiger shark down there. That's huge. Time: 03:23 - 03:36 Alright. See if you can do a better job pouring than I did. Time: 03:37 - 03:40 Oh my gosh. Time: 03:40 - 03:41 Oh, wow. There's a feeding frenzy. Time: 03:42 - 03:44 It's fine. What are you doing? Time: 03:45 - 03:47 I almost lost my hand. You did not. It's not gonna jump out of the water. Okay. So you've got seawater as our control, fish oil. Time: 03:47 - 03:54 I have urine Time: 03:55 - 03:56 and cow's blood. Let's Time: 03:56 - 03:57 do that. Time: 03:59 - 03:59 So while Luke is bravely swimming the four surfboards out and anchoring them in place in preparation for the one hour countdown, now is a perfect time to explain the cool tech on each board I designed and built from scratch with my buddy Sean Hodgins. For this experiment to be robust, all four boards need to start pumping at the exact same time after Luke has them in place. That means we need to somehow start the pumps using a radio signal from the boat. So each surf surfboard has a waterproof receiver box like this that also hosts the battery, a custom printed circuit board, and two Arduinos. Then I have the remote control and as soon as I hit this button, Time: 04:03 - 04:37 they all start pumping at the same time. We know each pump is working because the corresponding yellow light is lit up. That's important because they're too far away from the boat to see if they're functioning properly. To pump the blood and pee, we're using a peristaltic pump. This is a perfect choice because it's a totally stairway to get the blood from the bag to the ocean since the blood never touches any sort of valve or something. It just has these rollers that sort of pinch and push the blood through the tubing in a manner that just happens to be similar to a severed artery. And so with the boards in place, Time: 04:39 - 05:08 it was go time. Operation Time: 05:08 - 05:10 shark bait testing Time: 05:11 - 05:12 commence. Time: 05:13 - 05:13 Three, Time: 05:14 - 05:14 two, one. Time: 05:15 - 05:16 Beep. All four are going. We have confirmation. Time: 05:17 - 05:20 Everything is rolling. The experiment is underway. We'll let them go for an hour just dripping stuff out, and, yeah. Let's see what happens. Time: 05:22 - 05:30 I can see a blood trail of water bottles of seeds on the blood bone. We're gonna look back to the boat to see we're not a very blood disturbance. Time: 05:34 - 05:41 And after ten minutes, I was really surprised there wasn't a lot of action on any of the boards. Time: 05:44 - 05:49 So so far it's pretty interesting. I mean, we've shown if you have a massive cut and you're bleeding out and there's this many sharks within like 50 yards of you that they're kind of like meh. So like already that's an interesting finding, Time: 05:50 - 06:03 right? You'd think a little bit of blood and there's just be a massive swarm, but that's not the case so far. And to be clear, we weren't dealing with small quantities here. The human body contains five liters of blood and after you lose two liters, which is the exact amount we're putting in the water, then you Time: 06:04 - 06:20 die. Time: 06:20 - 06:21 About twenty minutes in, things were still pretty quiet, especially at the fish oil, urine, and control boards. But then the blood board started attracting some smaller fish, and soon after, Time: 06:21 - 06:32 one or two sharks started Time: 06:32 - 06:33 started taking notice. Not a lot of love for my pee. I don't know why I find that kind of offensive, but I'm just a little hurt. Time: 06:34 - 06:41 Eventually, with about fifteen minutes left, things started getting pretty wild over by the blood board. Time: 06:42 - 06:47 The blood was spread out and made almost like a blood runway. So you have this surreal line of sharks swimming up this enticing blood trail one after another, only to be super disappointed to find a big piece of styrofoam. Time: 06:50 - 07:02 We're almost done. Time: 07:07 - 07:08 Three, Time: 07:09 - 07:09 two, Time: 07:10 - 07:11 one. The motors have stopped. Our experiment is done. I'd just like to point out the bags have been sucked dry. So the engineering part of this experiment works flawlessly. Time: 07:11 - 07:22 Dude, there were shocks everywhere. Are you serious? Yeah. No two super pissed off targets. Time: 07:23 - 07:28 And so now it's time to go in and review the footage and get a final tally for each board. And what we found was that four sharks went to check out the fish oil, then zero sharks went to check out both the control and the urine, and then the blood board had a direct visit from a whopping 41 sharks. And so now that we debunked some surfing myths about urine and proved that sharks certainly had a strong preference for blood over anything we tested, the real question was just how much blood is interesting to them. And there was one part of the experimental design that was really nagging at me. Because that was cow's blood. Right? That was cow's blood. You wanna do human blood. I wanna just try human blood. We've got at least 10 living breathing blood bags around here. Time: 07:29 - 08:09 It's worth noting not everyone was as stoked as Luke and I about this idea. Yeah. And then just draw it. We'll just have fresh blood. Just mainline it and put it in the water. Why not? Would you be down? I'd be down. Maine dog. What do you reckon? Don't look at me, man. Time: 08:10 - 08:23 If you have all the pee you want, you can't have any blood. Time: 08:24 - 08:26 So Luke made some calls and soon enough we had an amazing certified Bahamian phlebotomist on board. I'm like, oh, I'm totally cool. I thought I popped the ball off. And after some generosity from the camera crew and even captain Scotty, we had four bulging bags of human blood for our second experiment. This is my actual blood. We're gonna see if sharks have a taste for it. And if they do, I probably won't go free diving with them. For the second experiment, we had three boards. Again, we placed the control in the middle. The board over here would pump the human blood slowly at one drop a minute and then on the other side this board would pump the blood fast on average one drop every four seconds. We were able to do that because another cool feature for the boxes we built was that by turning this knob, you can control the flow rate. So over time, they can pump out different amounts. And because sometimes we all have to step up and just do our part, while Luke once again risked his life by placing the three boards, I prepared to push a button. Time: 08:26 - 09:23 Three, Time: 09:24 - 09:25 two, one. Time: 09:25 - 09:26 Commence. Time: 09:28 - 09:29 Alright. All of them are, pumping and good to go. Now the clock's just ticking. Time: 09:31 - 09:35 We have, like, 55 Time: 09:35 - 09:37 to go. Time: 09:37 - 09:38 We'll see if the sharks notice it. Time: 09:38 - 09:40 One drop of human blood every four seconds may sound like a lot and it certainly is, but it's also important to note that's 40 times less than the first experiment where we saw so much activity. In this case halfway into experiment number two, even though there were tons of sharks still in the area, the boards themselves were pretty quiet. Time: 09:42 - 09:59 We'll have to see when we look at the footage afterwards, but so far it looks like the answer is no. Time: 09:59 - 10:04 Five four Time: 10:07 - 10:07 three Time: 10:08 - 10:09 two Time: 10:09 - 10:10 one. Time: 10:10 - 10:11 Experiment's over. And so after the full hour, we brought in the boards and once again reviewed the footage to see that over the course of an hour, zero sharks checked out the control board, zero checked out the slow blood pumping board, and exactly zero sharks checked out the fast one. So this was by no means a perfect experiment, but I think it's safe to qualitatively Time: 10:12 - 10:31 say that if no sharks came to check out 15 drops of human blood a minute in the middle of shark infested waters, you're probably gonna be okay with a small scrape. I mean there certainly won't be some kind of feeding frenzy with a single drop of blood from all sharks within a mile. Time: 10:31 - 10:45 Now that I had some firsthand data to put my mind at ease, I was willing to try diving with the sharks without a cage, but I had one final experiment. I had a theory that if we secured a three sixty camera to the front of a hand spear and then shot it near some sharks, we could create the world's first really cool matrix like underwater bullet time effect. So I suited Time: 10:46 - 11:04 up Time: 11:05 - 11:05 and got in. Time: 11:06 - 11:07 This is terrifying. Time: 11:13 - 11:14 And my theory proved correct on the bullet time hand spear. Time: 11:17 - 11:20 Because as you can see that footage turned out really cool. Time: 11:23 - 11:26 Hello, Time: 12:01 - 12:01 Hello? Time: 12:05 - 12:05 I'm not calling you. Time: 12:06 - 12:07 I'm gonna die. Time: 12:08 - 12:09 Stacy, Luke. Time: 12:11 - 12:12 Making sense of a noob. I know it. They know I'm a noob. Time: 12:15 - 12:18 About that night? Here we come on tonight. Time: 12:19 - 12:21 That Time: 12:23 - 12:24 was amazing, man. We got it in like a feeding frenzy in India and there's like six of them all around us. And I lived. I mean, this is shaping up to be a great day. What I'll take home from this shoot is just more evidence Time: 12:26 - 12:37 of the amazing animal that sharks are, but also the ability to point people in a specific direction to say, hey, your thoughts about them are a little overblown. Time: 12:39 - 12:47 This experience definitely changed my perception on sharks. I would say I respect them more after seeing their raw power up close, but at the same time there's less of that fear that comes from ignorance. On top of all that, I didn't Time: 12:47 - 12:59 die. Time: 13:09 - 13:10My class can smell and sense a pack of gum nearly a mile away...",
      "comments": [
        {
          "text": "Me: **feel a rock touch my feet and instantly panic**",
          "author": "Unknown",
          "likes": 26274,
          "timestamp": "Let’s just appreciate there’s no plastic in the water..."
        },
        {
          "text": "my worst comment is my most liked comment why",
          "author": "Unknown",
          "likes": 14577,
          "timestamp": "This is what school expects us to do for our science projects."
        },
        {
          "text": "when a seaweed touches my leg.",
          "author": "Unknown",
          "likes": 11618,
          "timestamp": "Mark: *casually swims with sharks*"
        },
        {
          "text": "Me: *dies when something touches my hand while washing dishes*",
          "author": "Unknown",
          "likes": 8345,
          "timestamp": "Sharks: *Start eating him*"
        },
        {
          "text": "Him: It’s just a social experiment!",
          "author": "Unknown",
          "likes": 6919,
          "timestamp": "Plot twist:"
        },
        {
          "text": "Sharks are paid actors",
          "author": "Unknown",
          "likes": 6418,
          "timestamp": "What I learned from this video:"
        },
        {
          "text": "sharks are damn cute.",
          "author": "Unknown",
          "likes": 5495,
          "timestamp": "Bruh, the sound-effects he used when pressing the button were definitely from minecraft"
        },
        {
          "text": "Shark movies: *heavy breathing*",
          "author": "Unknown",
          "likes": 4542,
          "timestamp": "\"sharks aren't interested in human blood\""
        },
        {
          "text": "Sounds like something a shark would say ...",
          "author": "Unknown",
          "likes": 4461,
          "timestamp": "Shark 1:Can we eat him"
        },
        {
          "text": "Shark 2:Shut up boy!who does it  on camera",
          "author": "Unknown",
          "likes": 4045,
          "timestamp": "Okay but I love how clear and pretty the water looks"
        },
        {
          "text": "Sharks: “lets not please 󰜯, we’re trying to be professional for the camera here “",
          "author": "Unknown",
          "likes": 3790,
          "timestamp": "I’m just curious if the results would be different if you were dealing with great whites or"
        },
        {
          "text": "bull sharks.",
          "author": "Unknown",
          "likes": 3720,
          "timestamp": "Sharks with human blood: no reaction"
        },
        {
          "text": "Sharks with camera: The hunt is on.",
          "author": "Unknown",
          "likes": 3531,
          "timestamp": "Shark infested water..."
        },
        {
          "text": "Shark: Bruh, I live here.",
          "author": "Unknown",
          "likes": 3456,
          "timestamp": "Im more concerned by the fact that sharks seemed to know there was no food on those"
        },
        {
          "text": "boards but kept following the boat",
          "author": "Unknown",
          "likes": 3401,
          "timestamp": "My class can smell a bag of takis from 20 miles away"
        },
        {
          "text": "It’s very  rare",
          "author": "Unknown",
          "likes": 3371,
          "timestamp": "Shark: Wants human blood"
        },
        {
          "text": "Mark: Gives cow blood\nShark: Am I a joke to you?\nWow thanks for the likes!",
          "author": "Unknown",
          "likes": 3361,
          "timestamp": "Next video: Do grizzly bears like being poked by sticks?"
        },
        {
          "text": "“I contacted my buddy who is a marine biologist shark expert”",
          "author": "Unknown",
          "likes": 3191,
          "timestamp": "Sharks: We don’t want blood. We want to eat camera."
        },
        {
          "text": "Mark:I am going to use my blood for sharks and also swimming with them",
          "author": "Unknown",
          "likes": 2948,
          "timestamp": "So the lesson of the day is... don’t bring cow blood with you while swimming."
        },
        {
          "text": "Mark: dude,  it's just an experiment BRAAH\nShark: oh my bad",
          "author": "Unknown",
          "likes": 2864,
          "timestamp": "This is why they attack surfers! They’re tired of the pranks."
        },
        {
          "text": "guys who sacrificed their blood for the experiment: are we a joke to you",
          "author": "Unknown",
          "likes": 2625,
          "timestamp": "I think sharks are also attracted to movement, like if you were bleeding and panicking"
        },
        {
          "text": "causing bubbles they’d be more attracted to the blood?",
          "author": "Unknown",
          "likes": 2616,
          "timestamp": "I feel that the boat heavily impacted this because the sharks always remained by the"
        },
        {
          "text": "boat",
          "author": "Unknown",
          "likes": 2608,
          "timestamp": "I feel like there is one variable you didn't account for. The boat. They seemed more"
        },
        {
          "text": "interested in the boat.",
          "author": "Unknown",
          "likes": 2602,
          "timestamp": "Mark: dips bloody limb in water"
        },
        {
          "text": "Sharks from a mile away: *Oh Hi Mark!*",
          "author": "Unknown",
          "likes": 2596,
          "timestamp": "Thanos can smell a glorified pebble from a mile away"
        },
        {
          "text": "This is why I’m subbed to you.",
          "author": "Unknown",
          "likes": 2503,
          "timestamp": "they're just casually petting sharks. meanwhile I cant even pet my chihuahua without"
        },
        {
          "text": "losing a finger",
          "author": "Unknown",
          "likes": 2431,
          "timestamp": "11:56"
        },
        {
          "text": "Shark: \"I'm gunna eat u\"\nMark: *spins body\nShark: \"Fair enough, have nice day.\"",
          "author": "Unknown",
          "likes": 2268,
          "timestamp": "Now repeat the experiment... with Great Whites and Tiger Sharks"
        },
        {
          "text": "Shark : *_I was Testing._*\nEdit : *I'm getting spammed in my notifications.*",
          "author": "Unknown",
          "likes": 2250,
          "timestamp": "title says : \"A Drop of Blood\""
        },
        {
          "text": "\"so yeah, we've dumped about 2 liters of blood into the sea. . .\"",
          "author": "Unknown",
          "likes": 2198,
          "timestamp": "\"We're gonna be putting a *DROP* of blood in the ocean\""
        },
        {
          "text": "(Pours half a human body's bood in the ocean)",
          "author": "Unknown",
          "likes": 2177,
          "timestamp": "*”and while he risked his life while putting the boards out, I prepared to push a button.”*"
        }
      ]
    },
    {
      "video_id": "video_8",
      "title": "Backyard Squirrel Maze 2.0- The Walnut Heist This is a bird feeder and everything you see surrounding me in my yard is an attempt to protect it from four thieving squirrels. If they want the birdseed and the lifetime supply of walnuts in this bank vault, they'll first need to pass through my nine part obstacle course. By design, it's extremely challenging. It's meant to test their mental limits and their physical limits. I held back no punches, but I have to admit in hindsight, I once again completely underestimated",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:24 my adversary. And truthfully, I never thought I'd be that crazy guy in the neighborhood obsessing over the squirrels. But they started it first when they would constantly pillage the birdseed from any bird theater I would put up about a year ago. That led to me defending it with an obstacle course which they handily defeated, and so after a year of ruminating on how to avenge that L with a majorly improved version, and then two months of planning, my buddy John and I got together for a twenty second build montage. Time: 00:24 - 00:50 Here are the basic Time: 01:11 - 01:12 elements. For starters, here's their favorite bird feeder at the end of the course, and it's sitting atop Fort Nuts, the most secure walnut vault in the Western United States. Now since birds can fly, they can come and go as they please and eat all the food they want. But the only way for the squirrels to make it right here is by surviving my nine part grueling obstacle course, which all starts right here. Climbing up this pool to this platform is the single gateway Time: 01:12 - 01:37 to enter the course. Every other pool you see has some kind of counter measure to keep the squirrel from just climbing up and then entering the course halfway through. And so the first challenge is this casino, which may seem like an odd choice until you realize that as we were building the course, we also built them some cozy little squirrel houses. So we put them up in a couple different trees and after a few days, it looked like they'd actually made some renovations. Time: 01:38 - 01:59 So I went to take a closer look. And sure enough, here's the before and here's the after. Even on the inside, they made some questionable decor updates. So while it might look like they were just using the houses to relax Time: 01:59 - 02:10 or stretch or look out the window Time: 02:10 - 02:12 or, like, Time: 02:12 - 02:13 wrestle, Time: 02:14 - 02:14 the satellite communications gear and the tactical mission planning and the mini vault to practice cracking a safe hold a completely different story. This gang of four high end professional birdseed thieves were secretly planning to pull off an honest to goodness Mission Impossible Time: 02:15 - 02:28 Ocean's 11 style mega walnut heist. Which is why I was gonna protect the birdseed and walnut vault with the most state of the art security measures just like the casino did in Ocean's 11. So once in the casino, you'll see the slot machine and the classic Vegas buffet, but with a warning. Take more than an ounce and you're gonna have to deal with security. Time: 02:28 - 02:45 Now that I got the squirrels on the run, they'll naturally want to jump to this bar, but there's a twist. Time: 02:47 - 02:52 Like it actually twists, which I think is gonna give them some problems. But if they can figure this out, they'll jump into this crate. And the good news is that it's filled to the brim with their favorite food which is walnuts. And I know this because I tested a bunch of different options, and they always went with the walnuts nuts first. But the bad news is that once you add a little weight to the system, Time: 02:53 - 03:10 the helicopter starts moving just like the helicopter for Mission Impossible. Oh, and we've got a baffle here at the top to stop a squirrel from just crawling along the wire from the fence. The helicopter stops next to this wall, which seems simple enough except that the bricks randomly move and adjust themselves in and out. And of course, at any time if they fall off, Time: 03:10 - 03:28 they gotta go back and start over the whole course from the beginning. After that, we come to their hideout. And this is when they'll switch from defense to offense because it's where they hang out and plan. You can see it's sort of messy with their tools and their blueprints on the wall that show if they open the floor on the elevator, the elevator shaft leads them underground and into the sewers. Then if they crawl through the sewers, it will take them right to the control center for a second room that might look familiar. And just like in Mission Impossible, their goal is to go up through the ceiling Time: 03:30 - 03:57 to access the air vents. But there's no way to make it up there unless they type the password into the keyboard in the control room next door like this. Time: 03:58 - 04:04 And at that point they can climb the ladder and they're in the vents. And the vents are a total maze. There's lots of different twists and turns they'll need to navigate up here. So at any moment, if they're too lost, they can always exit the whole course by using the one way squirrel emergency exits, which also exists for any enclosed room on the whole course. And for the penultimate challenge, it's back down from the air ducts through this laser maze where they'll have to harness their inner Catherine Zeta Jones. If they sufficiently touch any of the lasers, the metal base contacts and completes the circuit, which sends a signal from this microcontroller Time: 04:11 - 04:43 to a relay to a solenoid, which causes this pneumatic piston to fire which slams this door shut for one minute. And because I'm basically certain they'll try and get to this point by climbing from the roof on top of this tube, I've placed a shield here with another enforcement squirrel to try and deter them. And so finally, if they've made it through the laser bays and everything that came before it, they've made it to Fort Nuts. And as far as I'm concerned, if they crack the safe by giving this handle a little turn, Time: 04:44 - 05:08 they've earned every last walnut Time: 05:09 - 05:11 in this bank. Time: 05:11 - 05:12 After the course was set up, they could definitely smell the walnuts in the vault, and then you could see them sort of working things out from the fence line. And so after two months of prep work, it was time to test our extensive security measures against this formidable set of 500 gram rodents. Time: 05:13 - 05:27 And right out of the gate, we got him with the buffet. Time: 05:31 - 05:34 And as he sticks his entire face under the sneeze guard, absent mindedly reading the sign, you could see the exact moment he realizes Time: 05:35 - 05:42 he might have screwed Time: 05:43 - 05:44 up. And the slow mo shows Rick just really laying himself out. Oh, by the way, that's Rick. Time: 05:47 - 05:53 All four squirrels have names and more importantly, like any crew looking to pull off a heist, they all have specific roles to play. Starting with everyone's favorite, Fat Gus, who of course is the mastermind of this operation. On a heist, this is the role of the Frank Ocean or an Ethan Hunt. Now I just have to say, for those who aren't familiar, last year I named one of the squirrels Fat Gus because he loved to eat and was a little on the hefty side. But then halfway through, I noticed he had nipples, which it turns out means he was actually a girl and a pregnant one at that. So it's just a whole PR disaster and I switched the name to Time: 05:54 - 06:26 and rephrased a few other things. But to be honest, fantastic us just doesn't roll off the tongue like fat Gus. So I asked permission to use my preferred phrasing and as you can see, I got full consent. Next up is Rick. He's the acrobat, the grease man, the gutsy one. He's the go to for any task that is going to require some athletic abilities. And then we've got Marty. He's the hacker. Anything with computers or bank safes and he's your guy. But while he's really smart, he also scares pretty easy. And finally we've got Frank with logistics. A good heist starts with a good plan. He's got the whole course memorized and he's mapped it out and provided blueprints for the team. And so back to the course we've got Marty the hacker here, who again is a bit skittish so you can see he's coming in pretty cautious. But who can resist a buffet? Time: 06:27 - 07:11 Once again the real magic is found in the slow mo. Time: 07:13 - 07:16 Eventually they realized security was just too tight at this casino and Rick goes straight to the twist bar. Time: 07:22 - 07:27 Excellent. Time: 07:28 - 07:29 Here's try two. Time: 07:29 - 07:30 And with some motivation for the bird, he's like, I got this. I got this. I got this. Time: 07:37 - 07:42 I don't think I got this. Time: 07:43 - 07:44 The real time replay on this one is great, too. Time: 07:45 - 07:47 And at this point fat Gus is like, I'm gonna need that crate of walnuts. Let me show you how it's done. Which turns out somewhat Time: 07:49 - 07:56 predictably. Time: 07:57 - 07:57 Now really frustrated, acrobat daredevil Rick tries a totally different route. Time: 08:06 - 08:10 I gave this a 9.5, Time: 08:13 - 08:15 but sorry Rick, the Russian judge gave it a six. You gotta stick the landing. Logistics man Frank knows the wire connected to the fence leads to the helicopter crate, so he tries sneaking in the back door Time: 08:15 - 08:26 and is also forced to retreat. And finally, Marty the hacker realizes if you're just scared and you run real fast, Time: 08:27 - 08:33 the bar doesn't have time to spin on you. And you can see Rick just replicating the strategy. Time: 08:34 - 08:38 So after about two days, all of them could cruise through the first part of this course about this fast, and Fort Nuts was already feeling less and less secure. Time: 08:39 - 08:47 Fat Gus is like, wait, is this thing moving? Time: 08:48 - 08:50 I'm good. Time: 08:51 - 08:52 Here Rick hypothesizes if he doesn't sit in the crate it won't move. And here he rejects that hypothesis with a legendary leap. And that was a good time to remind ourselves that squirrels are one of the few mammals that can survive a fall from any height. Because as you can see here, they make their bodies super flat to increase drag, effectively becoming their own parachute. But just in case, you okay, Rick? Yep. Time: 08:52 - 09:15 All good. And Marty the hacker fraidy cat is just like, Time: 09:15 - 09:19 yeah, I'm Time: 09:20 - 09:21 super not down with this. Time: 09:22 - 09:23 Eventually, it's the fearless leader Fat Gus who demonstrates the ride is definitely worth it. Time: 09:24 - 09:29 And soon you've got Frank and the rest of the gang following suit. Time: 09:30 - 09:34 Which leads us to the wall of a thousand moving bricks. And first up you got fat Gus who kicks things right off with a pull of his parachute. Time: 09:35 - 09:43 And Rick Time: 09:45 - 09:45 just barely misses. Time: 09:47 - 09:48 Skittish Marty gets one taste of a moving brick and absolutely yeets himself into this tree. And while there were plenty of instances where a moving brick did dump the squirrels causing them to start over from the beginning, what was even better was Marty psyching himself out in the anticipation that a brick might move even though the wall wasn't powered on for any of these clips. Time: 09:49 - 10:08 And thanks in part to the dutiful supervision of fat Gus, Time: 10:13 - 10:16 eventually, like all the other challenges so far, they got it down to a science where they could cruise by the wall fairly quickly. Time: 10:16 - 10:22 And now's a good time to mention, the squirrels weren't the only ones attempting the course. This is Splinter the rat, and here he is with one of his buddies. He liked to make the rounds to all the houses each night, which sometimes were vacant and sometimes they weren't. There goes Frank to chase him off his lawn and you might have noticed the stuff in the house. The squirrels would gather nesting materials from various sources or somewhat what hilariously just steal from each other. Here's a bonus Santa Claus impression for all the fat Gus fans out there. So from Splinter and his buddies to not at all creepy possums, there's a surprisingly constant variety of wildlife that passes through a suburban backyard. Including a dumb dog who for some reason is much less interested in squirrels Time: 10:24 - 11:02 than he is my camera gear. Which is a lovely segue back to the squirrel hideout where the heist was really just picking up steam. Time: 11:02 - 11:09 And after hacker Marty had accessed the computer and lowered the ladder, Fat Gus followed behind and joined him in the vents. But in the process, a critical tool dropped down, which led to a lovely recreation Time: 12:10 - 12:20 of an iconic scene. Time: 12:20 - 12:22 And And as a side note, they figured out the exit door pretty quickly and they functioned as a one way door exactly as intended. Time: 12:37 - 12:43 And now with the vents, it was Frank's time to shine. You can see here, he's just double checking the actual air duct layouts to make sure they match the blueprints he's memorized. And once he's satisfied, he steps up and as you can see, he nails it first try. You can just sense his confidence here. Time: 12:43 - 12:59 Contrast that with Marty who's like, alright. I think it was a right Time: 13:02 - 13:05 no, it's straight. Time: 13:06 - 13:07 Oh, was it left? Time: 13:08 - 13:09 Crap. I gotta go check the map again. And as a result, most of his runs would end up looking something like this. Time: 13:09 - 13:16 So here's Frank coaching him from the outside and you can see Marty's a little defensive about it. Time: 13:17 - 13:22 So Frank cops in so they can work out their differences Time: 13:24 - 13:26 and then with a little encouragement, Time: 13:28 - 13:30 he gets him going down the right way. All the while fat Gus continues to supervise. Time: 13:30 - 13:34 Focus, Marty. Time: 13:36 - 13:37 There you go. Time: 13:37 - 13:38 Which brings us to the laser maze. Time: 13:40 - 13:43 Here's acrobat Rick's first approach and he's like, Time: 13:44 - 13:47 yeah, that's sus. And just as expected, he climbs on top of the tube, and he's like, yeah, I totally got this. Time: 13:47 - 13:54 When in fact, Time: 13:55 - 13:56 he didn't have it. In real time, it happens so fast, it just looks like chaos. Time: 13:57 - 14:02 But if we slow down this second attempt, we can remind ourselves of how squirrels have mastered the laws of physics to always land on their feet. Did you catch it? Time: 14:03 - 14:11 The first is the locking of the head on a landing target in less than 300 Time: 14:12 - 14:16 If you go back and watch any jump from this video, Time: 14:16 - 14:19 that locking of their head is the first thing they always do. And the second is using conservation of angular momentum like an ice skater to pull their arms and legs in and out at the right times to rotate fast and then hold in the right then hold in the right orientation. Time: 14:19 - 14:31 Combine those two tricks with the flat body parachute and extending their legs at the last minute to absorb the shock and they are perfectly adapted for living high in the trees. In fact, squirrels have been around for over thirty million years and they've had to evolve relatively little in all that time. So then Rick's like, fine. I'll use the stupid tube like a normal squirrel. Time: 14:32 - 14:49 What is this? See, I knew this was sus. Time: 14:50 - 14:53 And here's Frank who just watched what happened and therefore is appropriately cautious. Time: 14:56 - 15:01 But he hops right back on the saddle, and this time he nails it. And in the end, it feels appropriate Time: 15:06 - 15:12 that the mastermind, Time: 15:12 - 15:13 Fat Gus, was the first one to make it successfully through the laser maze and then to subsequently make it to Fort Nuts. I mean, how fat Gus is this? Falling not just for one decoy nut, Time: 15:14 - 15:24 but for both of them. Which paves the way for Marty the hacker to be the one to crack the safe, and as you can see here, he's pretty stoked about it. Time: 15:25 - 15:34 At first, he just checks it out. Like, yep. Mhmm. Yep. Yep. This is just like the schematic showed. Time: 15:40 - 15:45 And then, Time: 15:46 - 15:46 the big moment. Time: 15:47 - 15:48 Once the safe open these cargo nets unfurl which just allowed better access to their loot. But interestingly more often than not after getting a walnut instead of jumping off, they would go all the way back through the course. Here's jumpy Marty exhibiting some real PTSD, even though I'd already turned off the whole system. So once again, the squirrels took the w, but as far as I'm concerned, they earned it. And I can't complain with how things turned out because Rick buried all his extra nuts in the yard, Marty and Frank made up and rekindled their friendship, and Fat Gus got some long sought quality time with the bird feeder. So everyone was happy. Time: 16:02 - 16:33 Well, almost everyone. Time: 16:34 - 16:35Mark is the only dude on youtube who would spend a year building a better maze for his squirrels",
      "comments": [
        {
          "text": "https://Monthly.com/MarkRober.  Being able to design and make stuff is a superpower\nthat can be learned and that more people should have!",
          "author": "Unknown",
          "likes": 43767,
          "timestamp": "Expecting Phat Gus to sprout wings and just fly to Fort Knuts."
        },
        {
          "text": "insane.",
          "author": "Unknown",
          "likes": 13078,
          "timestamp": "I never thought I would be this excited for a YouTube video sequel… But here I am giddy"
        },
        {
          "text": "with anticipation",
          "author": "Unknown",
          "likes": 12905,
          "timestamp": "Mark's neighborhood squirrels are so lucky."
        },
        {
          "text": "is incredible to me",
          "author": "Unknown",
          "likes": 10128,
          "timestamp": "Anyone else kinda blown by the fact it’s been A YEAR since the last one, literally feels"
        },
        {
          "text": "like yesterday",
          "author": "Unknown",
          "likes": 9910,
          "timestamp": "I know where I'm heading if ever turned into a squirrel"
        },
        {
          "text": "overcome the spinning bar, hacked the computers to drop the ladder, and conquered the\nlaser box to open the vault. What a story arc.",
          "author": "Unknown",
          "likes": 4202,
          "timestamp": "THIS IS SO COOL! This is like all of my childhood dreams, incredible."
        },
        {
          "text": "instead of just giving up",
          "author": "Unknown",
          "likes": 2469,
          "timestamp": "Yo Frank actually mapped out that air vent maze and memorized it well enough to go"
        },
        {
          "text": "through it first try 😂",
          "author": "Unknown",
          "likes": 2467,
          "timestamp": "This was extremely creative felt like I was watching a dream"
        },
        {
          "text": "challenge!",
          "author": "Unknown",
          "likes": 1988,
          "timestamp": "As a biologist I found the behavior of the squirrels absolutely fascinating.  As a human it"
        },
        {
          "text": "was hilarious",
          "author": "Unknown",
          "likes": 1977,
          "timestamp": "Breaking news: Squirrels rob a local bank after being trained by an ex-NASA engineer."
        },
        {
          "text": "Mark Rober: “yeah, I’ve been training them with a special obstacle course”",
          "author": "Unknown",
          "likes": 1896,
          "timestamp": "Can we just take a moment to notice how smart these squirrels are? And the fact that,"
        },
        {
          "text": "even a year after, the squirrel squad is still in band?",
          "author": "Unknown",
          "likes": 1851,
          "timestamp": "I wonder if Mark does this for several decades, if the later generations of squirrels will"
        },
        {
          "text": "become hyper adaptive and expert parkour masters over years of obstacle course based\nunnatural selection?",
          "author": "Unknown",
          "likes": 1785,
          "timestamp": "I have to motivate myself just to get off the couch and get a snack 😂"
        },
        {
          "text": "your way of thinking and are undaunted by any challenge.",
          "author": "Unknown",
          "likes": 1590,
          "timestamp": "I'm seriously surprised by those squirrels. I thought they would get confused and give up"
        },
        {
          "text": "with the maze after the first couple obstacles...",
          "author": "Unknown",
          "likes": 1587,
          "timestamp": "Honestly I'm sure some biologists would love to study the learning process of these"
        },
        {
          "text": "squirrels",
          "author": "Unknown",
          "likes": 1503,
          "timestamp": "You seriously have the coolest squirrels around your house. 🐿 🐿🐿  🐿 Phat Gus is"
        },
        {
          "text": "also my favorite.",
          "author": "Unknown",
          "likes": 1498,
          "timestamp": "iDubbbz been real quiet since this dropped"
        },
        {
          "text": "more.",
          "author": "Unknown",
          "likes": 1450,
          "timestamp": "THIS is the content we’re all here for. On that note, we now need a Phat Gus line of"
        },
        {
          "text": "merch.",
          "author": "Unknown",
          "likes": 1428,
          "timestamp": "It’s insane how intelligent they are but watching Marty get ptsd from accidently hitting the"
        },
        {
          "text": "laser again and the wall not even being on is hilarious 😭",
          "author": "Unknown",
          "likes": 1399,
          "timestamp": "Imagine walking up to a pregnant person with a big sign that says \"Can I call you Phat?\""
        },
        {
          "text": "and then holding out a piece of cake with \"yes\" written on it and an empty plate with \"no\"",
          "author": "Unknown",
          "likes": 1395,
          "timestamp": "Anyone else kinda blown by the fact it’s been A YEAR since the last one, literally feels"
        },
        {
          "text": "like yesterday",
          "author": "Unknown",
          "likes": 1317,
          "timestamp": "I love that a famous former Nasa engineer dedicates part of his life to build squirrel"
        },
        {
          "text": "parkour courses. (Thanks Mark)",
          "author": "Unknown",
          "likes": 1285,
          "timestamp": "Mark: genius! The video, the commentary, the design, the humour, the squirrels, the"
        },
        {
          "text": "maze, the engineering, the creativity! Fantastic job!",
          "author": "Unknown",
          "likes": 1262,
          "timestamp": "ok that \"Wrestling\" took me off guard"
        },
        {
          "text": "squirrel course.",
          "author": "Unknown",
          "likes": 1250,
          "timestamp": "The fact that the squirrels were not only expecting the brick to fall back, but also were"
        },
        {
          "text": "preparing for it! This amazes me. Squirrels are so intelligent",
          "author": "Unknown",
          "likes": 1236,
          "timestamp": "Mark rober is like a science teacher that understands the students sense of humor"
        },
        {
          "text": "mazes that they be able to get into his house 😂",
          "author": "Unknown",
          "likes": 1213,
          "timestamp": "At some point, the squirrels in his yard are going to evolve and become so intelligent that"
        },
        {
          "text": "they make a heist tips and tricks youtube channel",
          "author": "Unknown",
          "likes": 1180,
          "timestamp": "Basically, Mark is just making his own cinematic universe in his backyard"
        },
        {
          "text": "they understood the trap well enough to expect it. Same with the bricks to a lesser\nextent.",
          "author": "Unknown",
          "likes": 1037,
          "timestamp": "The commentary, the effort, the creation, the innovation, the freaking art is all just on"
        }
      ]
    },
    {
      "video_id": "video_9",
      "title": "Carnival Scam Science (and how to WIN) 11 feet.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:04 - 00:05 11 feet. Time: 00:07 - 00:08 It's no secret that carnivals exist to make money. And to do that most effectively, Time: 00:09 - 00:12 they employ a bunch of little tricks to make you overestimate Time: 00:13 - 00:16 your chances of winning. In some cases to such an extent that it's basically a scam. So I spent a couple days coming down to this amusement park and observing and collecting data on all of the carnival games. So today, I'm gonna tell you which games are the biggest ripoffs and the scientific reasons of why. I even answered how much the carnival actually pays for the prizes that people can win. But there is hope because I'll also show you some legitimate tricks on how to win the most popular games, along with what happens when you show up to the carnival with your professional baseball playing buddy who happens to play for the New York Mets. Time: 00:17 - 00:46 Let's get started. Time: 00:52 - 00:53 Any kind of a legitimate investigation needs to start with solid data as the foundation. So with the promise of unlimited churros, I had some friends secretly help me collect data on all 24 carnival games for a full day. Not only we capture how many times each game was played, but we also recorded how many times people actually won each game and the prize they won. And so the first observation based on the data we collected is that this relatively small park collects $20,000 Time: 01:05 - 01:31 a day off their carnival games alone. So to help frame the rest of the observations, we'll divide the games into three groups. The first group, you've got the random chance games. Games like these where no skill is involved and you're basically just rolling dice. And for the second group, you have your skill based games like the basketball shot, or the milk bottle throw, or the basket toss game, where if you bring some kind of skill or strategy to the table, you can increase your chances of winning. And the final category are the games that are pretty much impossible. These ones are borderline scams. There are three games in this category that lots of people attempted and nobody won. And if they did win, like in the case of the ladder climb, it was for a very specific reason, which I will address later. So let's start by talking about the random chance games. Calculating your chance of winning here is pretty straightforward. You just divide the winning outcomes by the total outcomes, and you get a percentage. So in this case, there are about 1,600 total cups, and 160 Time: 01:31 - 02:23 winning cups. So that's a 10% chance, or one in 10 throws will win. There are a ton of games similar to this, but the catch is they always use balls that are lightweight and have a high coefficient of restitution, meaning they bounce really well off things. This makes it much less likely the ball will end up where you originally aimed it. To illustrate this point, think how much easier this game would be with fiend bags, which are heavier and don't bounce. With a ping pong ball however, any imperfection in the aim of your original throw is magnified, which essentially randomizes things. If you have no skills, these are the games that you want to play. But don't get too excited because even when you you win, you lose. After some investigative work, I uncovered the source where they ordered their prizes from. And so even if you got lucky and won on your first throw, it would cost you a dollar 50 for a prize that cost them 45¢. Time: 02:23 - 03:11 But you usually don't get it on your first try, so treating this as an expected value problem in statistics, it would take you an average of five times to land it in a yellow cup, which means you pay $7.50 Time: 03:11 - 03:21 for something that cost them 45¢. Time: 03:21 - 03:24 In the case of the big prize, by landing it in the super rare gold cup, it's even worse. It would take you an average of 25 tries, which works out to $38 Time: 03:24 - 03:33 for something that cost them $6. Time: 03:33 - 03:35 And I'll add, the number of people we observed winning matched up pretty well with these statistical predictions. Now let's talk about the second group, which are the skill based games. And one of the most popular in this category is the basketball toss, with 825 Time: 03:35 - 03:47 plays the day that we observed. Now a standard three pointer is 24 feet back on a rim that is 10 feet off the ground. But in this case, the line is 28 feet back on a rim that is 11 feet off the ground. Which is subtle, but if you have a deadly three pointer locked into your muscle memory, you will tend to miss short, which is exactly what we saw a bunch. The reason they have the big slope tarp in front is so that someone can't stand directly underneath the rim where the height difference would be much more apparent. And here again, even if you go Steph Curry and drain your first three dollar shot, you still lose because they only paid 80¢ for that basketball. Here's another example of getting you to overestimate your chances of winning by making subtle changes because the table is slanted up slightly, which will reduce the horizontal velocity of the ball after the bounce. So even if you dominated this game all through college, your previous experience almost becomes a handicap. Time: 03:47 - 04:34 This measure your pitch speed game is borderline fraudulent as their radar gun registers about 15 miles an hour too slow. And I know this because I measure the distance and then recorded in high speed and counted the frames. This pitch was clocked at 69 miles per hour, but it's much closer to 84. For the milk bottle game, the only catch here is the bottles are metal and therefore heavier and more stable and harder to knock down than a typical bottle of that size. I've seen some carnivals though where these are bottom weighted which would make them more steady and thus less likely to tip. To figure out which kind you have you can ask to hold it and the point at which it balances on your finger is the center of mass. The key to winning this game is hitting them right Time: 04:35 - 05:09 here with a hard enough throw to introduce sufficient kinetic energy. But don't throw it too hard because we notice those who threw their hardest usually sacrificed on accuracy. About one in fourteen people knock this over on their first try. And then finally, we have the basket toss game. And the key here is to have your first bounce hit on this front lip to reduce the kinetic energy enough that it won't bounce back out. About one in 10 throws will win on this game according to our observations. And now this brings us to the final category of the near impossible games, and there are three of them. On this first one, the goal is to shoot out this red star completely with this automatic BB gun. So the best strategy is to basically shoot a circle around the star to cut it out. Not only are the guns not accurate or precise, but the bigger issue is that you start out doing really well because there's enough surrounding paper for the BB to easily rip through like this. But Newton's third law tells us that paper for the BB to easily rip through like this. But Newton's third law tells us that you can only push on something as hard as it can resist your push. So at the end, you have these barely supported pieces of the star that just move out of the way when the BB comes without building up enough stress to rip the paper. Out of 120 Time: 05:10 - 06:11 plays, we saw nobody win this game all day. This ring bottle game is also impossibly difficult. Again, it's a lightweight object that's really bouncy to encourage randomness, but the actual inner diameter of the ring is really close to the outer diameter of the bottle. This means that any throw besides this pretty much perfect one will send the ring bouncing away without settling in on the bottle. If you really want this bear, I suggest going on Amazon and getting it for $47. Time: 06:11 - 06:37 I literally can't tell you how much money this will save you because of the 840 rings we saw thrown, none stayed on the bottom. Which brings up sort of an obvious rule of thumb. If you want the feeling of winning a game, do not stop at any booth that offers really big prizes. And for the final near impossible game, let me reiterate that as a carnival owner, the most lucrative games are those which the customers overestimate their chances of success. No game is a better example of that than the ladder client. There's a subtle issue with this game that I think people realize, but don't internalize the significance. The ladder converges to be supported on the wall at one point instead of two. If it was attached at two points, it's like crawling across a rope bridge, which is pretty easy. Let's pretend this is you, and if you shrunk all the weight of your body down to the average location, we call that spot the center of mass, which we'll mark with this dot. And once again, we can double check this is the right spot because it balances perfectly on one finger. If you draw imaginary lines connecting the different support points, that creates an area. And as long as your center of mass dot is within that area, it's impossible to fall off. But as soon as your center of mass dot is even a little bit outside of the area of supports, you start to rotate and fall off. And this is true no matter which way you orient it. If you've ever bent over to pick something up, you actually know this fact whether you realize it or not. In this case, the region of support is between the back of your heels and the tips of your toes. When you reach over, you will naturally move your butt back to keep your center of mass in between those support points. If you don't believe me, try picking something up while standing against the wall so you can't move your butt back. At the very moment your center of mass gets beyond your toes, you start to tip over. In the case the ladder game, you're only connected at one point. So even though it looks wide because the ladder runs, that area of support reduces down to a line. So if you don't keep your center of mass directly above that line, you will start to rotate and fall off. In other words, to win this game, you basically need to be able to crawl across a tight rope. And you might think, well I can do a slack line so I can do this. But a slack line is actually much easier for two reasons. You can flail your arms and legs out to adjust your center of mass to keep it directly above that line of support. And your center of mass is higher increasing your mass moment of inertia making you more stable. In the same way it's easier to balance this umbrella when it's extended versus when it's collapsed. Time: 06:37 - 08:49 So while there are a few videos that say tricks like maintain three points of contact, they're all basically useless. Because keeping your center of mass directly above a line is just something you have to get a feel for that takes a lot of practice. But once you've had enough practice, this is the one game at the carnival that's basically all skill. So you can win every time and clean them out. Unfortunately, the carnival owners know this, which is why it's also the only game with this super lame caveat. So So now that we were carnival experts, I called in my buddy Matt Winaker, who was recently just drafted to play baseball for the New York Mets to maximize their chances of winning any skill game that had to do with throwing. Time: 08:50 - 09:24 So clearly, Matt had a deadly lock on any throwing game. But basketball is more my game. So to finish off the day, I decided I would bring his ego back into check. But as it turns out, if you are a world class athlete in one sport, you are a really really good athlete in all sports. So in conclusion, you should play the games if you think they're fun. Just know the odds are heavily stacked against you, so if you lose, it's NBD. Unlike this guy who lost his entire life savings playing carnival games. And if your motivation Time: 09:44 - 10:11Years ago I was an extra in a commercial playing carnival games. We threw hundreds of rings that day and not a single person landed one on a bottle neck....",
      "comments": [
        {
          "text": "couldn’t win until a month later lol",
          "author": "Unknown",
          "likes": 23198,
          "timestamp": "*Carnivals Hate Him!*"
        },
        {
          "text": "Aim for the carnie's head, grab a prize while they're down.",
          "author": "Unknown",
          "likes": 15826,
          "timestamp": "So a scientist and a professional baseball player walk into a carnival...."
        },
        {
          "text": "Phat Gus: ...hold my walnut",
          "author": "Unknown",
          "likes": 11417,
          "timestamp": "Alright, this is my online school for today."
        },
        {
          "text": "Wife: why\nI'm dying 😂😂😂",
          "author": "Unknown",
          "likes": 7809,
          "timestamp": "\"i just bought this for you mahlady\""
        },
        {
          "text": "*awkward silence*\n\"why?\"\nsuch a real life representation",
          "author": "Unknown",
          "likes": 6906,
          "timestamp": "This is basically a math and science lesson taught in an interesting and relatable way to"
        },
        {
          "text": "understand. I swear i learn more on YouTube by choice than school by force",
          "author": "Unknown",
          "likes": 6278,
          "timestamp": "My best trick is to not even play carnival games."
        },
        {
          "text": "Just ride the roller coasters",
          "author": "Unknown",
          "likes": 5543,
          "timestamp": "Let's be real, the only time you play carnival games are for one of 3 reasons:"
        },
        {
          "text": "1. You're a kid/have a kid\n2. Testosterone with friends\n3. A girl's with you",
          "author": "Unknown",
          "likes": 5246,
          "timestamp": "“if you have no skills, these are the games for you”"
        },
        {
          "text": "WOOOOOOOOOOO ITS SHOWTIMEEEEEE",
          "author": "Unknown",
          "likes": 5149,
          "timestamp": "Loved the end..."
        },
        {
          "text": "“I bought this for you.”\n“Why?”",
          "author": "Unknown",
          "likes": 4980,
          "timestamp": "So refreshing to find a channel that is dedicated, hard working, and well put together."
        },
        {
          "text": "Not just screaming into a lense.",
          "author": "Unknown",
          "likes": 4777,
          "timestamp": "*Mark Rober:*  a scientist and a professional baseball player"
        },
        {
          "text": "*MrBeast:* a lot of money and a bunch of crack heads\nEdit : I can't believe that so many people can't take a joke. I'm a fan of both YouTube\nchannels, crack heads isn't ment as an insult, if you don't call yourself and your friends\ncrackheads then I'm sorry that you guys are boring. Now shut up and let people enjoy\nthe joke",
          "author": "Unknown",
          "likes": 4627,
          "timestamp": "Mark rober: Any professional athlete that's amazing in one sport is really good at any"
        },
        {
          "text": "other sport\nMe: laughs in chess",
          "author": "Unknown",
          "likes": 4124,
          "timestamp": "Science dawg."
        },
        {
          "text": "games. They had a weighted baseball that flew like a knuckleball, and you had to break\nplexiglass bottles. I didn't tell them before hand I was a pitcher who threw an amazing\nknuckleball. Needless to say after I missed my first throw and realized the pattern, things\ndidn't go the way the carnie expected. I still have my 6 foot tall penguin to this day.",
          "author": "Unknown",
          "likes": 4074,
          "timestamp": "*Carnival manager wants to know your location.*"
        },
        {
          "text": "armfuls of those giant prizes or push them in a cart or something to make everybody\nelse believe that it is possible to win those things on a regular basis.",
          "author": "Unknown",
          "likes": 3989,
          "timestamp": "Mom: what are you watching?"
        },
        {
          "text": "Me: science and math",
          "author": "Unknown",
          "likes": 3879,
          "timestamp": "Having the speed gun under clocked isn't \"borderline fraudulent\". It's straight up"
        },
        {
          "text": "fraudulent and hopefully they get sued over it",
          "author": "Unknown",
          "likes": 3872,
          "timestamp": "Ok so,"
        },
        {
          "text": "When i go to a carnival, bring a pitcher from the mlb\nNoted",
          "author": "Unknown",
          "likes": 3757,
          "timestamp": "How to win giant prizes:"
        },
        {
          "text": "1. Bring a long stick with a hook\n2. Get the toy\n3. Naruto run as fast as you can out of the carnival( with your new toy/toys of course )",
          "author": "Unknown",
          "likes": 3749,
          "timestamp": "As a mechanical engineer who spent years studying these concepts, I’ve understood"
        },
        {
          "text": "them now even more thanks to these videos. Thank you Mark",
          "author": "Unknown",
          "likes": 3647,
          "timestamp": "Mark: “i just bought this for you M’lady”"
        },
        {
          "text": "M’lady: awhs slightly “w h y ?”\nMark: u n i m p r e s s e d",
          "author": "Unknown",
          "likes": 3270,
          "timestamp": "My son was actually able to get up that ladder when he was 5 and he still has the huge"
        },
        {
          "text": "bear that he won for it and still sleeps with it (he’s 7 now).",
          "author": "Unknown",
          "likes": 3127,
          "timestamp": "\"I just bought this for you m'lady.\""
        },
        {
          "text": "\"... Why?\"\nOof",
          "author": "Unknown",
          "likes": 3115,
          "timestamp": "“I just bought this for you my lady”"
        },
        {
          "text": "“Why”\n😂😂",
          "author": "Unknown",
          "likes": 3090,
          "timestamp": "Mark: Let me just film random people failing"
        },
        {
          "text": "the smell, and there’s something nostalgic about being at a fair or carnival with someone\nyou love being with. Can’t beat it. It’s very romantic.",
          "author": "Unknown",
          "likes": 2983,
          "timestamp": "And the conclusion is I am so marrying a baseball player so he can win me carnival"
        },
        {
          "text": "stuffed animals.",
          "author": "Unknown",
          "likes": 2967,
          "timestamp": "Lol your wife’s reaction was great!  Thanks for explaining this so thoroughly. I knew they"
        },
        {
          "text": "were scams but this tells exactly why.",
          "author": "Unknown",
          "likes": 2811,
          "timestamp": "He says don’t believe me try it    HE WORKED FOR NASA OF COURSE I BELIEVE"
        },
        {
          "text": "Mark rober: I’m bout to end this mans whole career",
          "author": "Unknown",
          "likes": 2615,
          "timestamp": "This guy is gonna be the reason why they go bankrupt"
        },
        {
          "text": "and manipulate you",
          "author": "Unknown",
          "likes": 2469,
          "timestamp": "I'm surprised that one guy helped him measure the distance lol"
        },
        {
          "text": "*_\"W-why?\"_*",
          "author": "Unknown",
          "likes": 2354,
          "timestamp": "I saw an 8 year old girl literally just walk across the rope staying in the center at Six"
        },
        {
          "text": "Flags to win.",
          "author": "Unknown",
          "likes": 2318,
          "timestamp": "The odds are never in your favour."
        }
      ]
    },
    {
      "video_id": "video_10",
      "title": "Beating 5 Scam Arcade Games with Science This is me entering an arcade wearing just your normal everyday backpack. Only, technically, it's not your normal everyday backpack because when I set it here and then nonchalantly load a few balls into the water bottle, it plays the game like a good robot should, and I win all the tickets. And that's pretty cool. But what if I told you I made similar backpacks not just for Skee Ball, but for this game and this one? Basically, coming up with contraptions to absolutely dominate five of the most common arcade games, including some hacks that cost less than a dollar and actually work to set world record ticket payouts. But we also secretly recorded data from a bunch of different arcades. So I'll teach you the strategies to beat the games that give out the most tickets, along with showing you the five games we discovered are actual scams. Don't ever step foot in another arcade again until you've watched this video in its entirety.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:48 Let's get started. Time: 00:48 - 00:49 Now, admittedly, the genesis for this video came when I was using my over engineered bowling ball that I could control just by leaning. Because I thought, what if I took that same concept and applied it to mini golf? And while that idea could be really useful for getting a good golf score, Time: 00:55 - 01:08 there's just no real payoff for my efforts, Time: 01:11 - 01:14 which focused my attention to the holy grail of any mini golf course, the arcade. It was time to recoup all the allowance money I've lost as a kid starting first with Skee Ball. And before we really see it in action, let me first explain how it works. Because if you take away the backpack, you'll find a Frankenstein Time: 01:15 - 01:31 version of a softball pitching machine that we chopped up and modified so it runs just off batteries. Then there's a solenoid here that makes sure the ski balls get released one at a time. So if you just turn it on, then we put a ball in here, Time: 01:31 - 01:43 it fires the ball like this. The coolest part here though is when it's placed in the backpack, you roll this pocket up to reveal the ball exit and then place this water bottle here as a clever disguise to load up to three balls at a time. Now of course, if you don't have a secret robot backpack, here's how you win this game as a mere human. For starters, if you watch the pros play, yes, there are Skee Ball pros, they actually aim for the 4,000 Time: 01:43 - 02:06 hole. This actually makes sense because even if your throw is a little too weak or a little too strong, you're still getting significant points. A common mistake is to take the bait and go all or nothing by aiming for the small 10,000 Time: 02:06 - 02:19 hole in the corner. The pros aim for this only in desperate situations where they're behind and they need big points to make a comeback for the win. The other big tip is to brace your leg against the base of the machine in the same spot each time. And then try and only move your arm, which will make your throws more repeatable and accurate because you're reducing the variables that could lead to air. So if you wanna win, just follow these tips and practice a bunch. Or you can just go with my route. Time: 02:19 - 02:43 So then when you're all done dominating or if you think one of the workers might be getting suspicious, you can just pick up the backpack at any point and walk away with a bunch of tickets on your card. Up next is one of my personal favorites, Time: 02:52 - 03:03 basketball. In this case, the backpack is being used just to smuggle the special mechanism inside. Because of the untrained eye, this is just a normal basketball when in fact, Time: 03:03 - 03:12 it's a robot in disguise. Now before I show you exactly how it works, you first need to understand how these games work. Just underneath each rim is an infrared laser and a detector. And then on the front of the rim, on the other side of that metal plate is a reflector. So when the laser beam shines straight forward, it bounces off the reflector and then the sensors like, yep, I can see the beam. So when a ball goes through the hoop, it breaks the beam and the sensors like, Time: 03:13 - 03:36 I didn't see it for a second. At which point it tells the game to add two points to your total because that means you must have scored. In engineering, we call this a beam break detector, and it's the exact same concept you have as a safety feature on your garage door. So if you really wanna destroy the high score here, the ball needs to break the beam, then somehow get out of the way so the beam reconnects, and then come back and break the beam again over and over again as fast as possible. But if you think about it, the whole ball doesn't need to actually get out of the way, just the part in front of the beam itself. And how might you do that? Well, one way is to three d print the bottom hemisphere of a basketball in two parts attached together through some linear guide rods, then add a battery, microcontroller, and servo motors so the bottom part of the shell can translate up and down. This way it would reconnect the beam and then break it over and over again and register two points every time that happened. Now you just need a way to grab the rim so you can hang out there while you perform these shenanigans. And if you have some pneumatic pistons connected to a mini pressure intake controlled by a solenoid valve triggered by an RF remote, then you could shoot the ball normally and then with one push of a button, piston rods would shoot out and grab the rim. And then once mischief was managed, you trigger the remote again and they would retract. Now if you just add another three d printed hemisphere on top, then glue on the actual basketball skin, and when you put it all together, it would look something like this. Now if you don't happen to have a robo ball, here's a few tips that will help you get the high score for this game. Now the most important thing is you never wanna waste time waiting for a ball to roll down to you. And since these games normally come in pairs, just swipe your card on both games and then temporarily borrow the second set of balls. Now this should give you plenty more than you need, so just keep the balls that are the least inflated. Now you start the game and get into a rhythm where you finish your shot with one hand and then start grabbing and replacing the ball with your other hand before your first shot has even gone in. Or if the rim is close and you wanna get really extreme, you can just go with a two handed shooting strategy like this guy. But even that strategy is no match for my spherical transformer because when I'm ready to go, I just shoot the ball with one hand and then hit the remote right as it's about to go in. Time: 03:36 - 05:30 And now as the ball just sits there articulating, remote Time: 05:31 - 05:34 again and the mode again and the piston rods are tracked. And while no one's the wiser, I've now engineered my way to a buttload of tickets and a new lifetime high score. Next up is a really popular game called quick drop where you hit this button to release these ping pong balls at the right moment. And if you get all 50 ping pong balls into the buckets within the twenty two seconds allotted without missing any shots, then you hit the mega jackpot. But the thing is, to get all 50 balls in before the time runs out, there's essentially no margin for human error, which is good news for me because robot backpacks Time: 05:48 - 06:18 don't make human errors. Now you notice when I walk up, I can just set the backpack down and it self registers right in place. The trick here is we three d printed an exact negative replica of the button housing on the game. And this piston rod that pokes through and pushes the button on the game is attached to the solenoid that's controlled by this arduino microcontroller Time: 06:19 - 06:37 and it tells it the exact timing needed to beat the game. Now if you're trying this on your own, here's what you need to know. To successfully do this in twenty two seconds, you have to drop four balls in each bucket, except in two buckets, you've gotta drop five. Now, dropping five into these two buckets isn't impossible, but the timing's so tight, it's really hard to pull off without them hitting the rim and bouncing out. Now, the jackpot starts at 500 tickets, and every time someone loses, it goes up by two tickets. And each time that happens, the game gives you just a little more total time on the clock. And so if you ever see the jackpot at more than 625 Time: 06:37 - 07:11 tickets, enough time is now on the clock where you only need four balls per bucket to win, and it's definitely worth trying it a few times because that makes it so much easier to pull off. Alternatively, if you're too impatient to wait for the jackpot to rise up, you can just go to school for six years to get a degree in mechanical engineering and do it this way. Time: 07:11 - 07:27 And then even as all 554 Time: 07:36 - 07:38 sweet delicious tickets are being added to your account, you can just inconspicuously Time: 07:38 - 07:42 walk away with your backpack in tow. Time: 07:42 - 07:44 For our next game, we've got the perennial arcade favorite, air hockey. Now this is the most complicated of all the builds because if you look closely here at the top, there's a hole in the bag for a camera to look out through. Then stripping away the backpack, you could see that camera connects to the brains, and in this case, it's a raspberry pi, which is basically like a mini computer instead of just an Arduino microcontroller Time: 07:47 - 08:06 like all the other builds have used so far. The reason this one needs a bit more brain power is because it uses computer vision to track the puck, and based off the trajectory, it makes a prediction, then sends instructions to rotate this servo, which is attached to an arm that moves the paddle and protects the goal. Nice. And perhaps my favorite part of this build is that it obviously won't work if the whole thing thing is sliding and moving all around. So we need to anchor it down securely into position, but we need to do that quickly and discreetly. Our solution here is a pair of neodymium toggle magnets. So if you simply turn both of these knobs, the rare earth magnets move into position and anchor it to the steel frame of the air hockey table, and it's basically cemented in place as you can see here. As for the human strategy here, playing air hockey might seem like total chaos, but there are four simple tricks that will pretty much guarantee you can beat any casual player. The first is to hold the paddle like this and not like this. Doing that allows you to really whip the paddle around and gain extra speed on your shots. The second is that for your default defensive position, you want your paddle to be out here, not right up against the goal right here. That's because this cuts down the angle, and you only have to move the paddle back and forth this far to protect the whole goal versus back and forth this far if you're against the edge. This is the same reason goalies will come out of the goal if there's a breakaway in soccer. Even for a bang shot, you now just have to move the paddle a small distance diagonally back like this. So your paddle should essentially always stay inside a triangle like this when you're playing defense. Now when you watch professionals play, yes, there are air hockey professionals, you will see them employ both these first two tips. The third trick you'll also see is they try and play for possession. You wanna try and cushion your opponent's shot and gain possession of the puck so you could set up your own shot, which leads to the last tip. Mix up the straight shots and big shots, but try and practice at least one trick shot like this one where you hit the puck down into the corner and then when it rebounds back to you, you hit the bank shot for the win. Here's what that looks like in action. Now the real benefit of my backpack system is you can be playing your opponent, but then when you get a phone call or you have to attend to some other important manners, your goal is in safe hands. Time: 08:06 - 10:05 And then at your own leisure, you can eventually just come back and finish things off. Then with the victory securely in hand, you just disengage the two toggle magnets with a twist and you're good to go. Time: 10:12 - 10:22 And finally, we've got the ultimate test of strength, the punching bag game. Now for this one to make it more interesting, I wanted to find and challenge the guy in the arcade whose muscles looked the least like mine. So I stepped up first Time: 10:23 - 10:35 and rocked a six seven eight out of a possible nine nine nine. But then he stepped up Time: 10:36 - 10:41 and rocked an eight seven seven. And since that's bigger than six seven eight, the trash talking commenced. Maybe if you spend a little less time at the computer, a little more time in the weight room. So that was disappointing, but lucky for me, I had a trick up my sleeve. Time: 10:43 - 10:57 Like, actually, because that's a fake arm in order to disguise this. That was the one that was still a little inadequate. It's basically a bionic punching arm powered by two spring loaded pistons. To set the springs, we use a threaded rod and a drill, and once under tension, they're held in place with a quick release mechanism I can trigger with my finger at the exact moment I want to punch a thing. Time: 10:58 - 11:18 And I would classify the initial test in the lab as Time: 11:20 - 11:23 encouraging. Now it's important to note to play by the rules for this game, there's no side punching, pushing, running, kicking, or head butting. But you'll notice, there's no rule against spring loaded piston punching gloves. Time: 11:24 - 11:35 So now that my moment of sheer domination had arrived, I stepped up Time: 11:36 - 11:40 and rocked an eight thirty eight, which was less than eight seventy seven, which was disappointing. Time: 11:43 - 11:48 Damn it. And in hindsight, I should have known it's really hard to compete with the human body in terms of things like punching and throwing because we're just so efficient with those mechanics, and I have to sacrifice a lot of the speed and momentum of my own arm body system when I'm wearing that heavy wrist mounted puncher. But you know what? I'm a fighter. And what I lack in muscle mass, I make up for in tenacity. So out of curiosity, I took a closer look to see how the machine actually works. And it turns out, it has a beam break sensor just like the basketball game. So as that odd shaped metal piece, which is attached to the axle and punching bag, rotates around, the beam has this tiny window to hit the sensor. You could see the sensor in the front view here. So the game cleverly measures how many milliseconds the sensor sees the beam for, and from that, it infers how quickly the bag is rotating on the axle, and therefore how hard it was punched. And this gave me an idea. So I went to the prize counter and redeemed a few of my jackpot tickets I've been stocking up in exchange for a PEZ dispenser. Step one was to unwrap and eat some of the PEZ because they're just delicious. And then for step two, I removed the head and cut the arcade card like this, and then taped it here, and then went and tracked down my new friend. My theory was that if I extended the PEZ dispenser and modified card out like this and then let go, the force of the spring would retract the card and it would break the beam so fast, the machine would think it was an insanely fast punch. But would it actually work? And it turns out, Time: 11:48 - 13:09 it absolutely Time: 13:09 - 13:10 does because I maxed out the machine. So, Time: 13:11 - 13:14 yeah. Use this information responsibly, kids. Now a few years ago, I made a video where I visited the carnival and collected data on all the games and then use physics to expose which carnival games were rigged and then showed how to beat them. So this time around instead of the carnival, I once again bragged some family friends with unlimited slurpees in exchange for them collecting a bunch of data at some local arcades. And in addition to uncovering which games were scams, which I'll cover in just a minute, here's what we discovered. For starters, the most popular games in the arcade were the redemption games, as opposed to the experience games. And here's what I mean by that. Redemption games are the games where the goal is to win tickets. So like the coin pushers or this Plinko game or spin the wheel. On the other end of the spectrum, you have experience games like air hockey, skeeball, or racing games. It's a trade off because the games on this side of the spectrum give out more tickets, but it's not as much about the fun of the experience. And then in the middle of the spectrum, you have games like the ping pong drop or hit the clown that have middle of the road ticket payouts, but they're also middle of the road fun to play. Now since the games on this side were a lot more popular, they earn a lot more money for the arcade even when you factor in the higher ticket payouts. We found that for a medium sized arcade on a busy day, the less popular games were played 25 times, and the more popular ones could be played up to 250 Time: 13:15 - 14:31 times or more. At an average gameplay of $1, that means each game makes 25 to $250 Time: 14:31 - 14:37 per day or about 7 to $70,000 Time: 14:37 - 14:40 per year. And finally, we found that if your sole goal was to win tickets, coin pusher games like this avengers one seem to be the best return on investment. But honestly, you can just ask one of the workers there who are hanging out making minimum wage and are probably pretty chill because chances are they'll just tell you which ones they regularly see pay out the best. Alright. So finally, let's get to the real juicy part and talk about which games we discovered were basically scams. Time: 14:40 - 15:04 Now I actually have some experience in this area because a few years back, I built my original backpack arcade robot to dominate this game. Basically, it would sense the light turning on a few lights in front of the jackpot light, then it would hit the button with sub millisecond precision, and then we would touch nothing in between runs, and yet it would alternate between missing both shorts and long. In other words, the timing on the jackpot light doesn't match up with the duration it's lit and it's very different from all the other lights. You can actually test this yourself by picking a random light and you'll find miraculously you could somehow hit you could somehow hit that random light every single time you try. Now this caused me to dig a little deeper and after a bit of research, I was able to locate a copy of the owner's manual at which point I discovered the arcade owner could just manually set how often a jackpot should be won. So this time around, I was curious what other games were essentially running the same scam where you think it's a game of skill, but in reality, Time: 15:04 - 15:53 the arcade owner is controlling when a jackpot's won. And as it turns out, this really popular game called Stacker employs the same trick. This other really popular game Keymaster and this Cut the Rope game are also in fact running the same scam. In alter cases, I was able to get a hold of a copy of their owner's manual and each one has some language around how the arcade owner can specify how often a jackpot occurs. I also found many but not all claw machines have language around how it will close with full strength but then back off to a much weaker strength of whatever is set by the owner. For this reason, it's best to try for prizes closest to the exit hole to minimize the amount of time it's held in the claws. And I call these games scams because they present themselves as winnable games of skill, when in reality, it's essentially a random dice roll that is heavily stacked against you. And just like at the carnival, the most lucrative games are those where people overestimate their chances of winning because they seem to get close, but they don't quite win. In gambling psychology, this is known as the near miss effect, and it will lead to increased play of the slot machine. But this is much worse than a slot machine because at least in that case, you know it doesn't matter how you pull the lever because it's random chance. And on top of that, those games are regulated. So there is a minimum payout required by law. So for every dollar, for example, put into a slot machine, they have to pay out at least 80¢ back to the Time: 15:54 - 17:07 slot machine, they have to pay out at least 80¢ back to the players. But for those scam arcade games I just mentioned, the default payout rate is on average 20¢ Time: 17:08 - 17:17 for every dollar you spend, but a shady arcade owner could basically set that to zero and no one would know and that would be perfectly legal. And that's especially messed up because it's primarily played by kids. So if you remember nothing else, just try and pick games that avoid any sort of digital winning element that can be rigged. Because in those cases, you just never really know where your chances are. These games however are all great options to at least have a better sense of your actual odds of winning. I've checked the manual for all of these and what you see is exactly what you get. And I can vouch some arcades are more fair about this than others. For example, my home arcade here refuses to carry any of the games that can be rigged against you, which I think is pretty cool. However, if they happen to see this, my only suggestion is that moving forward, they should probably institute a no backpacks allowed policy. And perhaps also don't let people redeem tickets for PEZ dispensers. Time: 17:17 - 18:02I'm trusting you guys with to use the PEZ trick responsibly!! And I know it's been a hot minute since I've posted, but my videos take a lot of work and I've got 3 more BANGER vids to drop before the end of the year!",
      "comments": [
        {
          "text": "different times in 1 day with slightly different backpacks everytime.",
          "author": "Unknown",
          "likes": 16552,
          "timestamp": "There’s something about having a huge wad of “physical” tickets that makes it more"
        },
        {
          "text": "rewarding/satisfying than having them just loaded onto a card.  At least with the card it’s\nmore discreet though.",
          "author": "Unknown",
          "likes": 15083,
          "timestamp": "Imagine people coming into the arcade and wondering how they could ever beat the"
        },
        {
          "text": "record on the machines...",
          "author": "Unknown",
          "likes": 10026,
          "timestamp": "I must say, the air hockey backpack is genius. The other guy would never notice a"
        },
        {
          "text": "backpack playing for you while you are doing something else.",
          "author": "Unknown",
          "likes": 5198,
          "timestamp": "Its always baffled me how its not illegal for arcade games to be deceptive about skill"
        },
        {
          "text": "based looking games",
          "author": "Unknown",
          "likes": 5169,
          "timestamp": "Imagine being an employee at an arcade and seeing Mark walk in, knowing what is to"
        },
        {
          "text": "come.",
          "author": "Unknown",
          "likes": 4781,
          "timestamp": "Imagine being an employee at an arcade and seeing Mark walk in, knowing what is to"
        },
        {
          "text": "come.",
          "author": "Unknown",
          "likes": 4495,
          "timestamp": "You will never know why I have so many likes 😈"
        },
        {
          "text": "original one.",
          "author": "Unknown",
          "likes": 4143,
          "timestamp": "Imagine walking into the arcade seeing 9 jackpots go off while a guy leaves with 9"
        },
        {
          "text": "different backpacks smiling",
          "author": "Unknown",
          "likes": 4026,
          "timestamp": "Shout out to the muscle guy Andrew Herbert, a world record breaking powerlifter. I have"
        },
        {
          "text": "no clue how Mark found him, but he sure found one of the strongest human on the\nplanet.",
          "author": "Unknown",
          "likes": 3219,
          "timestamp": "I'm on my 4th year of engineering college and still have no idea how you come up with"
        },
        {
          "text": "99% of your ideas. You're a huge inspiration to me and one of the reasons I'm still\npushing through both majors.\nOne day I hope to bless the world with a design to help people with big hands eat\npringles.",
          "author": "Unknown",
          "likes": 3102,
          "timestamp": "I like how he casually lists all the things for the devices like everyone has all those items"
        },
        {
          "text": "instead, he chose to make our lives here on Earth a little better and brighter with these\ndelightful videos.",
          "author": "Unknown",
          "likes": 2655,
          "timestamp": "This is fantastic."
        },
        {
          "text": "find my books and check out, my little sister would be in story time. I would sit by the\ndoor and watch the numbers on the counter go up as I swished my hand back and forth\npast what is apparently called the beam break detector, running the number up by\nsometimes hundreds in an afternoon. We moved before the expansion so imagine my\nsurprise when we went back years later and the library had expanded, they had added a\npark out back and my mom and one of the main workers who was still there informed me\nof the roll my bored playing around had had in it",
          "author": "Unknown",
          "likes": 2486,
          "timestamp": "The fact that you took the time to build all these to go in a backpack or just look non"
        },
        {
          "text": "suspicious is amazing this is epic.",
          "author": "Unknown",
          "likes": 2365,
          "timestamp": "I took your advice and built all of these things. It took me a while. About 160 hours of"
        },
        {
          "text": "design and build with about $8000 out of pocket. But I successfully got a bunch of tickets\nwhich I traded for a $3 stuffed animal, so who’s laughing now?? Haha, I totally swindled\nthem!",
          "author": "Unknown",
          "likes": 2163,
          "timestamp": "Imagine trying this 30 years ago when cards didn't exist. You'd need a second backpack"
        },
        {
          "text": "just to hold all the paper tickets!",
          "author": "Unknown",
          "likes": 2138,
          "timestamp": "Mark can singlehandedly bankrupt the arcade sector if he wants to. He's just choosing"
        },
        {
          "text": "not to.",
          "author": "Unknown",
          "likes": 1874,
          "timestamp": "I love how Mark Rober is basically a more wholesome version of Tony Stark, who uses"
        },
        {
          "text": "his insane engineering powers to beat shady arcade owners and porch pirates, rather\nthan alien invaders.\nBut if the aliens ever show up, I can't wait to see how he will turn his warehouse into a\nHome Alone death trap.",
          "author": "Unknown",
          "likes": 1778,
          "timestamp": "What I love about Mark is that he makes STEM appealing and fun for kids, making kids"
        },
        {
          "text": "more likely to go for STEM majors, a true service to society.",
          "author": "Unknown",
          "likes": 1417,
          "timestamp": "If you ever see Mark walkin into an arcade with 12 backpacks, you already know he’s"
        },
        {
          "text": "about to own the entire gift shop.",
          "author": "Unknown",
          "likes": 1247,
          "timestamp": "I guarantee you, as someone who works in an arcade, if anyone I work with caught you"
        },
        {
          "text": "doing this, we'd all think you were really cool and warn you what our manager looks like",
          "author": "Unknown",
          "likes": 1201,
          "timestamp": "Забавно, так ещё и русская озвучка) Спасибо автору за старание и тому кто"
        },
        {
          "text": "озвучивал!",
          "author": "Unknown",
          "likes": 1163,
          "timestamp": "can we take a moment and appreciate the fact he invented the first single player air"
        },
        {
          "text": "hockey table? for people with no friends like me...i would play this.",
          "author": "Unknown",
          "likes": 1154,
          "timestamp": "Such a banger video Mark!"
        },
        {
          "text": "Also Mark: Holds it the way he told us not to.",
          "author": "Unknown",
          "likes": 971,
          "timestamp": "I learned to take my kids to the casino instead of the arcade thanks Mark 👍"
        },
        {
          "text": "solve the problem then and there. Straight out of a movie.",
          "author": "Unknown",
          "likes": 908,
          "timestamp": "Is it just me or did Mark just give us instructions on how to make the Fallout power fist?"
        },
        {
          "text": "and keeps my attention and entertained",
          "author": "Unknown",
          "likes": 858,
          "timestamp": "Only thing Mark isn’t factoring in would be the power of the universe. On my 13th"
        },
        {
          "text": "birthday, I won like 3 jackpots on the same day. ABSOLUTELY INSANE. Lol unless the\narcade did that on purpose to make me happy. 😂\nThen it makes total sense.",
          "author": "Unknown",
          "likes": 762,
          "timestamp": "Amazing! Mark Rober is one of the best youtuber that I look up to. 🙌"
        },
        {
          "text": "makes me relive long hours of hyper middle schoolers.",
          "author": "Unknown",
          "likes": 651,
          "timestamp": "I can't wait for Mark's episode exposing casino chances and machines to beat them!"
        },
        {
          "text": "... hope he survives.",
          "author": "Unknown",
          "likes": 624,
          "timestamp": "You start to realise why so many scientific minds were executed in history. Because this"
        },
        {
          "text": "is batshit crazy. Gotta love Mark.",
          "author": "Unknown",
          "likes": 611,
          "timestamp": "I sure would need a ”dad finder”! Seems like a cool unit!"
        },
        {
          "text": "arc or bow. So arcades came to be known as “arcades” because of the way the\nentrances to the buildings were built with arches as doors.",
          "author": "Unknown",
          "likes": 560,
          "timestamp": "mark is like a santa comes once in a while bringing amazing gifts"
        },
        {
          "text": "work on workers, as long as you’re not horsing around and making a scene, we will\nabsolutely leave you alone at the games with no questions asked. Hack the games away\nhaha",
          "author": "Unknown",
          "likes": 522,
          "timestamp": "The fact that he thought to bring a Pez dispenser in the mix just shows how much Mark"
        },
        {
          "text": "thinks outside of the box 🤯",
          "author": "Unknown",
          "likes": 496,
          "timestamp": "\"Or you could just go with my route\":"
        },
        {
          "text": "- Earn a bachelor's degree in engineering\n- Earn a master's degree in engineering\n- Work at NASA for nearly a decade\n- Spend another decade tinkering and building gadgets\n- Build an entire YouTube channel and lab dedicated towards unique engineering\nproblems and solutions\n- Create a custom gadget costing hundreds of dollars to win $30 worth of stuff an at\narcade\nBut I for one am glad that he chose this!",
          "author": "Unknown",
          "likes": 485,
          "timestamp": "Mark went from catching package thief’s to being a ticket thief 😂"
        },
        {
          "text": "win percentage or sometimes random win for years and tell everyone.. but people don't\nlisten.\nGlad someone influential like mark has spread the word.",
          "author": "Unknown",
          "likes": 467,
          "timestamp": "He really just went and made the power fist from Fallout to beat someones score on the"
        }
      ]
    },
    {
      "video_id": "video_11",
      "title": "Pranks Destroy Scam Callers- GlitterBomb Payback I had 100 cockroaches here and I placed them in this James Bond style contraption that turns this ball screw and forces them out after a specified time delay. And then I put it in a lunchbox for camouflage and then I release them in this office. Now you might think that's not very nice, Mark. Some people are afraid of cockroaches. Trust me, I know.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:18 And Time: 00:19 - 00:19 that's exactly the point because this isn't just any office. This is ground zero for one of those terrible call centers that scams people of their life savings. A year ago when I released this video about inadvertently stumbling onto the low level thugs in this international scam operation, I said we were gonna glitter bomb our way all the way to the top even if it meant taking this fight to the other side of the globe. And so after a year and a half of planning, we infiltrated not one, not two, not three, but four different scam call centers. We released cockroaches, smoke bombs, stink bombs, glitter bombs, and then of course we hacked their CCTV Time: 00:20 - 00:54 so we could watch the whole thing unfold in real time. So buckle up because this is the wild conclusion to this multinational Time: 00:54 - 01:00 adventure and please watch to the end because there's something you can actually do to help put the nail in the coffin of these four massive call centers. Now why would we go after this $20,000,000,000 Time: 01:01 - 01:11 scam industry? Well, we're doing it for the 60,000,000 people who've lost money to scammers in the past year. But more specifically, Time: 01:11 - 01:17 we're doing it for Bessie, who you might recall from my previous video when I detailed exactly how one of these scams work. You're like my granny, miss Bessie. Do you know this? Time: 01:18 - 01:27 Yes. She was like one of my closest. Oh. I used to share each and everything with her. Basically starts with an email or a spam call, then they pretend to be Amazon or Microsoft, and they tell the victim they've been charged $200 Time: 01:27 - 01:40 for something. But if you call back, you can dispute the charge. Then after they call, they eventually get on the victim's computer and importantly have the victim type the $200 refund amount into a bogus form. Please enter your refund amount. Only they take over and secretly type the amount of $20,000 Time: 01:40 - 01:56 and then they hit enter real quick. Jacob, I think is it correct? Time: 01:56 - 01:59 Oh, no. This is a mistake. Time: 01:59 - 02:01 Oh, I screwed up. I Oh, my Jesus. Time: 02:01 - 02:03 I'm it was supposed to be a Time: 02:04 - 02:06 a 200 in there. Time: 02:06 - 02:08 Oh, god almighty. Time: 02:08 - 02:10 I'm exhausted. I can't do this. My mind is absolutely Time: 02:11 - 02:15 fried. Please check your account. Did you really receive that money in your account? Then they take her to a totally fake spoofed bank account page where it looks like because of Bessie's mistake, they just sent her $20,000 Time: 02:16 - 02:27 instead of 200. Time: 02:27 - 02:28 Oh my god. Plus 20,000. Time: 02:29 - 02:32 Yeah. Please save my job, ma'am. If I'll not earn for my family, my family will die due to hunger, due to starvation. Time: 02:33 - 02:39 Please, yes, of course. I mean, what should I do? I mean, I can bad for you. You are also like my grandmother. You know, I'm I'm an honest person I could cry now. You're making me cry now. You're I'm getting attached to you. Yeah. How do I fix this? And now you can see how he's weaponized her empathy. Now to fix her mistake, how she'd be willing to go to the bank and withdraw what she thinks is an extra $20,000 Time: 02:39 - 03:01 in cash, when in reality, it's $20,000 Time: 03:01 - 03:05 of her hard earned savings and she's gonna send it in the mail to a heartless scammer. Now, Casey think they've gotten a lot nicer over the last year, here's another call from a few weeks ago where the scam is to pretend they're from the government and there's some missing taxes that are owed. I I've just retired, as I say, last February, and then I was diagnosed Time: 03:05 - 03:22 with breast cancer in Time: 03:23 - 03:24 August. So my retirement hasn't been very good so far. And after today, I know it's not your fault, but it's worse now. Time: 03:25 - 03:34 Oh, I'm I'm so sorry. I would rather just pay it. Otherwise, I'll be worrying about it and it I'll be worse in my health. You know what I mean? Like Time: 03:36 - 03:45 or even if I have to pay it in two halves. So the scammer places her on hold to talk with the authorities Time: 03:46 - 03:52 and to see if there's just something that could be done to help her out. Thank you so much for holding the line, ma'am. I just had a word with the health authorities, Time: 03:52 - 03:59 and I informed them, Time: 04:00 - 04:01 about your situation, and Time: 04:02 - 04:03 they are also concerned Time: 04:04 - 04:05 about your health. So concerned, in fact, she'll only have to send these scammers two thousand dollars. Actual amount found out missing in the taxes is 1,489. Time: 04:06 - 04:17 Now last year's operation was effective in getting a handful of people involved in this scam not only covered in glitter, but also arrested. But the problem was we discovered these were just the low level mules and supervisors who then send the bulk of the money back to the actual scammers in India. And while we did turn over all the intel we gathered to the five major government agencies that reached out to us to truly avenge Bessie, our goal was to take our glitter all the way to the top and either temporarily disrupt or possibly even permanently shut down a few of these terrible call centers. It'd be like a special operation and every special operation needs a special ops team, a target, and a plan. For the team, I turn back to my good friend Jim Browning, who you recall from last year as a YouTube channel that specializes in reversing the connection of the scammers computers and gaining access to their CCTV footage. And is there anything else you wanna ask? Yeah. I wanna know why you scam people. And then another YouTube channel called Trilogy Media would be the boots on the ground in India implementing the pranks, but more on them later. For the Target, together we were able to locate and gather tons of incriminating information on four different scam call centers. For starters, there's MET technologies Time: 04:17 - 05:22 located in Kolkata, India on the Fifth Floor of this building. They've been in operation over twelve years and they've got over a thousand agents. Their owner is mister Kunal Gupta and you can even see the rest of their leadership team here on their public website. And you might ask, why would a scam call center have a public website? And the answer is they all do because they have a very small percentage of their employees do legitimate call center work. So if they get raided by the authorities, they can point to that small group and say their hands are clean, while the real money making operation Time: 05:22 - 05:50 runs here behind a secure door. Then we found VRM also located in Kolkata on the Twelfth Floor of this building. They also have over 1,000 agents, and they've been in operation for six years, and they run twenty four hours a day in three shifts to target people in time zones all across the globe. Oh, and allow me to introduce to the world Rajesh and Vidya Goenka, the husband and wife co owners. Next was Anj info solutions on the Fifth Floor of this building. They also run three shifts twenty four hours a day and they've been up and running for eleven years with all their key info shown here. They're located just a block away from VRM. In fact, all three of these centers were located within just a few miles of each other here in Kolkata, India. There's a hot spot for scam call centers like this. And finally, there was one more relocated, but we're not releasing public information on them yet, and you'll see why in just a little bit. And so once we'd amassed mountains of evidence against all four of them, thanks to Jim's handiwork, we hired 10 private investigator types to apply for jobs at each of these centers and after a few weeks, we had them all in place. Now in order for them not to around suspicion, they had to legitimately scan some people. But we told them to remember the victim's information and then we would reach out and double any money that was lost. And at first, one of our agents in the VRM call center went against protocol and used his phone to capture some footage for us of the bathrooms and the server rack and Time: 05:50 - 07:08 whatever this is. But they must have seen him filming with his phone on their CCTV because the next day, some of the security team showed up at his house. Now luckily, his roommate knew to lie and say he wasn't home, and he was able to escape through the back alley. But they stayed out in front of his house all day and later sent this message saying the director wanted to speak with him, and they would pay him handsomely, and of course, he didn't need to be scared. They were just simply curious what kind of evidence he'd gathered against them already. So from that point on, we reiterated to the remaining nine to lay really low like a sleeper cell until we were ready to activate the plan. And speaking of the plan, now that we saw what we were up against, we knew we'd have to go full James Bond cue mode with some high- tech gadgetry that can make it past security. Time: 07:10 - 07:52 Which is why this first prank is just a water bottle. Time: 07:54 - 07:57 Kind of. I mean it can function as a normal water bottle, but if you unscrew just this portion of the lid, it reveals a trough. And if you put military grade putrid smelling stuff in that trough and then screw the lid back on fully, it creates a perfect seal and you can't smell anything. But then at the exact precise moment you want to release a cloud of death, you just twist the lid like this, allowing the smell to escape through these holes and fill the room. And we're using a water bottle because from looking at the CCTV footage, we know they allow them to have water bottles at their desks, so they'll be able to sneak them past security. Plus, no one's going to suspect that's the origin of the smell. Next up, if you take some hand soap and add just a few drops of the same kitchen grade food coloring we used on the devil's toothpaste explosion, Time: 07:57 - 08:40 then when you wash your hands, it will leave them stained for at least a day. Oh, crap. Time: 08:42 - 08:46 We'll leave this in the bathroom. And as a bonus, we'll learn exactly who does and doesn't wash their hands. This next one is the most simple, but also perhaps the most effective. You take a box of Sudafed and then print out and paste on some of these labels and convert it to a box of Viagra. Then importantly, you add the name of the boss of the scam call center to the box like it's his prescription and then you leave it in the bathroom next to your blue soap. Next up is that custom built box that can store cockroaches in it. So after a predetermined time delay, the micro controller would trigger the stepper motor which causes the wall to slide along this ball screw. That means if you disguise it in a lunchbox, then nothing happens until the timer expires. And then suddenly, you get a bunch of cockroaches Time: 08:47 - 09:23 crawling out of a lunchbox. Although you can put more than just cockroaches in here and some other ideas we had were bees because we heard India has some species that don't actually sting, as well as possibly rats because we already knew from looking at their security footage that once released the rats could make themselves right at home. And using a lunchbox for camouflage is once again a strategic choice because we already knew from our recon work, they always make it past security because no one actually checks what's inside. Next up, I love the idea of the chaos that could result if we set off a smoke bomb. But we were concerned that might be crossing a line if the room was too small because like the glitter bombs, I want everything I do to be exciting, but at the end of the day relatively harmless. So instead, we found these micro foggers that are basically like massive vape pens. We also noticed motorcycle helmets were allowed onto the floor and past security. So the plan was to put it inside a helmet like this and then it would also detonate itself based on a timer. And finally as the piece de resistance, we're gonna deliver them a package. Only this isn't an ordinary package. It's glitter bomb four point o, which of course as we all know is equipped with a pound of the world's finest glitter and an uncharitable amount of fart spray. I still smell it. Time: 09:23 - 10:26 And so now that our team target and plan were in place, after one and a half years of prep work, it was time to avenge Bessie and execute the special operation. Time: 10:28 - 10:36 Step one was getting the trilogy media guys all the way over to India with all the contraptions stored securely in their luggage. My guys, stepping foot on Indian soil. Now safely on the ground, step two was to go pick up those stingless bees that we could put in the lunchbox. But once they'd arrived to the beekeeper, they found out you can't just take a few bees, but you have to take the whole hive. In the car dude, no. Time: 10:36 - 10:59 They're gonna get out. I'm not afraid. Also, apparently, there's no such thing as stingless bees. Oh, my Time: 10:59 - 11:05 god. Oh, Time: 11:05 - 11:06 shit. Time: 11:08 - 11:08 So we punted on that idea and headed to an open air market where we could at least secure some rats. Time: 11:10 - 11:15 By the way, the trilogy media YouTube channel is composed of Ashton, who's a former magician, and Art, who played professional basketball in Russia for eight years. They're just an incredible duo. And speaking of incredible things, this is a good time to point out that the real people of India were just so freaking lovely. It's true that nearly every scam call you get originates from that country, but everyone in India hates these scammers too. They are a tiny tiny fraction of the total population and no one wants to be defined by the worst in their midst. Most people we interacted with there had hearts more like Johnny, who's an honorary member of the team and a reformed scammer who's made it his life's mission to do whatever he can to take these guys down, even if that means working some back channels to get our hands on a hundred cockroaches. Time: 11:17 - 11:58 Alright. Let's go. So with the goods procured, it was time to meet up with our sleeper agents at the hotel to do some final prep on the contraptions, which went about as well as expected. Seriously, though, are we gonna test it right here? Right here? Yeah. Can't do it in the bathroom? 191617. Time: 11:58 - 12:11 Yeah. No. Get them in. Get them in. Oh, man. And more than marriage. See you. Down. Go Time: 12:12 - 12:17 Okay. Pause. Time: 12:35 - 12:37 Pause. Pause. Accounted for, right, everyone? I Time: 12:37 - 12:40 all across India belong to so the different scam call centers can communicate with each other. And because Johnny was still a member of this group from his former days, he saw this message pop up. Two of us in the town of Kolkata have seen cuss word trilogy people. We followed them but the driver drove the car very fast to the Salt Lake side. There was two Indians with them and they were shooting a movie. So apparently some scammers had recognized Art and Ashton at the market as the trilogy media YouTube guys because they've confronted a lot of scammers in their five years of making videos. Now thankfully, just out of habit, Johnny was driving in a way that would make it hard for anyone to tail them. But they still were able to pinpoint their hotel location within about a half a mile. But then it got much worse. Might be there working with the FBI, so I request all of our brothers to have an eye in Salt Lake. So whenever you see them, you shoot them. Which was super devastating because it seemed pretty clear to me that we'd have to scrap the whole operation because while the mission was important, it definitely wasn't worth anyone getting hurt. But when I brought this up to the guys, guys, they'd already discussed it amongst themselves and decided this was a cause they were passionate about that they were willing to accept some risks. So we decided moving forward, Art and Ashton wouldn't step a foot outside their hotel room, and that's when the second major blow came. Because apparently, the group text warning spooked the call scam center so much, they just changed up everyone's assignments. And they were planning on moving all three of our sleeper agents to a new floor where there was no CCTV coverage. But this is where we had a stroke of luck. Because the last minute, Johnny thought to have another one of his reformed scammer friends apply for a job. And because he had so much experience on his resume, they hired him on the spot and gave him a more highly trusted role, which meant he could be the one to smuggle in all our gadgets. And so with that, he loaded up, headed in for battle, and an hour later, we had a man on the inside. And by the way, now that we're inside, I'll give you a very quick crash course on what we've learned about how these scam centers operate after watching them for so long. First of all, ninety percent of the victims are 65 years old or above. I don't understand that. Time: 12:55 - 14:47 I don't understand all of this. They really only make calls during The US working day hours and not on the weekends because that maximizes their chance the person who picks up will be retired. This is why you never get scammed calls on Sunday. They don't have anyone even working the phones. In fact, many of them have an auto dial prompt that says press 1 if you're over 65 years old. And if you press anything else, it just hangs up. The most common scam is the Amazon refund scam, but they also pretend to be Microsoft, McAfee, Norton Antivirus, IRS, and your bank, and on and on. It's always changing, but it's also always something you've heard of to try and build trust right out of the gate. If you wanna know how much they make, well, that information, unfortunately, is securely held on the boss's computer, so we can't get to it. Although, Time: 14:49 - 15:30 I suppose if you had access to the internal cameras, you could just watch the boss type his password, and then you'd be able to access their master tracking spreadsheets, which is what we did and how we know these large call centers make $60,000 Time: 15:31 - 15:45 per day. That's $18,000,000 Time: 15:45 - 15:47 a year. An opener will take the initial calls and they make an average of $7,000 Time: 15:47 - 15:51 a month. Then if they keep the victim on the phone long enough, they hand it over to a closer and they make on average $15,000 Time: 15:51 - 15:57 a month. They never say the word scam or victim, instead referring to them as sales and customers. That way, they just seem more like a normal office. Although, what I think does that job more convincingly are all the walls plastered with inspirational corporate words like synergy or management Time: 15:57 - 16:13 or process. Time: 16:14 - 16:14 So that's your crash course on how they operate and the FTC has put out a list of four signs to help spot a scam and four things you can do to protect against them and I'll link to it in the video description. And so now without further ado, we kicked things off with the stink bomb water bottle. And while that was marinating, he went to the bathroom and dropped off the hand soap and the special medication with the boss's name written on the front. And it didn't take long for us to get our first hit on the smell. What was great though is they all kind of covered their noses subtly in silence so the people next to them wouldn't feel accused. Time: 16:15 - 16:45 Well, for the most part. Time: 16:45 - 16:47 Then a few minutes later, we had our first bathroom customer who clearly doesn't wash her hands after using the restroom. But then we had a second chance with an apparently more hygienic scammer and this time we struck pay dirt as he comes out trying to figure out what the heck just happened and five minutes later you can see him still trying to work it out and not long after that we got our first mention of the special package in the bathroom. Time: 16:48 - 17:08 The audio cut out here, but our agent told us they were laughing and wondering how the boss could possibly leave that lying around. Although, it certainly doesn't feel too far off brand given he uses this as his profile pic on Facebook. Time: 17:15 - 17:26 And at this point, our agent plays and then trigger the time delay countdown on the cockroach rat and smoke bomb traps so he can now safely make his skidaway. Time: 17:27 - 17:36 Oh. Time: 17:39 - 17:40 You okay? Time: 17:40 - 17:41 Yeah. You're safe. Yeah. Time: 17:43 - 17:45 I thought they were just following me. And since they of course have no idea what's about to happen, they're still just casually talking about the bathroom. Time: 17:45 - 17:52 And then a few moments later, the first boxes must have triggered because this guy notices a cockroach and nopes his way out of there. And then he's quickly followed by the second dude. And I love it because now you just randomly see cockroaches start coming in frame. And so now that they know what they're up against, they call him the reinforcements with a mop. Time: 17:57 - 18:13 But it looks like you missed one Time: 18:15 - 18:16 or two Time: 18:17 - 18:17 or three. Actually four. Time: 18:18 - 18:20 Scratch that. Time: 18:21 - 18:22 Five. And then as it perfectly on cue, right as the mop guy finishes his cleanup, the smoke begins. Time: 18:22 - 18:28 This causes quite a commotion and draws quite a crowd and it takes them a while, but they're eventually able to pinpoint the source of the smoke and gingerly take it off the premises. Time: 18:28 - 18:37 Followed soon thereafter by our rat friends. And this is possibly my favorite clip of the whole night, where you see a cockroach lead the way and wander all Time: 18:38 - 18:46 around as they argue and try and make sense of what in the world is possibly happening. And by this point you could tell the boss is pretty sure they're under attack, but just to remove any sense of doubt, we sent them one final package. Time: 18:47 - 18:58 And they almost opened it right there, but I guess with everything else that had already happened so far that night, they took it downstairs. And then this happened. Time: 18:59 - 19:06 You can't give up or you're thirsty for more? Time: 19:16 - 19:19 Yeah. In fact, there's four of them, and they're uploading this footage to the cloud. Time: 19:22 - 19:25 54321. Time: 19:40 - 19:44 Activation complete. Time: 19:45 - 19:46 Recovery sequence initiated. Time: 19:47 - 19:49 We waited to see what the response would be and we didn't have to wait long. Yesterday, those cuss words sent Onsch Solutions a package bomb and it exploded and there was a bad smell and sprinkler water or whatever it was. These guys are playing good with us. I'm reminding you guys, they must be in between us. We don't even know. And now we had them because they were paranoid and they didn't know which of their employees might have been compromised. Checked the lunch boxes, Time: 20:11 - 20:37 pocket bags, shoes, ladies purse as well. Even check the water, whether there's some color mixed in it. I assume he's referring to the soap dye here. But be cautious guys, seriously. Time: 20:38 - 20:48 They came to bad word all of us and they are still trying to bust us. After that, there were a few more death threats, so we didn't think it was safe enough to launch our attacks on the other three centers to try and get them shut down. But the beautiful thing is, we didn't have to. Big centers in Kolkata and Delhi are closed from today, as well as Monday, as per the information I got from all my friends. We had created enough confusion and mass panic that not only did the other three centers get shut down, but we got all the large scam centers all across India shut down for a few days too. And if you add it up, that means those tiny cockroaches stopped $2,000,000 Time: 20:49 - 21:24 from going from the victims to the scumbags. And I would say that's the perfect ending, but it actually gets even a little better. Once Ashton and Art were safely back home on American soil, they decided to troll that text group with those 55,000 Time: 21:24 - 21:36 scammers by uploading this gem to the chat. Surprise, surprise, scammers. Art International over here. No matter how many numbers you remove from this group, we're still watching. Not only that, we've also downloaded Time: 21:36 - 21:47 every single person's contact information, all 57,000 Time: 21:48 - 21:51 of them inside this group, we have every single one of her contact information. We're submitting it to the FBI in The United States and the CBI here in India. So you guys better run and you better watch out. Time: 21:51 - 22:00 And so if you wanna see how quickly the scammers started removing themselves from the chat group, as well as a lot more details of all their work on the ground over in India, you should go check out their video. And not surprisingly Ansh and the other scam call centers eventually opened back up, albeit this time with much tighter security. But they still didn't and still don't realize probably till this moment that we have access to their live camera feeds. So Jim improvised a bit, calling them out by their real names without giving away the fact he was just looking at them on the camera. Yeah. Hi, sir. My name is Carolina Fernandez. Time: 22:00 - 22:31 I am calling you from the Microsoft. Time: 22:31 - 22:33 Oh, hi, Priya. Time: 22:34 - 22:35 Hi. Who are you? I'm a ghost. Yeah. I don't know. You know my father's name. I don't know. But is your father proud of you? What you do? Does does he think you work for Microsoft? Time: 22:38 - 22:47 Yes. Time: 22:48 - 22:48 Of course. But you don't work for Microsoft. Did you tell him that? Will I tell you one more name? Yes. Sawini. Time: 22:49 - 22:55 My god Sawini. Time: 22:57 - 22:58 At least talk to me. Time: 23:00 - 23:01 Hello? Time: 23:03 - 23:03 He also managed to change the way their voices sound when they would do outbound calls to their potential victims. Who are you? Time: 23:04 - 23:10 You're speaking very strangely. What what's up? So to see a lot more of that quality entertainment, you should go check out his video. So after all that, we're sort of in a good news bad news situation here. The good news is that because of some developments we've been involved in, the fourth center here is gonna be raided by the authorities in India and shut down very very soon. The bad news is that these other three are still very operational. And for reasons I can't say here, we don't have the same option to get them shut down like we do on the fourth one. Now you might ask, why not just privately reach out to the proper authorities in Kolkata where these three call centers are located? And the answer is that's been tried before and it didn't work. While there are many good apples, there are a few bad apples that prevent anything from happening to these guys. Time: 23:13 - 23:56 So where does that leave us? Well as they say, sunshine is a great disinfectant Time: 23:56 - 24:00 and here's where you come in. We've invested a lot of resources and time and tried to make this video as entertaining as possible in the hopes that you'll consider sharing it for two reasons. Number one, the more people are aware of how these scams work, the less effective they become and they lose their power. So please share it especially with your older loved ones. And number two, the more people that see this video and learn about these three specific call centers, the more the press will pick it up especially in India. Heck, tweet our videos to the Kolkata police. This helps out the good apples because the bad ones can't just sweep all the evidence under the rug or quietly tip-off the scam center bosses. The press and public can hold them accountable. We've seen this tactic work successfully in the past, and we have mountains of evidence against all these scam centers. If you are with the press or a law enforcement agency, send us an email to callcenterevidencepack@gmail.com Time: 24:01 - 24:49 and we'll share everything we have with you. If you combine them, these three centers have been in operation an astounding Time: 24:49 - 24:55 twenty nine years and they are still scamming people of their life savings to this day even right now as we release this video. So let's see what we can do and depending on exactly what happens, I'll either post a follow-up video here on my YouTube channel or on my other social channels. So subscribe and all that stuff if you want to stay in the loop. Glitter bombs and cockroaches are just harmless entertainment. But our best chance of working together to shut these guys down for good is by shining a light to foster some accountability. Time: 24:55 - 25:22 Thanks for your help. Now, let's make Bessie proud. Time: 25:22 - 25:25 I wanna thank NordVPN Time: 25:29 - 25:31 for their support on this video. I've been using their service myself for over three years now because they really are the best at this. With Nord, you can surf the web anonymously, your location stays private, and your data is encrypted. Because even though I'm not a bad guy with something to hide, I generate a ton of information online every day, and I prefer that information wasn't sold or used against me in some way. Nord collects and stores absolutely nothing and makes it so others can't either. Plus if you're traveling and you want your exact same internet experience at home, like to watch all the shows you're used to, it can virtually transport you to nearly 60 different countries. They also have a new service called Threat Protection, which is sort of like an umbrella that protects you from malicious sites, downloads, and trackers even when you're not connected to a VPN. So if you travel or you're just ready to take your privacy more seriously, you can get a two year plan at a huge discount plus one additional month free by going to nordvpn. com/markrover. Time: 25:31 - 26:21 And the good news is, if it's not right for you for any reason, they've got a thirty day money back guarantee. So once again, that's nordvpn.com/markrober Time: 26:21 - 26:29 or use the link in the video description. Thanks for watching Time: 26:29 - 26:32 and sharing with literally every person you've ever met or ever will meet, and let's get these punks shut down. Time: 26:33 - 26:38Was an absolute honor to be a part of this. Let's take these guys down!",
      "comments": [
        {
          "text": "get these 3 scam call centers shut down for good.",
          "author": "Unknown",
          "likes": 152546,
          "timestamp": "This was an absolute blast. I have a feeling it's going to result in something much bigger"
        },
        {
          "text": "than a few YouTube videos. It was a pleasure working with you as always Mark.",
          "author": "Unknown",
          "likes": 65228,
          "timestamp": "It's sad that these scammers treat their jobs like a mafia, and are willing to take"
        },
        {
          "text": "someone's life just to get some grandma's savings. That's awful...",
          "author": "Unknown",
          "likes": 43675,
          "timestamp": "This is extremely brave. These are multi billion dollar business’s that are used to"
        },
        {
          "text": "breaking the law to maintain a profit. This really felt like a movie.",
          "author": "Unknown",
          "likes": 17029,
          "timestamp": "this dude just spent 18 months on a video. RESPECT."
        },
        {
          "text": "Mark, you’re doing humanity a great service. Happy Mother’s Day as well to all the\nwonderful mothers of the world",
          "author": "Unknown",
          "likes": 13685,
          "timestamp": "Imagine a youtuber doing more investigation work than your whole government"
        },
        {
          "text": "package",
          "author": "Unknown",
          "likes": 12781,
          "timestamp": "This was incredible, bravo gentlemen! If you ever need some additional help on pranking"
        },
        {
          "text": "these scumbags even MORE, I'd love to help on the next one 😉",
          "author": "Unknown",
          "likes": 11259,
          "timestamp": "Mark Rober is the hero we needed to take on these scammers."
        },
        {
          "text": "thousands",
          "author": "Unknown",
          "likes": 9500,
          "timestamp": "Not only is this a payback to scammers, its showing how bad they can be if they betray"
        },
        {
          "text": "themselves. Great video!",
          "author": "Unknown",
          "likes": 9021,
          "timestamp": "I'm from India and I can confirm we all hate scams and scammers just as much. Thank"
        },
        {
          "text": "you Mark for going through with such risky operations. There's still a long way to go but\nwe'll defeat them together.",
          "author": "Unknown",
          "likes": 6581,
          "timestamp": "You guys are making the world a better place little by little by serving these people some"
        },
        {
          "text": "justice. Though never in my life would I have thought I’d consider some roaches as\nmartyrs.",
          "author": "Unknown",
          "likes": 6440,
          "timestamp": "You know we’re screwed when YouTubers do more for the justice than authorities do"
        },
        {
          "text": "like you take such actions against them and saving peoples hard earned money",
          "author": "Unknown",
          "likes": 5365,
          "timestamp": "Shoutout to the guys in India that went undercover! That seems absolutely terrifying."
        },
        {
          "text": "Especially the one that had people show up at his home",
          "author": "Unknown",
          "likes": 5251,
          "timestamp": "You're doing god's work Mark, thank you !"
        },
        {
          "text": "smaller and harder to catch and they spread like freakin wildfire dude. I worked in pest\ncontrol last year, and they are a nightmare to contain.",
          "author": "Unknown",
          "likes": 3977,
          "timestamp": "Listening to Bessie blame herself as they're scamming her made my blood BOIL."
        },
        {
          "text": "be enough information for the police to shut them down.",
          "author": "Unknown",
          "likes": 3916,
          "timestamp": "Incredibly brave! Mad respect for putting over a year into one video… 🤯"
        },
        {
          "text": "Keep up the amazing work love and respect from all of us in India, we hate these people\nas much as you'll do.",
          "author": "Unknown",
          "likes": 3623,
          "timestamp": "Shout out to all those reformed scammers and guys who LITERALLY put their lives at"
        },
        {
          "text": "risk. Those scammers were crazy, waiting outside the dude's house.",
          "author": "Unknown",
          "likes": 3607,
          "timestamp": "I work at an internet callcenter, I hear from customers getting scammed all the time. We"
        },
        {
          "text": "try to advise customers that companies like microsoft  will never give out numbers like\nthis and certainly not need any customer action to refund money.",
          "author": "Unknown",
          "likes": 3591,
          "timestamp": "This is what YouTube is about! Making the world a better place. Amazing work"
        },
        {
          "text": "$30,000 from her savings. Seeing her so stressed and devastated for a few months\nreally makes me angry about these scammers.",
          "author": "Unknown",
          "likes": 3505,
          "timestamp": "We have our REAL Avengers. Thanks Mark. You made me believe again"
        },
        {
          "text": "elderly.\nAmazing work Mark and team!",
          "author": "Unknown",
          "likes": 3484,
          "timestamp": "Mark is one of a kind.  Incredible video"
        },
        {
          "text": "country.\nShameful that someone from a different country has to solve the issues that the\ncountries government could never.\nI am really, really grateful to you Mark. Thank you for what you have contributed for the\nbetterment of my country.",
          "author": "Unknown",
          "likes": 3313,
          "timestamp": "The fact that a YouTuber got this far, almost all on his own, just proves that if the"
        },
        {
          "text": "government really wanted to take these scammers down, they absolutely could. This all\ntells me that government is more than likely benefiting in some way from these\nscammers.",
          "author": "Unknown",
          "likes": 3276,
          "timestamp": "The way they took advantage of Bessie and made her so upset really makes my blood"
        },
        {
          "text": "boil. It's great what you're doing, but the fact that people like that even exist is just\ndepressing.",
          "author": "Unknown",
          "likes": 3276,
          "timestamp": "It is disappointing that people of my own country are scamming people of their precious"
        },
        {
          "text": "money, but it also very satisfying to watch these scammers get what they deserve",
          "author": "Unknown",
          "likes": 3154,
          "timestamp": "It's all fun and games but honestly the fact that they were able to shut down one of the"
        },
        {
          "text": "call centers is probably the most satisfying part in this video.",
          "author": "Unknown",
          "likes": 3143,
          "timestamp": "What pisses me off, is that a YouTuber can get all this information and reach these"
        },
        {
          "text": "criminals to the point where he could affect them. But our governments or law\nenforcement ain’t doing anything about it. Great work! But it shouldn’t have to be you\ndoing this stuff",
          "author": "Unknown",
          "likes": 3055,
          "timestamp": "I can never understand how independent investigators can do all this stuff, but the FBI or"
        },
        {
          "text": "MI5 can't?",
          "author": "Unknown",
          "likes": 3044,
          "timestamp": "I'm sad to think that it requires Mark & company to make law enforcement do their jobs"
        },
        {
          "text": "by essentially embarrassing them by, quite frankly, being more effective and proactive\nthan the authorities here in the US and India.  Mark and his friends are great world\ncitizens.",
          "author": "Unknown",
          "likes": 3015,
          "timestamp": "I still upsets me knowing scammers got almost 10k from my grandmother about 12 years"
        },
        {
          "text": "ago. Everything you guys are doing is amazing and I just pray that people with the know\nhow keep outsmarting these scams.",
          "author": "Unknown",
          "likes": 2928,
          "timestamp": "Imagine how bad your police is when even international youtubers need to step in and"
        },
        {
          "text": "provide proofs for you, but at the end of the day, they still get away with it",
          "author": "Unknown",
          "likes": 2852,
          "timestamp": "Literally risking their lives for this.  So proud of everyone that made this possible."
        },
        {
          "text": "of it.",
          "author": "Unknown",
          "likes": 2816,
          "timestamp": "the fact that they actually risked their lives for this is wild! massive props for standing up"
        }
      ]
    }
  ]
}