{
  "channel_name": "Ryan Trahan",
  "channel_id": "",
  "videos_count": 10,
  "fetch_date": "2025-11-04",
  "notes": "Converted from PDF - 11 pages",
  "videos": [
    {
      "video_id": "video_2",
      "title": "I Tried Every Seat on the Most Expensive AirlineRyan: There is a seat on an airplane called an A380, that literally comes with a living room, a private bathroom, a private bedroom and a personal flight attendant. Now I have no business flying in that seat.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 It only exists on one airplane in the entire world. However, I owe my friend, Isaac a favor. His brother, David lives across the world in Singapore, and they haven't seen each other in 10 years. Isaac asked me to deliver David a letter and his favorite cereal from Time: 00:10 - 00:20 the US, all the way to his brother in Singapore. But if there's one thing I know: going on this adventure of writing in every single Time: 00:20 - 00:30 class on the most expensive airline in the world would be insane. But the only way that's gonna happen is if I could foot the bill on a sponsor. Time: 00:30 - 00:40 Thank you, Shopify! I packed my bags, made my way to the airport, and boarded my first connecting flight to Singapore. On my way to my seat, I did pass through business class. I'm not sure how you can even call this a seat. Time: 00:40 - 00:50 I also passed through Basic+. Look at that legroom! That's gonna be fun! And finally made it to my first seat of the video. Basic. So on this first flight, we are gonna be flying from JFK to Abu Dhabi, which is Time: 00:50 - 01:00 nearly a 13 hour flight. I'm most likely gonna be doing a lot of voiceover, because I'm socially awkward. Time: 01:00 - 01:10 I pass the time by measuring our legroom. 4 inches, by the way. And also just by staring out the window, until our first meal arrived, about 1 hour and 15 minutes into the flight. All right, lunch is served. Time: 01:10 - 01:20 Here's what we got: a water bottle, bottled at the source, a bread roll, covered in a nice layer of plastic. Chicken and rice, veggies, strawberry cheesecake and the nectar of the Time: 01:20 - 01:30 gods: Sprite. This looks really good. I'm excited. How's the chicken? Have you tried it? That's Betty. She didn't hear me. She wouldn't ignore me. We're actually friends. Time: 01:30 - 01:40 She's my basic buddy. Silverware. I don't think I've ever touched silverware on a plane before. This is crazy. This is like first class treatment in basic. I spent the next few minutes absolutely housing this meal. I mean, this is hands down the best meal I have ever had on an airplane. Time: 01:40 - 01:50 This food is so good. Shortly after finishing, I found myself in desperate need for the bathroom, which is a great opportunity for a tour. Greetings from the basic bathroom. Pretty...pretty basic. Time: 01:50 - 02:00 Yeah. We've got a sink. The tile is nice. Oh, it's not actually tile. The toilet is... it's definitely a toilet. The flush buttons got some use, but that's... That's a good thing. It's doing its job well. Time: 02:00 - 02:10 Overall, pretty fun in here. Uh, gets the job done. At this point, we're flying over the middle of the ocean and it's late. I tried turning on a light, but accidentally Time: 02:10 - 02:20 flashbanged Betty. So just bear with me with the lighting! Greetings! I will say that so far the service has been incredible. Just a bit ago I was in the bathroom, so I missed the coffee delivery. Time: 02:20 - 02:30 I asked the flight attendant for a coffee. She brought me a cappuccino and Oreos. This is my first time eating an Oreo, suspended 35,000ft in the air. It felt amazing. I drank my cappuccino. It was also delicious. I feel like I'm in first class, I do. Time: 02:30 - 02:40 I am so excited to go to Singapore. I remember when I was in like 8th grade, and we had a textbook that said Singapore is one of the nicest countries in the world, and ever since then I have dreamed of going. Time: 02:40 - 02:50 But I did not think I would be going to deliver a 40 year old man cereal. Regardless, it's happening. I'm gonna do some work and I will catch up with you soon. At this point, I crack open a bag of Cherry Berry Ropes, recline my seat, and open up my Time: 02:50 - 03:00 laptop for some top secret work. I'm working on my computer. I'm a hard worker. A few hours later, we got to watch the most mesmerizing sunrise ever. Time: 03:00 - 03:10 So I asked Betty to take a video of it. Ryan: She did a great job. Betty: It's recording, right? Ryan: Yeah, it's recording. It's so pretty. Betty: It's so hard to capture it, right? Ryan: I know, right. It really doesn't do it justice. Time: 03:10 - 03:20 Betty: Yeah, exactly. Ryan: Now that the sun is up, that means it's time for breakfast. The Basic+ section gets served first, which means by default, Betty and I get served last. We are in the last row, after all. Time: 03:20 - 03:30 But that just means I have more time to play Angry Birds and watch Trolls at the same time. Chante: Hi, guys! Chicken with rice or coconut curry? Ryan: I'll do the chicken. Chante: Chicken? Ryan: Yeah. Chante: It's very nice. Time: 03:30 - 03:40 It's like a burrito bowl. Ryan: Oh, yummy! Chante: With guacamole. Ryan: Okay. Chante: You've got nice hair, aye? Ryan: Thank you! Guess what's for breakfast? Chicken and rice, again. Time: 03:40 - 03:50 I watched this person play Angry Birds while I ate, and then decided to interview the flight attendants, because they have been amazing. Why are you guys so motivated to give such good service? Chante: We love our guests, so we always give our best. Time: 03:50 - 04:00 Ryan: Okay. What's your name? Chante: I'm Chante. Ryan: Where are you from? Chante: South Africa. Ryan: Really? Chante: Me and her and her. Jocelyn: How are you? So my name is Jocelyn. And the reason why I give good service is because I love people. Time: 04:00 - 04:10 I love socializing with the people. And I love Etihad. Girls: You got this, Ryan. Time: 04:10 - 04:20 Ryan: We have arrived to Abu Dhabi. I was mildly concerned about my cereal coming into a new country, but I got through Time: 04:20 - 04:30 it with ease. I would be celebrating right now, but I thought it was probably unwise to celebrate before my cereal gets through customs in Singapore. Regardless, this airport is awesome. Wow! Hey, this airport is insane. Time: 04:30 - 04:40 It's honestly pretty comforting. Maybe because there's a Texas Chicken directly behind me. Flight 1 complete, for the cheapest seat on the flight. Time: 04:40 - 04:50 That was a great experience. If it only gets better from here, I don't know how I'm gonna behave myself. Sorry for saying that! That's weird. Weird thing to say. If it sounds like I'm slurring my words, it's because it's 3 a.m. Time: 04:50 - 05:00 in the US. And since my next flight to Singapore is in 10 hours, I'm gonna go to sleep and keep this cereal safe. I hope it's still in here. It should be. Okay. Let's go to a hotel! Time: 05:00 - 05:10 I gotta find a better way to get these shots. Very nice. This is literally in the airport. Time: 05:10 - 05:20 I'm gonna go to sleep. Good morning! It's night time. I got out of bed, took a shower and got ready to board my flight to Singapore. Time: 05:20 - 05:30 I'm honestly just excited to fly on this airline again, especially because the cereal is still safe. Time: 05:30 - 05:40 I have arrived to my Basic+ seat. I cannot tell you how uncomfortable I am right now to be filming this, but I will say. I paid extra for this seat and it shows. Time: 05:40 - 05:50 Look at this legroom! I can't wait to measure that later. Also, my seat buddy moved right over to the left, because there was an available seat, which means this is basically first class. Look at this elbow room! Time: 05:50 - 06:00 So the next stop is Singapore. Let's see what it's like to live the Basic+ life! All right, I'm gonna stop recording. I can literally smell business class from here. It smells like luxury. They have lay down seats. Time: 06:00 - 06:10 I'm feeling a little FOMO, but honestly, I'm just ready for this thing to take off. Yeah, we took off. Okay. Let's go to Singapore! As I got situated, I realized most people are already asleep on this plane. Time: 06:10 - 06:20 If you're looking for legroom... Sorry, I took it all. 23 inches. It's crazy. Anyways, I got a tinkle. I have arrived to the Basic+ bathroom. Time: 06:20 - 06:30 It was fun to see everybody who's flying on the plane with me, but it was a long walk. This bathroom isn't so different from the last one. We've still got this beautiful tile that is not tile. Time: 06:30 - 06:40 The toilet does in fact flush. I tested it. There is soap, a sink, trash can, all kinds of paper products that you may need. And if you're a baby, a place to sit. Time: 06:40 - 06:50 I'm having a great time. However, I am currently experiencing a little bit of turbulence on this plane. So... I'm gonna go back to my seat. Time: 06:50 - 07:00 Just as I was walking out of the bathroom, I saw the flight attendant getting our dinner orders. Let's hope for some chicken and rice! Makayla: What would you like to eat? I have chicken with biryani and I have fish with rice and vegetarian pasta. Time: 07:00 - 07:10 Ryan: Can I do the chicken with rice? Awesome. Thank you! Yummy! Thank you! Alright. Dinner is served. Look at that! We've got The Good Life bread. Not sure what that means. Some vegetables, a specialty Time: 07:10 - 07:20 Etihad beverage. It's Coca Cola, that's what it is. Natural drinking water, chicken and rice, which looks delicious. This actually looks so good. And dessert: maybe banana pudding. Time: 07:20 - 07:30 I love banana pudding. It is literally midnight. This is the fanciest meal I've ever eaten at midnight. All of a sudden, I'm kind of panicking, because I haven't looked inside my luggage since I left, to check if the cereal is really in the box. Time: 07:30 - 07:40 I don't know why it wouldn't be. I just really wanna get David this cereal. Also just realized I have a hole in my shirt. So...that's awesome. Time: 07:40 - 07:50 Please excuse me while I devour this meal! That meal was so good. And now that I have a full belly, I decided to do a bit more work on my secret project. Time: 07:50 - 08:00 Top secret. Once again, I found myself with Oreos and other snacks. I'm just blown away by the generosity of these flight attendants. Okay? And as the sun was beginning to rise, I decided to see what the flight attendants Time: 08:00 - 08:10 for Basic+ had to say. Guys, we're almost in Singapore. I'm here with Makayla. Makayla: Hi! How are you? Ryan: She was my flight attendant today. Where are you from? Makayla: South Africa. Time: 08:10 - 08:20 Ryan: That's so fun. My last flight attendants were from South Africa, too. Makayla: They were great, right? Ryan: They were great. I love South Africa. Ryan: Can I tell you why I'm going to Singapore? Makayla: Why? Tell me! Ryan: I'm going to give a man cereal. Time: 08:20 - 08:30 Makayla: It's normal. It's crazy. It's normal. Ryan: That's true. Girls: You've got this, Ryan. Ryan: Yes. You got this, Ryan. Just the fuel I needed. I feel unstoppable. I'm sitting in my seat, and I'm just so ready to land. Time: 08:30 - 08:40 Okay, we landed, all right. As I was getting off the plane, the flight attendant invited me to meet the pilot. I don't know what's happening, but the captain is taking me with him all the way to Time: 08:40 - 08:50 the front of the plane. Pilot: Have you been in a flight deck before? Ryan: Never. Pilot: Then go ahead! Ryan: Now I can really say I've sat in every seat on this airline. Pilot: Yeah. Ryan: That's so cool. Thank you so much! I said goodbye to the team and got off the plane with no doubt in Time: 08:50 - 09:00 my mind. That's when I saw something that made me want to puke. Customs. Every country has different policies for what you can and can't bring Time: 09:00 - 09:10 into the country. And in terms of categories, food is one of the most regulated items. Let's see if this cereal gets through! Hello, for um...customs. Uh, for like food. Time: 09:10 - 09:20 Oh, okay. Alright. Thank you! I thought it'd be cool to get an ominous video of me looking out at this crazy view. I've always seen this airport in photos, but now I'm actually here. Time: 09:20 - 09:30 Figured I might as well get a video in front of it. Just for the record, that flight was awesome. The legroom was fantastic. The food was so good, the flight attendants were amazing, and I made it to Singapore. Time: 09:30 - 09:40 And guess what? I've got the cereal with me. I cannot tell you how relieved I was when I opened my suitcase, and it was actually in the box. I also have David's letter from Isaac. Oh, so cute! Brothers love each other. So I'm not meeting up with David for a little while, Time: 09:40 - 09:50 and I'm actually really tired, because it's like midnight in America, so I think I might take a nap. Good morning! Time: 09:50 - 10:00 It's not morning. I slept for 1 hour. If you also find sleep pods, capsule hotels really interesting, the Yotel Air in Singapore... It's fire. It's a good one. Time: 10:00 - 10:10 Anyways, I've got a cereal box to deliver. I really wanna make it look like I'm actually on an epic mission that matters. So I think I'm gonna make the next few clips like a dramatic cinematic sequence. Time: 10:10 - 10:20 I'll probably start right now. In a world where 2 brothers live in separate countries... Time: 10:20 - 10:30 Does this feel epic? I don't know. Can you guys just comment: \"Wow, Ryan, that was epic\"? There's only one man equipped to unite them. It's me. Ryan. Yeah, so I got a taxi to David's place and met him. Time: 10:30 - 10:40 Is this the end of the sequence? I hope it was good. Nice to meet you, David. Oh, this is so sick. David, I flew all the way here because of what's in this box. Time: 10:40 - 10:50 David: All right, I'm ready to see it. Ryan: Okay. Alright. You're gonna close your eyes. Three, two, one. David: Oh, Cracklin' Oat Bran. Time: 10:50 - 11:00 Dude. Yes! This is a great, great gift. This...we used to get this every Christmas morning. But, yeah, we just all loved this stuff. Thank you, Isaac! Time: 11:00 - 11:10 Ryan: Thank you, Isaac! David: This is so good. Ryan: David poured us both a bowl of Cracklin' Oat Bran, and we enjoyed a nostalgic meal together in Singapore. And that's when I gave him Isaac's letter. David: Dave, since you moved across the world, I know it's difficult for you to come home Time: 11:10 - 11:20 regularly. What's probably even harder, though, is that you have to go without some of the best food America has to offer. More specifically, the kind that mom used to give us with our stockings every Christmas. Time: 11:20 - 11:30 I hope this box of Cracklin' Oat Bran brings you back to those lovely childhood memories. Eat it slowly, because like all the best things in life, we don't fully understand how Time: 11:30 - 11:40 good things are, until they're gone. Miss you, brother. Isaac. Ryan: Now, Isaac has no idea about this part, but David's got a favor to ask as well. Deliver a letter back to Isaac and give him a Singaporean snack, straight from David's Time: 11:40 - 11:50 pantry. There's only one man for the job. It's me. I put it in my luggage, and yeah. I'll bring it back to him. All right. My job is only halfway done. I delivered the cereal, and now I've got something to deliver to Isaac. Time: 11:50 - 12:00 Mission part 2 has begun. I'm on my way, America. After that, I had a few hours before my return flight home. Time: 12:00 - 12:10 David took me around Singapore. It's a beautiful place. This is just so crazy. Like I said, I remember looking at Singapore in my textbooks in school, and I always dreamed of coming here. And I gotta say, it did not disappoint. Time: 12:10 - 12:20 Except for the fruit that I tried. It was...it was a unique. I didn't...I didn't really like it. David got a kick out of that. Eventually, I headed back to the airport and prepared for my business class seat. Time: 12:20 - 12:30 It comes with a private airport lounge, lots of food and drinks, but my flight was boarding, so I headed to the gate. Hello! 7C. Time: 12:30 - 12:40 Welcome to business class! I already took my shoes off and I don't even feel weird about it. They give you free slippers. Also, I was served this red juice almost instantly. Time: 12:40 - 12:50 It's watermelon juice. Guys! I had so much fun in Singapore. David is the best. The only problem is: I didn't really sleep. I got like 1 hour of sleep at Yotel Air, and that was pretty much my sleep for the Time: 12:50 - 13:00 night. This flight that I'm on right now is once again an overnight flight, and I'm pretty sure that my seat reclines all the way down, like I could lay flat. Time: 13:00 - 13:10 But I don't wanna sleep because I don't wanna miss out on any of the cool stuff you get in business class. What's on the menu? Business. Mhm! Yeah, we're not in basic anymore. Here's a quick list of things that come with the seat A pillow. Quite comfortable, I will Time: 13:10 - 13:20 say. Slippers. I already put them on. Why am I doing this with my feet? I don't know, but I'm in business class. A fancy blanket, this baggy, which comes with a face mask, earplugs, lotion, lip balm, Time: 13:20 - 13:30 face mist and toothbrush and toothpaste. Another pillow, perhaps to cuddle. I am tempted to sleep, but I'm also scared to miss out on any cool stuff that they would Time: 13:30 - 13:40 bring me. So guess who's staying awake? Me. As the flight is taking off, I've developed a plan to not fall asleep, in which Time: 13:40 - 13:50 I will be very strict about not even closing my eyes to blink. I fell asleep for 4 hours. Oh, my goodness! I don't even remember extending my seat into a bed. Time: 13:50 - 14:00 But here I am. One thing is for sure, this is the most comfortable airplane seat I've ever had. I'm not proud of it. I'm not. On one end, I missed out on 4 hours of business class luxury, but also did I, because I was laying Time: 14:00 - 14:10 fully down on an airplane. The flight attendant, when I woke up, she brought me coffee. Ryan: It looks really good. She was also like... Flight attendant: But you don't want any like main course or anything? Time: 14:10 - 14:20 Ryan: And I was like: Oh, yeah. I didn't. That's awesome. I didn't know I could still get it. Ryan: And she was like... Flight attendant: You haven't eaten anything, so... Ryan: I know. Thank you so much! And I said: I mean, I'll just do the fruit and I'll just get ice cream, just for the Time: 14:20 - 14:30 experience. And she said: \"Okay, that's crazy\". So I'm looking forward to that. I have not used the bathroom yet. Time: 14:30 - 14:40 I've got some work to do before we land. Let's get after it! Thank you very much! That was not only the best fruit I've ever had on an airplane. Time: 14:40 - 14:50 That was the best fruit I've ever had. That was so good. Ice cream. When In Rome. And then randomly, after eating, I got really emotional. Time: 14:50 - 15:00 Like about to cry. I can't tell if this is out of gratitude or because I just ate some solid ice cream, but either way, I need to pull myself together. Time: 15:00 - 15:10 Guys, I finally made it to the business class bathroom. It is nicer. It is. We do have the same tile as before, however... Look at all this other stuff you get! Time: 15:10 - 15:20 The hand soap is in a special container. The faucet does look fancier. It really does. You've got a nice assortment of hand products. Not one, but two mirrors. Time: 15:20 - 15:30 Also, potentially the best part when you're doing your business in business class... I mean, talk about elevated. There's a window. Babies can also sit here. I don't know what babies are flying business, but let's test this bad boy out! Time: 15:30 - 15:40 Sorry! I'm gonna use the toilet. I feel like a business mogul working up here. Time: 15:40 - 15:50 No, but really. This is so cool. Before landing, I freshened up with some complimentary face mist. We have arrived to Abu Dhabi. But as soon as we landed, 2 security guards came on the Time: 15:50 - 16:00 plane, asking for me. Ryan: How's it going? Security guard: Fine. All good. Ryan: Awesome. I'm good to go? All right. Thank you. I don't know what I did wrong. Time: 16:00 - 16:10 I don't know if I'm in trouble, but 2 men personally took me off of this airplane, and are now driving me in this little car thing to... I don't know where. It felt like we were driving for hours, until eventually they Time: 16:10 - 16:20 dropped me off at a private suite. What in the world is going on? I literally thought I was getting escorted off the plane because I was a little gassy. Time: 16:20 - 16:30 Some things just don't sit right with my stomach. I don't know what it was. Maybe it was the durian. Shout out to David. I cannot believe this is real. I don't know what to say. I have an abundance of fruit and pastries. Time: 16:30 - 16:40 I have a waiter named Ollie. I think he's bringing me salmon. I think it's 1 a.m.. Why? Why is that even available? The people that have seen my boarding pass, they kind of look at the part where it says Time: 16:40 - 16:50 \"The Resi\", and they're like: \"Oh, oh! Hello, sir\". Before I show you this private room that I'm in, just for the record, business class was amazing. I did sleep for like half of it, but it was extremely comfortable. Time: 16:50 - 17:00 The service was amazing. It was dark the whole time, so the vibes were cozy. I have nothing bad to say about business class. Do I miss my old flight attendant friends? Time: 17:00 - 17:10 Yes. But honestly, it's hard to focus on how good that was, whenever I get escorted off the plane immediately, and brought to a private room that has a toilet in it. Let me show you around! Looks like we have coffee and Voss water, abundant fruit and pastries, a huge couch, a Time: 17:10 - 17:20 luxurious dining table, and an entire bathroom with a shower in it. What? Who is this for? Time: 17:20 - 17:30 If this is before the flight, what have I gotten myself into? Now really. This is crazy. I sat down at my dining table for some salmon. I still can't believe they have someone making this good of food in the middle of the Time: 17:30 - 17:40 night. After that, the 2 security guys picked me up and took me to the gate for our final flight. Guys, this is unbelievable. Time: 17:40 - 17:50 I immediately walk in to my coffee order. I enjoyed my cappuccino and played some Angry Birds. Some things never change, I guess. Time: 17:50 - 18:00 I don't even think the flight has officially begun boarding. This is gonna be crazy. And we're off. A 13 hour flight back to the United States, and I am flying in the Time: 18:00 - 18:10 residence. There's so much stuff that comes with this seat, I don't even think I can call it a seat. Frankly, if you ask me what this background is, before I step foot in here, I wouldn't even be able to tell you it's a plane. Time: 18:10 - 18:20 This looks like an apartment. I can't believe I'm about to say this about an airplane seat, but how about a tour? This is the main seating area with a TV and 2 seats. Time: 18:20 - 18:30 This time we have not one, but two blankets. This bench area has, um, an entire refrigerator, fully stocked with sodas and Voss water. What in the world, man? This is crazy. Time: 18:30 - 18:40 The other benches are for storage. You can put stuff in there. This seat also comes with noise cancelling earphones, which work great, if you want to prepare to watch the Penny Series movie. The seats also have buttons that can assist you during the flight. Time: 18:40 - 18:50 Look what happens if you press the fork button! Oh, wow, a snack! Just kidding. The flight attendant brought it. It was just a joke. But this fun drink is not a joke. There's also a charging station and a touch screen remote control. Time: 18:50 - 19:00 But now for the reason they call this seat the residence. All right, this is ridiculous. A little bit of turbulence. Time: 19:00 - 19:10 To my left is the bathroom. And you, you are standing on a bed. I mean, this is outrageous. Isn't this crazy? I am on an airplane. So this is a big bed. I'm definitely gonna be taking a nap. Time: 19:10 - 19:20 What is this? Okay, so they literally give you jammies? Do I anticipate a jammie time tonight? That would get crazy. There's also a really thick sleep mask. Slippers. They also give you tons of nice skincare. Time: 19:20 - 19:30 I'm definitely taking this home. And the last feature of the residence? A private bathroom with a shower. I don't know, I don't get it. I don't get it. This bathroom is actually so nice. We're still rocking the tile from basic. Time: 19:30 - 19:40 I love it. Pretty standard stuff up here, but this little towel rack is cute. Once again, not one, but two mirrors. And yeah, the fact that there's a shower in here is absurd. Time: 19:40 - 19:50 I came back to the main seating area and had a steak dinner, which I absolutely housed. And while I was doing some top secret work in my bedroom, I got a notification that said: Time: 19:50 - 20:00 \"We left another surprise for you. The best on earth\". Guys, they have Joyride. Isn't that crazy? Okay, I asked them to put that there. You may be wondering: \"Ryan, what were you absolutely locked in on on your computer for Time: 20:00 - 20:10 the past few days?\". Well, I love doing work on airplanes, and I have been spending some much needed time on Joyride's Shopify. The Joyride website is pretty built out, but I just like having fun with it. Time: 20:10 - 20:20 The best part about Shopify is: you can literally build anywhere. I'm in the troposphere. I think that's where I am. I've been considering making a subscription for Joyride customers who want a candy refill every month. They might as well get a Time: 20:20 - 20:30 discount. And Shopify's subscription app makes it extremely easy. The only problem is: we've kind of had trouble staying in stock, so that would most likely be a bad idea right now. The point is, the option is there. But Shopify Magic is what I've been doing on this entire trip. Time: 20:30 - 20:40 It's as fun as it sounds. I've been working on a landing page. I'm just calling it landing page. Feels like an airplane joke. The only people who will ever know about it, are watching this video. Time: 20:40 - 20:50 I used Shopify Magic for AI product descriptions. Look at this! I asked it to describe my candy with some airplane puns. It crushed it. That's...that's amazing. Time: 20:50 - 21:00 Also, the background removal tool for product images. So nice. And finally, I made the candy automatically 20% off, because if you find this page, you deserve it. Come on! Honestly, we would not be able to do what we do at Joyride without Shopify. Time: 21:00 - 21:10 It is the best commerce platform in the world. If your dreams are small, if your dreams are big, Shopify is the place to build a business. And you can get started with Time: 21:10 - 21:20 a free trial using my link shopify.com/ryantrahan. Shopify, I love you. This video would not be possible without you. With that being said, I think I am going to go night-night. Time: 21:20 - 21:30 It's Jammy time. Time: 21:30 - 21:40 As you can see, the service here is amazing. I looked through the menu. The crazy thing about this seat is: you just order on demand. Time: 21:40 - 21:50 So I ordered some breakfast, and by the time I was done looking out the window, it had arrived. I mean, are you guys seeing this spread? We've got a green smoothie with a latte, fresh fruit, a muffin, croissant and butter Time: 21:50 - 22:00 and jam. I feel like I've eaten so much food in the last 12 hours. This looks amazing, though. What should I try first? Iced latte. Bottoms up. Time: 22:00 - 22:10 That's insane. A bit of watermelon. Fruit of royalty. Mhm! That's good fruit. Look, guys! I'm really enjoying this. Time: 22:10 - 22:20 We have about 2 hours left in this flight. I can't even describe how nice this has been. It doesn't feel real. I could be dreaming. You could be dreaming. You could be dreaming about me dreaming. Time: 22:20 - 22:30 But don't forget: the job's not finished. There is a man in America expecting me to deliver a Singaporean gift from his brother. Time: 22:30 - 22:40 It's Isaac. Talking about Isaac, we just have a few more obstacles to overcome. He said from the residence. Now I'm worried about customs again. But how much can you really worry in this seat? Time: 22:40 - 22:50 Hey, guys! Welcome to my morning routine in the air! We are landing very soon. I have a private bathroom. I think I'm gonna use it. Unfortunately, the shower isn't working. Time: 22:50 - 23:00 That would have been so cool to shower in the air. But at the end of the day, the fact that there's even a shower to look at is enough for me. I can't get over all this skincare they give you. I don't know how to use it correctly, but I am gonna bring it home for Haley. Time: 23:00 - 23:10 She's gonna be excited. Oh, yeah. Morning routine in the residence. First I brush my teeth. I put on deodorant. Smells pretty good. Next I shave. Time: 23:10 - 23:20 There's literally a little bit of...of hair there, on my chin. So I shaved it, took off my jammies, did some skincare and threw on Cologne, which burned my skin because I just shaved it. Last few minutes. Time: 23:20 - 23:30 Dang, boy, that's shiny. This has been a once in a lifetime opportunity. I can't believe it. Time: 23:30 - 23:40 Isaac: Hey! Ryan: Hey! Here we have a delivery all the way from Singapore. From your brother, David. This is very exciting. Time: 23:50 - 24:00 David loved his gift. But will Isaac love his? This is the question. Ryan: Are you ready? Isaac: Yeah. I'm ready. Ryan: Close your eyes! Isaac: Okay. Ryan: We'll save this for later. And here we go. Alright, Isaac. Three, Time: 24:00 - 24:10 two, one. Isaac: Salted egg fish skin. Ryan: Your favorite. Isaac: You brought this in America? What is this? Isaac: Oh! Ryan: Oh! Time: 24:10 - 24:20 All the way from Singapore. Cheers! That's kind of gas. Isaac: It's actually really good. Ryan: Okay, now for the real surprise. He got you a letter. You can go read it over there. Time: 24:20 - 24:30 I'll give you privacy. Isaac: Isaac, bro, I miss you. I miss all the good times we've had and your humor. You are always the one to lighten the mood and keep everyone laughing. Time: 24:30 - 24:40 I hope everything is going well in Austin. A great quote I learned recently is: \"A goal without a deadline is just a dream\". Remember, it's important that we are purpose driven. So create a vision, mission and goals to get where you want to be! Time: 24:40 - 24:50 Then put your head down and grind relentlessly! You will succeed. Isaac: David. Ryan: Aw! That's sweet. A couple weeks later, I found myself walking into Target, just to see what Time: 24:50 - 25:00 Joyride is gonna look like in the candy aisle on June 15th. And as I was leaving, something caught my eye. Time: 25:00 - 25:10 You made it to the end of the video. Thank you for watching! YouTube thinks you're really gonna like this video. Time: 25:10 - 25:20 Click here! Check it out! Time: 25:20 - 25:30 I didn’t think you would actually do it 🤣",
      "comments": [
        {
          "text": "is so wholesome and chill.",
          "author": "Unknown",
          "likes": 5895,
          "timestamp": "You are not socially awkward, Ryan. Youre just awkwardly social"
        },
        {
          "text": "inspires me.",
          "author": "Unknown",
          "likes": 4541,
          "timestamp": "10:32  \"WOW RYAN THAT WAS EPIC\""
        },
        {
          "text": "friends and is kind to those he meets",
          "author": "Unknown",
          "likes": 1445,
          "timestamp": "Ryan getting emotional out of pure gratitude is the exact reason he’s such a loved"
        },
        {
          "text": "YouTuber",
          "author": "Unknown",
          "likes": 1433,
          "timestamp": "\"Because I am socially awkward\""
        },
        {
          "text": "Wrong Ryan, you are awkwardly social.",
          "author": "Unknown",
          "likes": 1047,
          "timestamp": "Ryan realizing that he experienced something only few people do is very humane. What a"
        },
        {
          "text": "great person.",
          "author": "Unknown",
          "likes": 959,
          "timestamp": "Betty is the chillest person ever, she deserves an award for most chill"
        },
        {
          "text": "YouTuber",
          "author": "Unknown",
          "likes": 768,
          "timestamp": "Top Tip Ryan:"
        },
        {
          "text": "Never EVER show your boarding pass to social media. (Especially the barcode)\nHackers can read the data it shows and find a lot of info such as your booking reference,\nthus addresses and passwords to your airline account.",
          "author": "Unknown",
          "likes": 646,
          "timestamp": "The ladies were so kind and also the way they said \"you got this Ryan!\" Was so cute 🥹"
        },
        {
          "text": "Edit: omg guys your blowing up my phoneee",
          "author": "Unknown",
          "likes": 641,
          "timestamp": "Love Jocelyn's energy 😭 ❤ such a queen"
        },
        {
          "text": "seed less watermelon.",
          "author": "Unknown",
          "likes": 483,
          "timestamp": "South African people are so friendly and full of life. The first and second girls rocked so"
        },
        {
          "text": "hard ❤",
          "author": "Unknown",
          "likes": 464,
          "timestamp": "You have an experiment that everyone wants to try one at a time. That's freaking cool"
        },
        {
          "text": "you film it and the way you clearly express your gratitude is so meaningful; it makes me feel\nlike I'm there experiencing it myself, rather than sitting in my bed feeling envious or\nwhatever.",
          "author": "Unknown",
          "likes": 425,
          "timestamp": "\"And the nectar of the Gods... Sprite.\""
        },
        {
          "text": "You just got yourself a new subscriber.",
          "author": "Unknown",
          "likes": 413,
          "timestamp": "Only Ryan Trahan would travel across the world just to give cereal to his friend as opposed"
        },
        {
          "text": "to shipping it",
          "author": "Unknown",
          "likes": 396,
          "timestamp": "Seeing Ryan thrive makes me so happy. This guy deserves all of the success he's"
        },
        {
          "text": "achieved and more.",
          "author": "Unknown",
          "likes": 389,
          "timestamp": "So happy to see South Africans in the video... I felt so proud!"
        },
        {
          "text": "enjoyed every moment. 󰺘󰺘",
          "author": "Unknown",
          "likes": 350,
          "timestamp": "8:55 glad you enjoyed being seated in the cockpit Ryan! ✨"
        },
        {
          "text": "That was epic, bro",
          "author": "Unknown",
          "likes": 276,
          "timestamp": "10:30 Wow, Ryan That Was Epic!"
        },
        {
          "text": "Wow! Thanks for over 100 likes!",
          "author": "Unknown",
          "likes": 264,
          "timestamp": "Bros life is literally built around side quests 😂"
        },
        {
          "text": "the video btw!",
          "author": "Unknown",
          "likes": 253,
          "timestamp": "thank u Shopify"
        },
        {
          "text": "Honestly though it's really nice to see everyone get emotional here especially the\nletters/gifts they were really sweet! ❤",
          "author": "Unknown",
          "likes": 240,
          "timestamp": "Jocelyn was so sweet, she was READY for that interview and I love her personality"
        },
        {
          "text": "would make it there 😂. I'm stealing this trick!",
          "author": "Unknown",
          "likes": 218,
          "timestamp": "Okay why is nobody talking about Jocelyn, like she is such a vibe, love her!!!! ❤ 😭 ❤"
        }
      ]
    },
    {
      "video_id": "video_3",
      "title": "I Spent 100 Days in the Metaverse Ryan: The metaverse. Ever heard of it? If not, click off this video right now! Run as far as you can, as fast as you can, and never click on this video ever again, if you care about your life at all! But if you have, welcome! Here's a refresher. It's a 1 to 1 replica of the real world.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 All right? And the idea is that everyone you know and love exists virtually. And a headset like this that cost way too much money. In fact, it cost more than my dog. Spock cost $100. Time: 00:10 - 00:20 Don't do this, father! That was me. I said that. 1 metaverse day is apparently 30 minutes in real life time, and I'm gonna be spending the next 100 metaverse days in this headset. I've got everything I need to survive: a mini fridge, a coffee maker, a bed, a hologram of Time: 00:20 - 00:30 Shrek. It makes me feel safe at night. And if I want, I can even tap the headset like this and see my false reality. Time: 00:30 - 00:40 My goal? Become the most famous person in the metaverse, because that person right now is definitely Mark Zuckerberg. Not for long, Marky. And as I took my last look at the real world, there was only one question in my mind. Time: 00:40 - 00:50 What if no-one likes me? Yeah, well, that's already true in real life. So this is my reality for the next 100 days. Time: 00:50 - 01:00 My time will be spent in game as the man I wish I was in the real world. Bryan. Now I'm 6'4\", confident and not lactose intolerant. Time: 01:00 - 01:10 I have a beard in real life. This is...this is like...I look like this. He didn't look like that. I loaded into my first metaverse world, and I was immediately baffled by what I was Time: 01:10 - 01:20 witnessing. Okay? A group of, like, 7 or 8 people all cuddling each other, except for one guy in a stormtrooper outfit. Yo, is anybody here normal? Time: 01:20 - 01:30 Girl: Or you never know. Klay: I think so. I think I'm normal. Ryan: If I'm gonna survive 100 days here, I need a friend. I need a BFF. Klay: Accept my friend request, whatever. Because I'm the only normal person here. Time: 01:30 - 01:40 Trust me! Ryan: Making friends here is so much easier than in real life. Look at that! I just clicked a button. Klay is our first. He's first friend in the metaverse. Call me Bryan! Time: 01:40 - 01:50 Klay: Bryan. Okay. Come on, Bryan! Now, the weirdest thing you'll see in this game, 100% is...there will be people that will just stand in front of mirrors and just stand in front of the mirror all day long. Time: 01:50 - 02:00 There's probably people. Come on! Klay: I'll show you. Ryan: Klay was right. There were 14 people just looking at themselves in the mirror in the metaverse. Who does that? Dude, my arms look massive. Time: 02:00 - 02:10 Yeah. Klay: You probably need to change your avatar to something more like... Ryan: Klay didn't want to say it, so I will. Turns out my avatar is a direct clone of a real life YouTuber, Time: 02:10 - 02:20 Moistcr1tikal. I didn't realize it until now, but I guess if I could recreate myself in real life, apparently he's exactly what I wanna be. Which is mildly embarrassing, mostly because it's a real dude. Time: 02:20 - 02:30 Klay: I mean, you could be a Stormtrooper with me if you want. Ryan: Did you hear what I just heard? You can be a Stormtrooper. I never thought I would hear those words in my adult life ever again. Time: 02:30 - 02:40 I have a mission here. I'm not gonna play around and act like I'm a Storm... I'm having so much fun. Time: 02:40 - 02:50 I'm not gonna lie to you guys. I was having the time of my life. But then the absolute unimaginable happened. Klay completely froze. Eden: I think the helmet is restricting the blood to his head. Time: 02:50 - 03:00 Ryan: What did he just say? Are you actually okay? Oh, Klay, he's on the floor. Time: 03:00 - 03:10 Is he on the floor in real life? I'm concerned this is actually a medical emergency at this point. Yep. It was confirmed. We lost Klay. The only nice person I've found here so far. I felt lost without him. Time: 03:10 - 03:20 That was Day 5. On Day 7, I tried talking to people and got so scared. Amber: This old man just took my stuff. Bram: Hello? Amber: This old man is harassing me. This old man is harassing me. Time: 03:20 - 03:30 Ryan: Being alone again made me feel like a Facebook mom's post when her husband leaves for a 2 day work trip. Anyways, on Day 9 I played mini golf by myself. Horribly, by the way. On Day 11, I was gonna play some laser tag, when I saw an invite Time: 03:30 - 03:40 from our best friend. Ryan: Oh, wow! I just got an invite from Klay. Klay: Bryan! Ryan: Klay! What's up, dude? Time: 03:40 - 03:50 Klay: What's up, buddy? Ryan: Long time no see. It had been a full week in the metaverse without him. Klay and I caught up over a game of chess, when he started petting his dog in real life. Time: 03:50 - 04:00 And it just made me realize, like this... This is a real dude. Klay is real. Klay: I'm sorry, Daisy! Would you go? Who's a good girl? Yes, you are. Yes, you... Yes, yes. Time: 04:00 - 04:10 Ryan: Then we danced in the mirror. Klay called it shaky breaky. On Day 12, Klay and I just played with some ducks. I'm nervous to tell him about me trying to get famous and stuff. And honestly, I'm having fun, so... Time: 04:10 - 04:20 Day 13. We had a blast at a military base. Then I went down a slide at McDonald's. It was awesome. And finally I had my first tough conversation with Klay. Klay: How tall are you in real life, Bryan? Time: 04:20 - 04:30 Be honest with me! I don't care, I'm just curious. Ryan: He's asking about my height? What are the odds he asks about the one thing I'm trying to hide? Time: 04:30 - 04:40 Do I lie? Do I lie to Klay right now? Do I tell him the truth? Is he gonna like me if I'm 5'8\"? 6'4\". Klay: What? You don't look 6'4\". Time: 04:40 - 04:50 Ryan: I completely froze in that moment. How do I not look 6'4\"? How tall are you? Klay: I'm 5'10\". Ryan: I panicked and changed the subject, and just came clean about me trying to get famous Time: 04:50 - 05:00 here. Klay: You've come to the best possible person. Ryan: Okay. Klay: Look at me! Man to man. Mano a mano. Stormtrooper to Stormtrooper. Time: 05:00 - 05:10 Ryan: Okay. Klay: I have a way with words, I have. I'm gifted. So it's just... that's facts. Ryan: You are. Klay: Thank you! And I will campaign for you. Time: 05:10 - 05:20 Ryan: Come here! All right. Have you ever passionatly hugged someone virtually that you will never, ever see in real life? It was a special moment for me. Klay: I'll be right back. I gotta take out my...my dog. Time: 05:20 - 05:30 Ryan: All right. Klay: She's gotta pee. Ryan: And that's when Haley came up the stairs to bring me lunch. Ryan: Hey! Haley: Whoa! Haley: I can see what you're seeing. Ryan: I know. Time: 05:30 - 05:40 Is this my burrito? Haley: Yeah. Ryan: Oh, thank you so much! Oh, this is so trippy. That's a Chipotle burrito. We normally eat lunch together around this time, but I actually have to go back to the Time: 05:40 - 05:50 metaverse and talk to my friend, Klay. So... Haley: Alright. Well, I'll see you. Ryan: That's Bryan to you. Haley: Okay, Bryan. Ryan: I could hear the doubt in her voice. But Klay and I were on a mission. Time: 05:50 - 06:00 He literally went up to countless people telling them I was the king of the metaverse. That's Darth Vader right there. Nodding in agreement. And before long, they were just random people saying this. Time: 06:00 - 06:10 Klay: Bryan is the king of the metaverse. Toastwastaken: And he has a huge pe... Ryan: People seem to be responding well to me being the king here. Vlad: Yeah, Bryan, I'm gonna add you since you're gonna be famous one day. Ryan: Dude, add me! I'm gonna... Time: 06:10 - 06:20 I'm gonna be the king of the metaverse. And just as Klay and I were building momentum, his headset started dying. Which means Klay started dying. My headset can't die, because I'm hard wired to my computer. Time: 06:20 - 06:30 Which means I'm trapped, baby. Yay! Klay: I can't feel my hands. Ryan: Oh, no! Ryan: No! Klay: Bryan, give me a hug before I go! Time: 06:30 - 06:40 Ryan: No! Klay: Come here, my brother! Ryan: I can see your butt cheeks inside... Inside of your body. We got one final pose in our outfits, before Vlad broke the news. Time: 06:40 - 06:50 Vlad: Klay is dead. Klay is dead. I don't know how that happened, but he's dead now. Time: 06:50 - 07:00 Ryan: Oh, this is so weird. I feel like I'm actually in a video game myself. Stop watching me! I am devastated, but I have to keep moving forward. Time: 07:00 - 07:10 And I realize that I haven't even taken care of my bot, like my real life body in a solid 8 hours. So I started doing that. Are we almost out of toilet paper? So I picked myself up, wiped myself, Time: 07:10 - 07:20 hopefully. I thought it'd be a good idea to get some exercise in. On Day 19 I just went to Minecraft, which... that's cool. On Day 20, I went to the movies, watched my own video, hated it. Time: 07:20 - 07:30 And at this point, I'm having second thoughts about all of this. I'm having second thoughts about who I even am while playing Among Us. I am the impostor. My name isn't even Bryan. Time: 07:30 - 07:40 Children will believe anything. See ya, suckers! This is frankly becoming crazier and more nauseating by the second. Time: 07:40 - 07:50 Hey, Siri? Call Domino's! Now that I'm not lactose intolerant, I ordered a 4- cheese pizza under the name. Yes. It's gonna be for Bryan. Time: 07:50 - 08:00 This is a pretty depressing visual here. I'm literally, like, trapping myself on purpose to this headset. The cable was barely long enough for me to reach the pizza. Time: 08:00 - 08:10 Beautiful cheese pizza. I think. I was about to eat a slice when I saw this. Remove headset. Nice try. I'm gonna get ready for bed. Time: 08:10 - 08:20 Which means: metaverse nighttime routine. First I brush my teeth, then I turn off the lights as I experience existential dread and a deep regret of my life decisions. Then I try my best to clean decaying food off of my sleeping area. Time: 08:20 - 08:30 I never do a very good job though. And then I cry myself to sleep. Time: 08:30 - 08:40 Yay! Metaverse day 36. Time: 08:40 - 08:50 We have no friends online whatsoever. ThreeWar: So how are you? How is your guys's day today? How was your guys day today? Ryan: I was having a deep talk over morning coffee with that guy I met, Vlad. Time: 08:50 - 09:00 Vlad: Klay is dead. Ryan: Yeah. That guy. And he asked me this question. Vlad: Wait! I have a question. Who's your grandpa? Ryan: How does he know what's going on with my grandpa's situation? Time: 09:00 - 09:10 You guys know this by now, but I'm trying to get Dr. Phil to be my legal grandfather. His agent agreed to let me ask him in person if I pass him in subscribers. She didn't think it would happen. That was 6 months ago. And we've been gaining on him, and we are so close. Time: 09:10 - 09:20 Please help me finish this war! I want a grandparent. Anyways, on Day 40 I got stuck in a maze. On Day 42, I watched a lunar eclipse from the moon. Day 44 I went to a lake. Day 46 got lost in the desert, and on day 48 I went back to McDonald's. Time: 09:20 - 09:30 It was Klay and I's favorite place to hang out, but it was just sad and scary and full of Cool Ranch Doritos. Doritos: Hello? What's up? Time: 09:30 - 09:40 Ryan: We made it halfway. I'm not having fun anymore. I'm barely taking care of myself, and I'm literally eating like there is no tomorrow. Time: 09:40 - 09:50 I got McDonald's. Going out is overrated. You have no idea. Time: 09:50 - 10:00 McDonald's, Happy Meal. Yay! Again, the goal is to be the most famous person in the metaverse. Time: 10:00 - 10:10 But you know what I never did? And the reason? I was probably lame in high school, I never threw a party. I'm gonna throw the biggest party the metaverse has ever seen. Time: 10:10 - 10:20 Meta Bryan will be a household name. But first, I need some coffee. I'm feeling kind of fatigued right now. For the past 2 days, I've been on a strict diet of caffeine and cholesterol. It's only natural that I celebrate by throwing the sickest party of all time. Time: 10:20 - 10:30 Ready? I'm throwing a crazy party tonight. It's private. Nobody was listening to me, so I had to come up with some lies to seem cool. Time: 10:30 - 10:40 Skrillex is DJ-ing. It's at a private mansion. And just like that, I started getting friend requests left and right. I was showing people how confident I am and that I really am good at partying. Time: 10:40 - 10:50 It's invite only. I'm giving away $100,000. Koi: Yes, my friend. I will come, I will come. Come with me, my friend! Ryan: It worked. I literally had more friends that I could even count. Time: 10:50 - 11:00 So many people are coming to Meta Bryan's crazy metaverse party. There was only one person missing. But I couldn't let that stop me from having a good time. Time: 11:00 - 11:10 Woo! I can't hear you. It's so loud in here. Koi: Yes, my friend. I bust moves. Time: 11:10 - 11:20 Ryan: Yes. This is Koi TheBoi. Might be the funniest dude I've ever met in my entire life. Koi: I just throw hands in air. Ryan: I just... Yes! Time: 11:20 - 11:30 Ryan: Yeah! Koi: Shaky breaky. Shaky breaky. Shaky breaky. Stoney, you're killing it, dude. Stoney: Thank you, thank you! Time: 11:30 - 11:40 Ryan: Yeah. Stoney: You're beautiful. Oh, no. Ryan: Oh, gosh! Hey! Whoa, whoa, whoa! I'm married. Koi: Now I do 360. Shaky breaky. Time: 11:40 - 11:50 Koi: Yes, my friend. Ryan: Yes, my friend. Koi: Chug chug chug chug chug chug chug chug chug chug. Time: 11:50 - 12:00 Ryan: The party was over, and I don't care about the popularity thing anymore. All I wanna do is have a conversation with one person. One person. Time: 12:00 - 12:10 Where are you, Klay? We did it. That was kind of the craziest party of the year. I'm a pretty big deal in the metaverse. Time: 12:10 - 12:20 You would have gave KoiTheBoi a run for his money. \"Shaky breaky\"? That's your thing, Klay. I couldn't even look at him anymore. Time: 12:20 - 12:30 I promised myself this would be my last \"Shaky breaky\" ever. Time: 12:30 - 12:40 I tried to run away from my emotions, but everywhere I look, I see like...an empty chair? Really? That's convenient. At this point, I'm ready to be done with this. Time: 12:40 - 12:50 What a night... Oh! We did it! Time: 12:50 - 13:00 Ah, it's so itchy. Time: 13:00 - 13:10 Ah! Good night! I'm probably gonna do one of those cool transit... Time: 13:10 - 13:20 Uh. Day Time: 13:20 - 13:30 76. You are about to witness my final day in this headset, like Earth Day. On day 78, I went to a cartoon world that was actually pretty scary. Time: 13:30 - 13:40 And that's when I heard someone coming up the stairs. Turns out my dad's been trying to check on me for 2 days. Time: 13:40 - 13:50 Ryan: Hey! Ryan's dad: What a mess. Ryan: It's not that bad. Ryan's dad: So you've literally been living up here? Ryan: Yeah. Then I vented to my dad about Klay, so... It's honestly pretty sad and boring if you Time: 13:50 - 14:00 don't have, like, a friend to do this with. Kind of like life, huh? Ryan's dad: Yeah. Kind of like life. Ryan: This is actually sad. My dad loves to cook, and he tried showing me his dinner last night. Time: 14:00 - 14:10 Can I be honest? I have no idea what I'm looking at right now. Ryan's dad: Hamburger. Hamburger. Hamburger. Ryan: I said goodbye to my dad. I gave him a hug, and then he tripped on the pizza box. Time: 14:10 - 14:20 I really enjoyed just sitting and talking with him. It made me realize I take it for granted sometimes, you know. Day 80 I went to Mars. Day 84 I went to Paris. Time: 14:20 - 14:30 It was beautiful. On day 87, I drove a race car. Then I crashed it. Day 90, I was somewhere I don't even know. It was pretty. Day 92 Time: 14:30 - 14:40 I went to the zoo. And then... We're almost done. It is super late. I think...Just twiddling my thumbs right now in space. Time: 14:40 - 14:50 I hate this. Yeah, I don't like. I don't...I... Oh, my gosh! Who is that? Time: 14:50 - 15:00 Hey! See ya! Pretty sure my acne is having a city council meeting on my forehead right now. You know, I'm not trying to be too serious here, but...I wanted to do this, because I Time: 15:00 - 15:10 really feel like this is gonna happen. Like, I really feel like...this is where we're headed. And the only person I met that I actually like. I don't even know how to contact them. Time: 15:10 - 15:20 I don't even know how to...I don't even know how to ask Klay to...to exist. And you've been watching this whole time. Time: 15:20 - 15:30 What do you want me to say? I was nourishing my body one last time, when the most unreal Time: 15:30 - 15:40 thing happened. I got an invite from KlayViktor02. Time: 15:40 - 15:50 Ryan: Klay! Klay: What's up, body? Ryan: I caught Klay up on the party and how this dude stole his \"Shaky breaky\" thing. And then we danced in the mirror at McDonald's, and that's when it hit me. Time: 15:50 - 16:00 Klay, I have a crazy idea. This is actually crazy. Klay: What's that? What is it? Ryan: Klay could not believe his ears. Time: 16:00 - 16:10 And for this to work, I finally got to take off my headset. Is that him? Time: 16:10 - 16:20 Yo! What's up, Klay? How's it going, bro? Klay: Good, buddy. How you doing? Ryan: Good. Good to see you. Klay and I met up and got our favorite McDonald's orders. Time: 16:20 - 16:30 We actually had a great time together. Turns out he is 5'10\". He's an old soul, and he's lactose intolerant, too. Maybe the metaverse won't be so bad. Or maybe we just need to spend more time being ourselves. Time: 16:30 - 16:40It would have been so funny if Klay showed up to mcdonalds in his storm trooper outfit",
      "comments": [
        {
          "text": "an amazing video!",
          "author": "Unknown",
          "likes": 8067,
          "timestamp": "I can't imagine the JOY Ryan must have felt after hearing Klay's  \"What's up buddy\" at their"
        },
        {
          "text": "reunion. So wholesome!",
          "author": "Unknown",
          "likes": 7157,
          "timestamp": "Ok, Ryan and Klay's friendship is actually super wholesome"
        },
        {
          "text": "drama the PAIN. Inspirational.",
          "author": "Unknown",
          "likes": 5731,
          "timestamp": "I like how Ryan comes with the best and interesting idea, thumbs up."
        },
        {
          "text": "Networks in my MBA course and I’m gonna use this for context. Thanks!",
          "author": "Unknown",
          "likes": 4502,
          "timestamp": "Their friendship started because Klay wasn’t cuddling with people in the first meta verse"
        },
        {
          "text": "world 😅",
          "author": "Unknown",
          "likes": 4429,
          "timestamp": "Klay’s voice is so comforting and friendly what a great guy!"
        },
        {
          "text": "was actually watching a documentary about a tale of two friends enjoying their time in a non\nexistent world. That was amazing.",
          "author": "Unknown",
          "likes": 4249,
          "timestamp": "That irl meeting almost had me in tears. What a genuine, wholesome friendship."
        },
        {
          "text": "this wholesome",
          "author": "Unknown",
          "likes": 3170,
          "timestamp": "That was a masterclass in how to end a video"
        },
        {
          "text": "metaverse of 2022 he is the best",
          "author": "Unknown",
          "likes": 3113,
          "timestamp": "i love how Ryan tried making himself popular but he actually ended up making Klay popular"
        },
        {
          "text": "Edit : Thank you for 3k likes\n: D!",
          "author": "Unknown",
          "likes": 3048,
          "timestamp": "The whole story and friendship with Klay was incredible and honestly pretty"
        },
        {
          "text": "heartwarming ❤",
          "author": "Unknown",
          "likes": 2728,
          "timestamp": "I believe Metafront  will change Metaverse. forever."
        },
        {
          "text": "like I was gonna cry.",
          "author": "Unknown",
          "likes": 2512,
          "timestamp": "Can we just take a moment to appreciate how Klay was so kind to Ryan when he hadn't"
        },
        {
          "text": "even meet him yet.",
          "author": "Unknown",
          "likes": 2492,
          "timestamp": "Y'know. Klay really is a good person. He doesn't care about how many subscribers a"
        },
        {
          "text": "person has, or how famous they are. He stayed the same the whole video and Is a true\nfriend. Hope Ryan keeps a friend like that. Very rare",
          "author": "Unknown",
          "likes": 2441,
          "timestamp": "Let's honor Klay and appreciate how they made they're friendship and appreciate Ryan"
        },
        {
          "text": "surviving for 100 days in Virtual Reality without dying",
          "author": "Unknown",
          "likes": 2440,
          "timestamp": "Absolutely the best video I've seen in a loooong time here on YouTube. A Roller coaster. A"
        },
        {
          "text": "Masterpiece. *chefs kiss*",
          "author": "Unknown",
          "likes": 2333,
          "timestamp": "I hope you and Klay are still buds. This was so sweet 💜"
        },
        {
          "text": "try this too)",
          "author": "Unknown",
          "likes": 2015,
          "timestamp": "I love the way Ryan first met Klay•••walking in on Klay while he stood watching multiple"
        },
        {
          "text": "people cuddling, then proceeds to say he was normal 😭",
          "author": "Unknown",
          "likes": 2006,
          "timestamp": "I’m not even gonna joke, Klay is such a cool good person. He is such a freaking awesome"
        },
        {
          "text": "person. Thank you KlayViktor02 for being so awesome.",
          "author": "Unknown",
          "likes": 1939,
          "timestamp": "Ryan is less than 100,000 subs away from passing Dr. Phil!"
        },
        {
          "text": "Let’s gooo Ryan!",
          "author": "Unknown",
          "likes": 1880,
          "timestamp": "Shout out to my guy klay for keeping Ryan the company he needed throughout this hard"
        },
        {
          "text": "time 😔❤",
          "author": "Unknown",
          "likes": 1856,
          "timestamp": "The fact y’all met up in the end and went to McDonald’s was the most wholesome thing I e"
        },
        {
          "text": "seen in a while 😭",
          "author": "Unknown",
          "likes": 1854,
          "timestamp": "I was legit worried that Klay was never going to show up again, but he did, and I almost"
        },
        {
          "text": "teared up 😭",
          "author": "Unknown",
          "likes": 1854,
          "timestamp": "Honestly klay Is a type of friend anyone would hang around with, he's so nice and cool :)"
        },
        {
          "text": "Edit: Holy crap thanks so much for the likes, free tea for all of you 😩🍵",
          "author": "Unknown",
          "likes": 1784,
          "timestamp": "The fact that you and clay met up IRL at the spot you guys liked hanging out in the"
        },
        {
          "text": "metaverse put such a HUGE smile on my face. So cool that as a youtuber like yourself has\nthe ability to make things like this happen. I bet he had NO clue either bro hahaha",
          "author": "Unknown",
          "likes": 1768,
          "timestamp": "That was a roller coaster of emotions, I'm actually so glad Klay and Ryan met up. This"
        },
        {
          "text": "video was amazing.",
          "author": "Unknown",
          "likes": 1754,
          "timestamp": "Metafront is the best opportunity this year"
        },
        {
          "text": "edit: thanks for the likes :o :D",
          "author": "Unknown",
          "likes": 1707,
          "timestamp": "I wanna see a full length movie like this about a guy who goes into VR to escape his"
        }
      ]
    },
    {
      "video_id": "video_4",
      "title": "I Spent 100 Days in Realistic Minecraft Ryan: This is real life. This is Minecraft, and this is Minecraft with real life graphics. Dude, this graphics pack is insane. A real life day is 24 hours. A minecraft day is 20 minutes.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 I'm gonna do some quick maths. They are not the same amount of time. 100 Minecraft days is equal to 33 hours in real life, and that's how long I'm spending in real life Minecraft VR. A few minutes in, I was already so mystified by my own shadow. Time: 00:10 - 00:20 It felt like I was really there. That's not a good look. The first several days were boring. I collected resources, found these blue rocks, blah blah blah. Time: 00:20 - 00:30 But things got crazy when I got a vision for my base. A place like none other base. A place where no mobs could ever get me. A place that I'm calling The Platform. Time: 00:30 - 00:40 So yeah, the rest of Day 5, I kind of just got started on that. On Day 7, I had my first visitors. Good to meet you! Time: 00:40 - 00:50 Ryan: What's your name? Visitor: Huh? Ryan: I said, what's your name? Visitor: Huh? Ryan: I worked day and night on this vision of what I'm calling The Platform, and before long, it was complete. All right, Dr. Phil fan club. Time: 00:50 - 01:00 It's time to show you what I've been building for the past 9 days. The Platform! Time: 01:00 - 01:10 It's a platform. I'm calling it The Platform. Uh, pretty safe from mobs. It looks cool at night. All right? Look, I like it, and that's all that matters. Time: 01:10 - 01:20 It was time to go on a journey. I need to find a village. And on the night of Day 14, that's exactly what we did. Howdy! I came to this village for one reason. Time: 01:20 - 01:30 Business. I was checking to see what trades were available. And one of the farmers and I just hit it off. I'm following you around for the day. Okay? Hey, what's your name? I didn't get your name. Joseph: Hmnuhhh. Ryan: Joseph? Time: 01:30 - 01:40 Your name is Joseph. Joseph: Hmnuhhh. Ryan: Now, I'm gonna be honest. I have no idea what his name is. If you put what he said into Google Translate, nothing happens. I need a friend. So I'm naming him Joseph. Time: 01:40 - 01:50 And that's really none of your business. And on Day 17, our friendship deepened. Joseph, can we talk in private? What do you have to say? Time: 01:50 - 02:00 Not sure if you heard what I heard in Joseph's tone. But I've been playing this game for 6 hours, and my need for some sort of human connection led me to make up a fake narrative. And this is it. Joseph: I hate farming. Time: 02:00 - 02:10 I hate my dad. I want to leave this village and see the world. Maybe even go to a Taylor Swift concert. But most of all, I want to slay the Ender Dragon. Time: 02:10 - 02:20 Ryan: So yeah, that's what we're rolling with. The game plan is simple. The first thing I'm doing is destroying Joseph's dad's crops. Effectively making Joseph the best farmer in town. Time: 02:20 - 02:30 Joseph, I don't know if you're asleep right now, I literally can't... Your eyes are wide open, Joseph. Oh, my gosh! Goodness! Okay. You're awake. I'll come back for you and we'll beat that dragon. Time: 02:30 - 02:40 Okay? I have never beat that dragon, but we're gonna do it. Joseph: Dragon Deez nuts on your chin. Ryan: Joseph! With Joseph's dad so occupied on replanting his crops, we're gonna bust Joseph out of the Time: 02:40 - 02:50 village. Take him to the end, defeat the Ender Dragon, all without dying for the next 80 days. But on Day 20, we hit our first big roadblock. Oh, no! My hunger bar is low. Time: 02:50 - 03:00 I spent the next several days doing more boring stuff, but it was all to prepare for Time: 03:00 - 03:10 Joseph's escape, so it matters. So here's the updated Platform. Yeah, whatever. Okay. I need to get back to Joseph. And on my way to Joseph, I wanted to see if moving my arms in real life made me run Time: 03:10 - 03:20 faster. It didn't. Joseph! Has anyone seen Joseph? That's when I ran into Joseph's dad. Hey, I don't mean to bother you. I see you're replanting your crops. Time: 03:20 - 03:30 Where's your son? Joseph was exactly where he was designed to be. On top of the hill, tending to his crops. Crops are looking nice. Crops are looking good. How you been? That might just be the saddest thing I've ever heard. Joseph essentially Time: 03:30 - 03:40 said... Joseph: Ryan, get me out of this stinkhole! I haven't taken this hat off ever. Like I was born with it on my head. I do not have free will. Help me! Time: 03:40 - 03:50 Ryan: At this point, I've been in this VR world for 10 hours straight, and I need to go to bed myself. I need to sleep for real, like IRL. So far it's been 30 days. We are level 28. We haven't died yet and we need to get Joseph to the end. Time: 03:50 - 04:00 This is the most strong emotional connection I've made ever. Don't tell my wife! Time: 04:00 - 04:10 I spent my first night stargazing. It was actually kind of beautiful. Wake up, Joseph! Time: 04:10 - 04:20 In my world, 6 hours had passed since I'd last seen Joseph in his 3 weeks. And know that time didn't count towards my 100 days. So I've got a lot of work to do. I left the village before Joseph could notice. Time: 04:20 - 04:30 I decided that before I could get Joseph to escape, I needed to get him a name tag. Name tags allow you to name NPCs in Minecraft. One of the only ways to get name tags is through fishing. The only catch: no pun intended. Time: 04:30 - 04:40 They're extremely rare, so I needed to make an enchanted fishing pole. Certain enchantments increase the odds of you getting rare items like name tags. Time: 04:40 - 04:50 So I started slaughtering cows for the enchantment table. I promise it's necessary. On the night of day 34, I almost died. And on day 36, we finally had our enchantment table. Time: 04:50 - 05:00 Oh, Ryan, are you really going to enchant a fishing pole on your first enchantment? Yes. And our first fishing pole was really bad. It was probably the worst you could get. You see, Time: 05:00 - 05:10 we're looking for the enchantment luck of the sea, which allows us to get the name tag faster. Then we enchant it again, and we got it. Wooh! That thing's heavy. I combined our 2 enchanted fishing poles and gave it a name that the world would Time: 05:10 - 05:20 remember. #FreeJoseph. So on Day 39, I started fishing with #FreeJoseph. Time: 05:20 - 05:30 And before long, days turned into weeks. Well, like, I mean hours, days. I don't know anymore. On the night of Day 49, I was doing some fishing, thinking about Time: 05:30 - 05:40 how I would get Joseph out of that village, when something crazy happened. Don't mess with my boat! Oh, my gosh! Now I'm pretty bad at Minecraft, but even I know that zombies and villagers go into boats Time: 05:40 - 05:50 and you can move them that way. But I just forgot. And now I had confirmation that I could really get Joseph out of there. Thank you so much! You are so sweet. Time: 05:50 - 06:00 On day 51, I luckily caught a really good bow. Like really good. And finally, after 14 days of fishing. Wait! Name tag! Oh, my gosh! There's nothing in this world that is more precious to us than our names. Time: 06:00 - 06:10 I'm on my way, Joseph. I'm on my way. Joseph! Time: 06:10 - 06:20 Joseph, I have a surprise for you. Ready? 3, 2, 1. Seeing Joseph's name hover above his straw hat gave me goosebumps. Those piercing green eyes looking into mine, I don't know, it's like he was really in the Time: 06:20 - 06:30 room with me. And there was just this understanding that we would never leave each other's side. Oh! Time: 06:30 - 06:40 He's leaving. What the heck? When I got to the village, I saw a disproportionate amount of farmers making out with each other. It was in this moment that I realized the perfect plan to help Joseph Time: 06:40 - 06:50 escape. I would need a distraction. In a village full of testosterone charged farmers, there was only one thing that could get their attention: a 200 foot tall, farmersonly.com billboard that cast the Time: 06:50 - 07:00 shadows so wide, the entire town would be hypnotized by it. It took nearly 10 days to chop all the wood for this thing. I'm talking absolute deforestation, but the final product was so worth it. I don't know who did it either, but that's like a major distraction, you know? Time: 07:00 - 07:10 Isn't it just insane? Farmer: Hmnuhh. Ryan: And it seemed to be working perfectly. Time: 07:10 - 07:20 Every farmer in town had their lips on another farmer's. Next, I built a water passage, all the way from the platform to the village, allowing me to transfer Joseph via boat, just like that zombie from earlier. Time: 07:20 - 07:30 The final step would be waiting for nightfall and then setting the entire village on fire. As I was preparing, though, the entire village seemed super suspicious of me. Hey! How's it going? Time: 07:30 - 07:40 Uh, just my hand here. Yeah. I'll see you later. I'm not gonna lie. Altogether, this process took about 7 hours of my life. But it's for a worthy cause. Time: 07:40 - 07:50 And if this works out, this might be my greatest accomplishment ever. And now all we had to do was wait for nighttime. Joseph, tonight's the night. Okay. Tonight's the night we bust you out of here. You're gonna live your dreams. Time: 07:50 - 08:00 And I'm gonna burn this place to the ground. Oh, that's not Jo...Oh, my gosh! That's not Joseph. All right, Joseph? Time: 08:00 - 08:10 Yes, that's Joseph. Okay. I caught him up to speed on the plan. Not only were the Iron Golems trapped, but the boat was ready to go right outside his house. We just needed the village to stay calm for a little bit longer. Time: 08:10 - 08:20 One word. #FreeJoseph. All right. I'm gonna burn this place down. Time: 08:20 - 08:30 I began lighting the entire village on fire. Oh, yeah. The entire village was up in flames. I didn't have much time, though, because nighttime was only 10 minutes. Joseph! We're leaving. Come on, Joseph! Let's go, Time: 08:30 - 08:40 Joseph! I'm not gonna lie. I had been in this headset for 25 hours, and watching this village burn to the ground felt Time: 08:40 - 08:50 a little too real to me. Joseph, look at the stars, my guy! Look how they shine for you! Time: 08:50 - 09:00 I'm just kidding, man. I'm just kidding. You know Coldplay? Joseph: Hmneuh. Ryan: Goofball. And just like that, Joseph was free, and we made it back to The Platform. I got him out of the boat, and the first thing he did was run to the crops. Time: 09:00 - 09:10 Hey! Hey! Joseph! He went straight to the crops. Joseph! Oh, my God! Joseph! I was so confused at the time, but Joseph's had literally popped off. Time: 09:10 - 09:20 I mean, he was no longer an NPC farmer. He was Joseph. I haven't had a roommate in a while, so I just, uh, put up a bunk bed. Time: 09:20 - 09:30 Told him I would be top bunk. He'll be bottom bunk. And that was that. I'll be right back. I'm just going to this place called The Nether. So Joseph wouldn't be worried about me. I told him The Nether was short for Netherlands, one of the safest countries in Time: 09:30 - 09:40 the world. However, the place I was going was very, very different. The Nether is one of the most dangerous places in Minecraft. However, you have to go in order to get to the end. Time: 09:40 - 09:50 When you land in the Netherlands, you're greeted by fields of tulips and soccer balls. When you land in The Nether, you're greeted by death. And as I was running away from death, I ended up seeing a nether fortress. Time: 09:50 - 10:00 Yay! I need to kill these things to get blaze rods, which will allow me to make Eyes of Ender, which allows me to find the end portal, which will allow me to make Joseph Time: 10:00 - 10:10 happy. Anything for Joseph. I spend Day 75 collecting blaze rods and then trading with zombie Pigmen for Ender Pearls. Oh! Oh! 3 Ender Pearl! Time: 10:10 - 10:20 Did I just meet Elon Tusk? And the last thing we needed was Nether Wart for potions and probably other things. Yes, I'm taking this seriously. Hey, Siri! Play \"How to Slay Ender Dragon on Minecraft\" on YouTube! Time: 10:20 - 10:30 Siri: Ryan, don't forget to apply your ointment tonight at 9 p.m.! Time: 10:30 - 10:40 Ryan: Look, I've watched enough YouTube videos to know what I'm doing. I did some more boring stuff, and then...Joseph? Oh, gosh! Sorry! That was a little too hard. I started enchanting my weapons and got some really good stuff. Time: 10:40 - 10:50 And just like our fishing pole, #FreeJoseph, I enchanted all of my diamond armor. It wasn't perfect, but it would do. I made the best bow possible. I made potions, and on Day 82 my inventory was ready. Time: 10:50 - 11:00 But I was not. Ryan: So I told Joseph I needed to have an epic training montage, and he said... Joseph: What does epic mean? I hate my dad. Time: 11:00 - 11:10 Joseph: Epic. Ryan: I set up an arena that would emulate the end, and if I could knock off the TNT on top of these dirt towers, I would be fully ready to defeat that dragon. Time: 11:10 - 11:20 That's way off. First try. First try. At first, my accuracy was atrocious. I partially blame that on our sponsor, Roborock. That's right. I've been snacking on this white floor for nearly 30 hours and 1 sec. Time: 11:20 - 11:30 Yep. Still missed. This floor is absolutely trashed. I'm talking pretzels, nacho chips, remnants of sandwiches that I can't even remember Time: 11:30 - 11:40 eating. The Roborock S7's new all rubber brush laughs in the face of such things. This is the one, I can feel it. It has an intelligent mop that knows the difference between hard floor and carpet, Time: 11:40 - 11:50 meaning it lifts that wet mop up, when it absolutely ascends up mountainous terrain, like carpets or yoga mats. Is this an off road vehicle? Maybe. No, legally it's not. Time: 11:50 - 12:00 Speaking of maybe: it's been a full day of shooting arrows and I still haven't hit this TNT block. The Roborock also has precision mapping, which means it's basically smarter than Joseph and I combined. Time: 12:00 - 12:10 You can also set \"no-go zones\". This bad boy docks itself, empties itself and charges itself. I can't even take care of myself that well. This is actually becoming sad. Time: 12:10 - 12:20 Check out the link in the description to snag a Roborock! Possibly the best gift in the entire world. Joseph: Except for a name tag. Ryan: Facts, Joseph. Straight facts. On that note... Time: 12:20 - 12:30 It took me nearly 2 days to hit that first TNT block, and it was almost at point blank range. I'm screwed. To get to the end portal, which takes you to the Ender Dragon, I have to throw these Eyes Time: 12:30 - 12:40 of Ender I made. When you throw them, it points you in the direction of the portal. I figured I would go find it first and then take Joseph there. On the start of Day 86, I started getting really close to this place. Time: 12:40 - 12:50 And then I found it. I had to dig underwater, which was scary, because I can't swim. This place was pretty horrifying, And it took me a really long time to find this place, and almost died a few times as well. Time: 12:50 - 13:00 But we finally found it. Oh, my gosh! I've never gotten this far before. How are we gonna get Joseph in here? I had an idea. If I could somehow dig a tunnel up to the ocean, I could successfully push Joseph Time: 13:00 - 13:10 inside of it directly into the end portal. It took three days to do, but it was foolproof. I don't know what that means exactly, but... Now I just have to activate the portal and Time: 13:10 - 13:20 get Joseph. Holy smokes! It was Day 92 at this point, and I couldn't believe I hadn't died yet. Time: 13:20 - 13:30 All I had to do was build another river, going from the platform to the end, and then there was no more running from it. It's time. Say goodbye to The Platform, Joseph! Time: 13:30 - 13:40 You're probably not gonna make it. I'm just kidding. I'm just kidding. I don't even know if I'm gonna make it. It was a beautiful metaphor passing through Joseph's village. Time: 13:40 - 13:50 We even took a second to appreciate his old house. Then the river led us to the ocean. As we approached the end portal hole, it seemed like Joseph was having second Time: 13:50 - 14:00 thoughts. I think he said something like... Joseph: Dang, I was hoping we would do the Taylor Swift concert before this. My dad would be proud of me. Time: 14:00 - 14:10 Ryan: At least I think that's what he said. It's time, Joseph. Get out of the boat! Go! Jump! Joseph, what are you doing? Go! Joseph: Ryan, if I die, tell my dad I love him! Time: 14:10 - 14:20 Maintain my crops, and tell Taylor Swift I am an epic Stan. See you on the other side! Ryan: I actually misclicked I did not mean to hit Joseph so soon. This was the craziest visual I have ever seen in my life. Time: 14:20 - 14:30 And on the 98th day, we're gonna slay a dragon. I'm coming, Joseph. Oh, well, this is nice. Time: 14:30 - 14:40 Joseph, this is what we've been training for. Seconds after mining out of this hole, the dragon had already spotted us. Time: 14:40 - 14:50 It wasn't looking good. Watch out, Joseph! Watch out, watch out, watch out! No! Joseph! Joseph! Time: 14:50 - 15:00 Joseph died instantly. Time: 15:00 - 15:10 Now I have nothing to lose. I gotta slay this thing for Joseph. The End is a dangerous place. It's actually more dangerous than The Nether. There's a big dragon, and if you beat him, you beat the game. Time: 15:10 - 15:20 There's also a bunch of Endermen. One of the strongest mobs in this video game that we call Minecraft. And there's a ton of quote unquote \"healers\" that I have to destroy, or the dragon will just heal itself forever. Time: 15:20 - 15:30 The first thing I did was build a little wooden house, a house that the Endermen are too tall to access. I'm 5'8\" in real life, so I'm familiar with this tactic. Then I started destroying the healers one by one. Time: 15:30 - 15:40 I don't think I was doing it right, but eventually I was able to get some hits off on the dragon. I threw my Ender pearls and almost died in the process, but before long I destroyed all the healers, and it was time to just start attacking the dragon. Time: 15:40 - 15:50 I listened to a YouTube video and they said to do something like explode the bed. I almost died in the process. Oh! I'm on fire. Time: 15:50 - 16:00 Things got really scary when I took a Dragon Ball to the dome. That's not good. That's not good. I was able to build up to a tower to escape. And that's why I just started absolutely drilling this thing. Time: 16:00 - 16:10 Yup! Oh! Huh! Got it. Oh! This could be nice. Time: 16:10 - 16:20 Oh, my gosh! Time: 16:30 - 16:40 Joseph! This one's for you. Time: 16:40 - 16:50thank u for 5 mil subs. dr. phil about to have a new grandson 🔥",
      "comments": [
        {
          "text": "love they left behind” -Joseph",
          "author": "Unknown",
          "likes": 13085,
          "timestamp": "Joseph had an insane amount of character development for a character with so few lines."
        },
        {
          "text": "Unreal.",
          "author": "Unknown",
          "likes": 7239,
          "timestamp": "I like how Ryan explains the game like his audience doesn’t actually know how Minecraft"
        },
        {
          "text": "works haha. It’s wholesomely entertaining.\nEdit- Ryan I freaking love ur stuff. Keep it up",
          "author": "Unknown",
          "likes": 3000,
          "timestamp": "this was a masterpiece"
        },
        {
          "text": "of Ryan even in death. R.I.P Joseph 2011-2021",
          "author": "Unknown",
          "likes": 2586,
          "timestamp": "this is actually damn impressive like"
        },
        {
          "text": "you literally beat the ender dragon while\n-being in vr\n-you've never beat the ender dragon before\n-dragging a villager with you the entire time",
          "author": "Unknown",
          "likes": 2263,
          "timestamp": "this is the most creative & entertaining Minecraft vid I've ever watched"
        },
        {
          "text": "that one phrase hit different",
          "author": "Unknown",
          "likes": 1837,
          "timestamp": "Ryan has mastered the art of content creation"
        },
        {
          "text": "gags while also still seeming genuine is really entertaining",
          "author": "Unknown",
          "likes": 939,
          "timestamp": "This is not a YouTube video… this is a cinematic masterpiece…"
        },
        {
          "text": "A story of a man who has been brought into this world finding another lost soul just as\nalone as he, and a redemption ark as well as a sacrificial push to force this man to go\nbeyond where he has ever gone before…\nAbsolute beauty…\nPure art…\nQuite simply.. “Joseph”…",
          "author": "Unknown",
          "likes": 760,
          "timestamp": "I am 2 years late..."
        },
        {
          "text": "there’s joeseph, and in 2d there’s Adam.",
          "author": "Unknown",
          "likes": 637,
          "timestamp": "respect joseph for still loving his father even though he hates him"
        },
        {
          "text": "\"Joseph tonight we are busting you out !!!!\"\nDude I'm so jealous ! I wish I had this innocent imagination\nLost it at : did I just meet Elon tusk\" xD\nAmazing content, pure creativity",
          "author": "Unknown",
          "likes": 590,
          "timestamp": "LOL you killed this! Respect :D"
        },
        {
          "text": "works haha aye",
          "author": "Unknown",
          "likes": 502,
          "timestamp": "he spent like 60% of the run just to build a relationship and see that person died at the last"
        },
        {
          "text": "moment, Rip Joseph",
          "author": "Unknown",
          "likes": 451,
          "timestamp": "Joseph had an insane amount of character development for a character with so few lines."
        },
        {
          "text": "somehow creates content that all ages are interested in",
          "author": "Unknown",
          "likes": 421,
          "timestamp": "He spent so much time just trying to become best mates with Joseph... this was so"
        },
        {
          "text": "emotional. All of it because he wanted him to meet his dreams. He spent time creating a\nmassive sign, digging and putting water in lakes to drive him around and ensuring he was\nsafe for him to have to see poor Joseph pass. RIP Joesph my guy",
          "author": "Unknown",
          "likes": 411,
          "timestamp": "man took realistic minecraft to a whole another level"
        },
        {
          "text": "had me hooked",
          "author": "Unknown",
          "likes": 387,
          "timestamp": "i love how symbolic the removal of joseph’s hat is"
        },
        {
          "text": "We will miss you Joseph, you will always be in our hearts. ❤",
          "author": "Unknown",
          "likes": 294,
          "timestamp": "\"Kindness is loving people more than they deserve.\" – an actual person named Joseph"
        },
        {
          "text": "remember you",
          "author": "Unknown",
          "likes": 261,
          "timestamp": "\"if she leaves you for another, there's always her mother\""
        },
        {
          "text": "-Joseph",
          "author": "Unknown",
          "likes": 259,
          "timestamp": "Wauw, this is so good? The way you create content is so unproblematic, high-quality, even"
        },
        {
          "text": "the sponsor didnt annoy me because of the way you introduced it. I dont know how I’ve\nnever seen you before",
          "author": "Unknown",
          "likes": 237,
          "timestamp": "This was an emotional rollercoaster. I love it."
        },
        {
          "text": "Joseph is my hero.",
          "author": "Unknown",
          "likes": 235,
          "timestamp": "R.I.P Josheph. The best farmer, son, friend and alot more anyone could ask for. And the"
        },
        {
          "text": "fact Ryan avenged him is even better. You will be missed Joseph! FREE JOSEPH!!!\n😭😭😭",
          "author": "Unknown",
          "likes": 223,
          "timestamp": "This video combines all of my interests"
        },
        {
          "text": "- Minecraft\n- Ryan's humor\n- Joseph's character development",
          "author": "Unknown",
          "likes": 221,
          "timestamp": "As someone that watches a lot of YouTube your ability to create a narrative and have funny"
        },
        {
          "text": "gags while also still seeming genuine is really entertaining",
          "author": "Unknown",
          "likes": 218,
          "timestamp": "I get nauseas after 30 minutes on VR and this man is spending 30 hours. True legend."
        },
        {
          "text": "He was a memory, he was a friend, he was a son, he was a farmer. HE WILL ALWAYS BE\nHERE IN OUR HEARTS *",
          "author": "Unknown",
          "likes": 206,
          "timestamp": "This man makes everything more complicated but his humor to do stuff makes it easier!"
        }
      ]
    },
    {
      "video_id": "video_5",
      "title": "I Survived Sensory Deprivation Ryan: Sensory deprivation is straight up scary. What does it even mean to experience nothing? Especially when my screen time is ten hours a day, which led my father to say this. Ryan's dad: I bet you can last a few hours in one of these.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 Ryan: Okay. He might be right, but I'm too insecure to accept that, so I bet him that I could. And whoever loses the bet, has to paint themselves green and say in front of all of Time: 00:10 - 00:20 you... Ryan's dad: What are you doing in my swamp? On camera? Ryan: Next thing I know, I'm outside of a building that's probably on the cover of a Goosebumps book. It didn't take long to find the entrance and immediately be terrified by a Time: 00:20 - 00:30 cat waving at me, as well as a plethora of ducks. Why are there so many ducks here? That is a Superduck. I nervously waited for a few minutes when I was greeted by a man named Tom, legally known Time: 00:30 - 00:40 as the Master of Senses. I was then guided to the world's largest sensory deprivation pool. I'm not scared, you're scared. Time: 00:40 - 00:50 I feel like I walked into a nether portal at some point back there. You're telling me this isn't the most ominous door you've ever seen? Bruh! Time: 00:50 - 01:00 I'm gonna be doing the maximum legal time in this thing. 3 hours. One with no gravity, one with no gravity or light, and one with no gravity, Time: 01:00 - 01:10 light or sound. Complete sensory deprivation, which apparently can have some side effects. I'm a little scared of hallucinating, like in a Simpsons episode, they hallucinate, so Time: 01:10 - 01:20 it must be true. But first I checked how deep the water is because I can barely swim, which Tom thought was hilarious. And now I'm ready. Time: 01:20 - 01:30 Yay! Oh, my goodness! Whoa! See ya! Tom: So when you get into a floating pool, generally the progression is as follows. Time: 01:30 - 01:40 You get in, you sit down, you lay back, and as you lay back, you float up to the surface of the water. Ryan: Oh, my gosh! Time: 01:40 - 01:50 I feel like a single-celled organism right now. I've got a timer on my phone that's gonna go off at the three hour mark. This pool is saltier than my ex- girlfriend. Time: 01:50 - 02:00 I don't have an ex-girlfriend. You guys know I can't swim really. Well, I can't float either. I am negative, buoyant somehow. So these pools have tons of salt. Time: 02:00 - 02:10 Like 2,500 lbs of salt. Even in Stranger Things, they show them filling up a pool of salt. And salt makes you float. I worked really hard on this visual. Please affirm me! Ryan: But in conclusion... Tom: I's like Time: 02:10 - 02:20 dropping an ice cube into a glass. If it's a person's first time, it's going to take maybe 5 to 10 minutes for them to start Time: 02:20 - 02:30 to release their body in a way that trusts the water. Ryan: I have never successfully floated before, and this is...well, this is crazy. Time: 02:30 - 02:40 I was only 18 minutes into this challenge when I had the actual scariest experience of my life. What the freak? A duck. Time: 02:40 - 02:50 Of course. Tom: You know, I would say 10 minutes to 20 minutes is, you know, mind dump. Time: 02:50 - 03:00 Ryan: I feel like a butterfly. (Sings:) \"It's fun to stay at the Y-M- C-A...\" Time: 03:00 - 03:10 Tom: BS. BS. BS. And then maybe around 25 to 30 minutes, the mind just goes, okay. I give up. Ryan: I don't see how Time: 03:10 - 03:20 people fall asleep in here. You know, this is why you don't say stuff like that. I'm completely asleep here, totally vulnerable. But the duck woke me up, and now it's time to turn off the lights. Time: 03:20 - 03:30 No light. Here we go. Turning off the lights added a completely new element to this, that I genuinely didn't Time: 03:30 - 03:40 expect to be that dramatic, but it was. I have lost all concept of time, but I still have my duck with me, so... Time: 03:40 - 03:50 Tom: You know, being glued to a phone or glued to a screen, I think increases, you know, your own personal Time: 03:50 - 04:00 suffering. Ryan: So I haven't even gotten to the silence yet, and I feel so weird because I've realized I have developed a habit of listening to something at all times, or watching something at all times. Like this screenshot is my life. Time: 04:00 - 04:10 I feel like the DVD icon that's like bouncing around, just hoping to get the corner perfectly. Oh, nope. Ryan: Not quite. Tom: We are the happiest, and this has been proven in study after study, when we are Time: 04:10 - 04:20 fully present in a moment. Right here, right now. And the moment is not on the screen. Time: 04:20 - 04:30 Ryan: It's so echoey. I feel like we're in the inside of my mind right now. And it's not a very familiar place. Time: 04:30 - 04:40 Tom: 60 to 90 minutes is enjoyable, relaxing, refreshing. Floating longer, it could be visionary. You could see either things that you have seen or things that you've not. Time: 04:40 - 04:50 Ryan: Around 2 hours and 4 minutes-ish is where something actually crazy happened. I really feel like my mind was the only thing working at this point. I suddenly felt like I infiltrated this memory that I haven't thought of in years, Time: 04:50 - 05:00 because I felt so still. Please don't judge me when you watch this! I feel like this reminded me of when I was little in the summertime, so I didn't have to Time: 05:00 - 05:10 go to school. My grandma, she was like my... she like, raised me. Time: 05:10 - 05:20 My grandma would like, take naps the day and I hated taking naps, but I always took a nap with her. And I just remember feeling so still. Time: 05:20 - 05:30 Well, that's embarrassing. Uh...but it was real. Anyways...we got 2 earplugs. Maxed out Time: 05:50 - 06:00 sensory deprivation. Tom: When you cut off sensory input to the body, it's pretty amazing, right? So you have no gravity, no light, no sound. You're reducing the workload that your brain and central nervous system has to process Time: 06:00 - 06:10 pretty dramatically. Ryan: Bye! Oh! Time: 06:10 - 06:20 Hey! All I can hear is the noises inside my ear that are like... Time: 06:20 - 06:30 I fell asleep immediately. Hour 3. Let me tell you about hour 3! It hits different. Okay? Time: 06:30 - 06:40 Tom: It's like everything in the world. It's a wave. It starts at a certain level, you know? And then you sink down into a deep relaxation, and then the mind comes back and asserts itself. Time: 06:40 - 06:50 Ryan: Ah! You could tell me I've been in here for 30 minutes or 10 hours. Time: 06:50 - 07:00 Seriously. I'm not just saying that. And now you're about to watch me reach the threshold of hallucinations, Time: 07:00 - 07:10 confusion, constipation... I don't remember the full list, but this is it. If I had to explain what I was feeling in this moment, or what I was seeing, is Time: 07:10 - 07:20 basically on screen. I felt like my mind just started creating content because what even is nothing? Like the absence of every sense, every thought, my identity on this Time: 07:20 - 07:30 planet, everything. It was just gone for a bit. The last 20 minutes was a spiritual experience, and it took me another 10 Time: 07:30 - 07:40 minutes to even realize my timer was going off. But what I did next is the real story here. I did it! I immediately started checking my notifications. Time: 07:40 - 07:50 And if you heard this sound throughout this video, that's because there were 62 of them. One for every notification I missed while in this tank. Ryan: And so I guess the question is: Were they worth missing? Ryan's dad: Is this thang on? Time: 07:50 - 08:00 What am I supposed to say? What are you doing in my swamp? So that's basically just gonna pop up and... Let me do it one more time! Time: 08:00 - 08:10That wasn't embarrassing that was amazing",
      "comments": [
        {
          "text": "and I cry about it all the time. I know what it feels like.",
          "author": "Unknown",
          "likes": 26635,
          "timestamp": "this feels like a literal documentary, insane work ryan!"
        },
        {
          "text": "memory you shared with us and I love the direction your content is going. Absolutely top\ntier.\nEdit: Seems a lot of people are finding humour in the \"normalize\" term, we get it 💀 but the\nfact that there are also replies with people stating that they're not comfortable crying proves\nmy point lol. We're not obligated to share how we're feeling but trust me, letting go and\ncrying every once in a while can make you feel so much lighter. I think if we try as a\ncollective to be less judgemental of people around us who cry (especially men), you'll find it\neasier to comfortably grieve or laugh or reminisce with tears. Watch a video of cute\npuppies, or soldiers coming home, or a sappy movie every now and then if you find it hard\nto let it out. Try and find time even if it's for 5 minutes to scream into a pillow or bawl your\neyes out 😂, don't be too hard on yourself, you're loved. It's going to be ok. ❤",
          "author": "Unknown",
          "likes": 20096,
          "timestamp": "The memory with your grandmother is really special—don’t be embarrassed over shed"
        },
        {
          "text": "tears. She obviously means a great deal to you. Thank you for choosing to share that\nmoment with us.\nEdit: It’s really encouraging to see so many other people who have hearts for their families\n(and for humanity in general). I hope this conversation (minus the bots) has encouraged\nsome of you as well!",
          "author": "Unknown",
          "likes": 17429,
          "timestamp": "Ryan can literally make floating in a pool entertaining lol. He has some of the best"
        },
        {
          "text": "storytelling on the platform.",
          "author": "Unknown",
          "likes": 15706,
          "timestamp": "I love how ryan managed to made us feel like we're watching a documentary but in youtube"
        },
        {
          "text": "style !",
          "author": "Unknown",
          "likes": 14754,
          "timestamp": "Nobody should make fun of you for having emotional nostalgia sometimes it's unavoidable"
        },
        {
          "text": "memory, you don’t have to feel embarrassed of it.",
          "author": "Unknown",
          "likes": 8831,
          "timestamp": "When he cried over his grandma, I cried too. No weakness or embarrassment there."
        },
        {
          "text": "Strength. Strength and love.",
          "author": "Unknown",
          "likes": 7827,
          "timestamp": "It’s so sad that the world has recognized crying as “embarrassing”! Ryan, never feel"
        },
        {
          "text": "embarrassed about feeling that way! 💗",
          "author": "Unknown",
          "likes": 7023,
          "timestamp": "this man is up next. every video is soo good"
        },
        {
          "text": "obvious that she meant alot to you. You don't have to be embarrassed, we all have that one\nperson who has had a huge impact in our lives.",
          "author": "Unknown",
          "likes": 5759,
          "timestamp": "Man that's not embarrassing, it's relatable. I lost my grandmother about 3 months ago and"
        },
        {
          "text": "memories are really all I have. Being able to tap into them and experience moments with\nloved ones who are gone is a gift.",
          "author": "Unknown",
          "likes": 5593,
          "timestamp": "It’s not embarrassing it’s beautiful. and the fact that you kept it in the video shows how"
        },
        {
          "text": "brave you are, and now you have motivated me to try this for my self to connect with my\nmemories both good and bad",
          "author": "Unknown",
          "likes": 4969,
          "timestamp": "Respect for showing that crying is actually okay. Even as a man."
        },
        {
          "text": "It shows the human side.",
          "author": "Unknown",
          "likes": 4854,
          "timestamp": "Tom: \"Being glued to a screen increases your suffering\""
        },
        {
          "text": "Me glued to this video: 👁👄👁",
          "author": "Unknown",
          "likes": 4743,
          "timestamp": "This. This is science. Not boring science, but practical science. *And he's testing it out with"
        },
        {
          "text": "himself*\nThat's worth to see",
          "author": "Unknown",
          "likes": 4739,
          "timestamp": "Honestly this sounds so relaxing.  No noise, no visual, no gravity.  Only issue is I would get"
        },
        {
          "text": "bored rather quickly with no way to write down what goes down in my head and likely would\nsleep through most of it.",
          "author": "Unknown",
          "likes": 4518,
          "timestamp": "No need to feel embarrassed about your emotions Ryan. We all have people we miss 👊"
        },
        {
          "text": "too, can and should feel without shame. It was great to see you visit such a distant memory\nthrough a genuine experience.",
          "author": "Unknown",
          "likes": 4072,
          "timestamp": "I really want to try this now... Looks oddly relaxing"
        },
        {
          "text": "even when he is scared. This man deserves an award.",
          "author": "Unknown",
          "likes": 3623,
          "timestamp": "It's alright man I cry over my grandma and she's not even dead yet it's just the thought of it"
        },
        {
          "text": "that makes me cry it's okay we understand what it's like you don't have to be embarrassed\nor ashamed of it",
          "author": "Unknown",
          "likes": 3247,
          "timestamp": "As someone who has trouble with sensory overload, this looks like heaven (currently sitting"
        },
        {
          "text": "in a dark room with noise-canceling headphones on so that I can't hear anything but my\nown heartbeat). But it also looks like straight up torture because any sort of stagnation\ncauses me anxiety.\nI'm just now realizing I might have some issues.",
          "author": "Unknown",
          "likes": 2985,
          "timestamp": "5:43 NOT embarrassing. This is a beautiful moment of sentiment and vulnerability. Thank"
        },
        {
          "text": "you for keeping this in the video.",
          "author": "Unknown",
          "likes": 2943,
          "timestamp": "Congrats... you had your first non-drug induced psychedelic experience, and in the process"
        },
        {
          "text": "of the lack of input stimuli, your mind purged several emotions and thoughts that needed to\ncome out.  Some of the experiences shown here are traditionally triggered by psychedelic\nsubstances. When the mind has no input stimuli (no sight, sound and other things such as\ntouch), it creates its own visuals based on the sum total of a person's lifetime experiences.\nThe imagery seen can be metaphorical, with shapes, visuals and 3D & 4D space\n\"representing different meaningful memories\". This explanation is simplistic at best, but\nbasically what is happening here. Well done on completing the challenge. It would be\ninteresting to see your Dad go through the same experience, and see what comes out from\nhis mental library.",
          "author": "Unknown",
          "likes": 2936,
          "timestamp": "Right I’m just gonna flat out say this. Ryan you say “don’t judge me” but no we won’t"
        },
        {
          "text": "because there is no issue in bringing back memories from the past and being upset about\nit, society has made it so men shouldn’t cry or show emotions, but you can! We should all\nbe able to show and express our emotions freely without being embarrassed. 🥰",
          "author": "Unknown",
          "likes": 2870,
          "timestamp": "Naw man, nothing to be ashamed of. Glad you were able to remember something that was"
        },
        {
          "text": "formative in your life. I'm sure if I did this I would be sobbing remembering crazy shit my\nMom and I did, or my friends who took their lives. We all have things we need to process.\nNo shame, thank you for sharing this.",
          "author": "Unknown",
          "likes": 2711,
          "timestamp": "That memory of his grandma made me feel such pure and innocent things I haven't felt"
        },
        {
          "text": "since my own childhood. Crying is the most normal thing, man! It's what it means to be\nhuman!",
          "author": "Unknown",
          "likes": 2618,
          "timestamp": "no where near embarrassing, i lost my grandma 5 years ago and still cry about it, we r all"
        },
        {
          "text": "here with you",
          "author": "Unknown",
          "likes": 2440,
          "timestamp": "I was watching this with my family and when you started talking about your grandmother,"
        },
        {
          "text": "we all fell silent. Just listening to your words. Thinking about our own grandma, and how we\nwould fair if we were to do this ourselves. Great content dude!",
          "author": "Unknown",
          "likes": 2318,
          "timestamp": "That was really thought provoking Ryan, extremely interesting to see how you reacted to"
        },
        {
          "text": "your senses being taken away. I bet it could be a really good memory trigger for people,\ndon’t be embarrassed about which ones come up and how you feel about them, the story\nabout your grandma was really powerful. I would love to try this – but I worry about how I\nwould react to it, I think my anxiety might get too bad unfortunately! surely!",
          "author": "Unknown",
          "likes": 2093,
          "timestamp": "I honestly would love to try something like this. Just absolutely disconnected from the"
        },
        {
          "text": "physical world, feeling like I’m literally inside of my own thoughts",
          "author": "Unknown",
          "likes": 1847,
          "timestamp": "Crying is not embarrassing Ryan remember that. I've lost my grandma about 2 years ago"
        },
        {
          "text": "and every time I think about all those memories I had with her makes me cry like a baby.\nRemember we're here with you!",
          "author": "Unknown",
          "likes": 1789,
          "timestamp": "ryan's dedication to his videos is so amazing"
        },
        {
          "text": "basically the \"hole\" or solitaire confinement. It's horrible little messed up cell. The brick\nwalls, no window, a big intimidating metal door, a metal framed bed bolted to the ground, a\nmetal toilet with a sink on it. One light on the ceiling that stays on all day, all night. I was\nsent to the box the first time for a fight, that actually never really happened, with someone\nthat I didn't even know, it's too long of a story but there I was in the cell next to his in the\nbox and the only way to speak to each other was through a heating vent on the ground that\nran through both of our cells. We would talk, because other than writing or reading that was\nthe only thing to do. We talked for hours, for days, then weeks, we got pretty close without\neven ever seeing each other.\nThe box will do something to weird to your mind. The first few days are probably the worst.\nTime is slow, the light will give you a headache and you'll spend a lot of time just walking\nback and forth but something happens",
          "author": "Unknown",
          "likes": 1729,
          "timestamp": "Watching him progressively get sadder and try to fight it then just breaking down was so"
        },
        {
          "text": "sad to watch",
          "author": "Unknown",
          "likes": 1657,
          "timestamp": "you shouldn’t be embarrassed to show us your emotions, you’re human too and we totally"
        },
        {
          "text": "understand that you have experiences and memories of your own! thank you for telling us\nabout your grandma and your moment with her <3",
          "author": "Unknown",
          "likes": 1654,
          "timestamp": "Dude, don't be embarrased. That was perfectly normal and incredibly heartwarming. If i'll be"
        },
        {
          "text": "honest i'm tearing up myself, heheh.",
          "author": "Unknown",
          "likes": 1632,
          "timestamp": "When he talked about his grandma.. I literally started to tears up a bit."
        },
        {
          "text": "Im very scared to loose my grandmother, I love her so much bc she always loved me and\nhelped me...",
          "author": "Unknown",
          "likes": 1602,
          "timestamp": "That was really thought provoking Ryan, extremely interesting to see how you reacted to"
        },
        {
          "text": "your senses being taken away. I bet it could be a really good memory trigger for people,\ndon’t be embarrassed about which ones come up and how you feel about them, the story\nabout your grandma was really powerful. I would love to try this – but I worry about how I\nwould react to it, I think my anxiety might get too bad unfortunately!",
          "author": "Unknown",
          "likes": 1583,
          "timestamp": "Do not be embarrassed at all about your memory! That was beautiful! Your emotions were"
        },
        {
          "text": "so raw! It made me stop and think about my grandparents who practically raised me as\nwell! It’s a lot of feelings !",
          "author": "Unknown",
          "likes": 1374,
          "timestamp": "I had never heard of this before, it looks so scary, I would 100% freak out after 15min, can't"
        },
        {
          "text": "imagine doing 3 hours lol. I have to try this one day and conquer some fears.\nNice video Ryan, and don't be ashamed that you cryed.",
          "author": "Unknown",
          "likes": 1370,
          "timestamp": "I was almost about to cry when you cried while talking about your memory with your"
        },
        {
          "text": "grandma. It’s not embarrassing, you showed your emotions like that is incredible. I don’t\nknow how it feels, because i never stayed a long time with my grandma, and i barely know\nher much. But, to those who loved theirs, im sorry for your loss. I",
          "author": "Unknown",
          "likes": 1276,
          "timestamp": "Proud of you man, for successfully nailing the requisite task and being a man: giving value"
        },
        {
          "text": "to your thoughts. 🥂\nThanks for 1k likes ❤",
          "author": "Unknown",
          "likes": 1159,
          "timestamp": "When he talked about his grandma, I almost cried, I had a grandpa who was there for me,"
        },
        {
          "text": "even miles away. Back in 2014, he passed away. I was told a story, my grandpa Alec, after\nhe passed, my family saw him on the beach, waving. My grandma wanted to hug him one\nlast time.\nEdit: It’s okay to be sad, just remember people always love you.",
          "author": "Unknown",
          "likes": 1121,
          "timestamp": "Ryan, my guy it's totally fine to cry and let out your emotions out !"
        },
        {
          "text": "It's not embarrassing that you cried on camera.\nJust stay positive  ! Live in the moment !",
          "author": "Unknown",
          "likes": 1105,
          "timestamp": "I’m crying over all these wholesome men validating your feelings and emotions. Good job"
        }
      ]
    },
    {
      "video_id": "video_6",
      "title": "I Tested 1-Star Hotels (again) Ryan: A while back, I tested the most absurd 1 star hotel reviews I could find across all of America. Well, I found more. And if those reviews from the last video were scary, these new ones are my worst",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 nightmare. My only rule for this challenge is: I have to leave a 5 star review at each location. But I can't lie. Let's go investigate! Time: 00:10 - 00:20 New Mexico, baby. The satellite view of this Motel 6 is crazy. Who put it here? This place feels like a Grand Theft Auto mission. I did a walk around, and there's, like, multiple things that kind of concern me. Time: 00:30 - 00:40 Looks like a lot of the doors have been hit with some blunt force. The fence has been pulled apart by...what seems to be super strength. I don't know who did that. But really, the best information we're gonna get is from the reviews. Jason said: Time: 00:40 - 00:50 \"I have a high tolerance for Motel 6's. See my other reviews!\" 5 stars everywhere for Jason and Motel 6. Except for this one. \"But this place is insane. Everything looks like it caught fire at some point. Time: 00:50 - 01:00 I suggest you pick any of the other ones in Albuquerque.\" 1 star. That's not how this video works, Jason. No. Oh, my goodness! Yes, that curtain was definitely on fire. Time: 01:00 - 01:10 Scott P. said: \"Here's the deal. Calling this place a dump is an insult to dumps. It's clear that many of the doors have been kicked in (police raids, most likely). Whatever the reason I could share, Time: 01:10 - 01:20 don't come here alone!\" 1 star. I seem to have made a mistake. Hey! Arnold just said: \"Come on, man!\" 1 star. With a photo of his door. The sign says: \"For your protection. Time: 01:20 - 01:30 When in room, engage deadbolt lock and security latch!\" But neither of them are there. Frans said... What? This is crazy. \"Why did the hotel staff try coming into my room in the middle of the night, Time: 01:30 - 01:40 while I was sleeping? I had to hold the door closed. How rude is that?\" 1 star? Yeah, I think that's beyond rude, Frans. That sounds illegal. Hope you didn't have Arnold's room. No, that would actually be so scary. Time: 01:40 - 01:50 That's barely a door. We gotta talk about John M. \"The plumbing needs work.\" 1 star. And he attached a photo of his...of his own clogged toilet. Like, comp... Bro! It's completely overflowing. Time: 01:50 - 02:00 That's his job...that...he did that. You don't do that, John. That's not how you critique the plumbing system. That's crazy. Cacey F. said: \"Bulletholes on the bedframe. Time: 02:00 - 02:10 Hypodermic needle fell out my sheets. The smell is OMG! Bonus: The cockroaches are not the flying kind, so that's good.\" 1 star. I'm not sure you could write a more concerning review in 5 sentences. Time: 02:10 - 02:20 Clearly the smell of this room is gonna be noteworthy. Okay, let's do this! Time: 02:20 - 02:30 Uh, just checking in for Trahan. Last name. Diego: You'll be in 211, alright? Ryan: Awesome. Thanks so much! What was your first name? Diego: Diego. Ryan: Diego. Awesome. Time: 02:30 - 02:40 Thanks, guys! I got my hotel room key from Diego, and climbed the stairs to my room for the night. I'm in Room 211. I mean, how bad could it be? Regardless, it's time to investigate. Time: 02:40 - 02:50 Come on! Let's go! Time: 02:50 - 03:00 A few observations. First of all: John M.'s review...already busted it. I had to go. Sue me! Don't do that! Secondly: this desk behind me...yeah, is definitely on fire at some point. Maybe that's a dramatic way to say it. Time: 03:00 - 03:10 It got burned. There are ambient sirens in the distance, like that have not gone away for about 5-10 minutes. But the last thing I'll say: the check in staff was super pleasant. Time: 03:10 - 03:20 Like, they were so nice. They made me feel at home. And also: Look how much this room costs! At the end of the day, value is value. You cannot judge this room on the same scale as a 5 star hotel. There's still a lot to investigate, but for what it's worth, I'm having a good time so Time: 03:20 - 03:30 far. Alright. Bulletholes? Okay, there are holes. Um...but will I have roommates? Time: 03:30 - 03:40 It actually looks really good. I think we're in the clear apart from some ambiguous stains, but that's alright. Maybe someone was painting in bed. Maybe that's what that is. Other good news: There are no monsters under the bed. There is a hair on the pillow Time: 03:40 - 03:50 that is definitely not mine. I also found what appears to be a bullethole in the door. I'm just looking at it as a bonus peep hole. Or maybe I shouldn't do that. Maybe that's a bad idea. The hotel comes with a beautiful view of a U-Haul and the rolling hills. Time: 03:50 - 04:00 Or I guess it's just one hill of New Mexico. There's also a guy coughing outside, which is kind of killing the vibe. Time: 04:00 - 04:10 I went outside to see if the guy who was coughing was literally having an emergency. Couldn't find him, so I just ordered some dinner and walked around. Not gonna lie: New Mexico is not bad. I still have a lot to test, but this...this sunset...that's a 5 star sunset. Time: 04:10 - 04:20 Come on! Look at that big ball of fire! Look at that! This camera's crazy. Holy smokes! Shortly after getting back to my room, I got a knock on my door. Time: 04:20 - 04:30 Ryan: Hey, DoorDash? Delivery guy: Yeah, man. Ryan: Awesome. Thanks so much! Delivery guy: Aw, yeah. Appreciate you. Ryan: Have a good one! Take care! Panda Express. Why you ask? I can't see. Time: 04:30 - 04:40 That's better. Panda Express. Not only because it's the meal that I ate at the first hotel last time. That was a marvelous experience. But also, I have a goal during my trip, Time: 04:40 - 04:50 other than just writing 5 star reviews at all these hotels. Basically, I have been living a lie for the past... I don't know, 15 years of my life. Basically, when I was in middle school, my friend asked me if I had seen Kung Fu Panda. Time: 04:50 - 05:00 And I just said yes. And I never saw it. I never...I never saw it in the movies. Even Haley thinks that I've seen all 3 Kung Fu Panda movies, and she bought tickets to the new Kung Fu Panda 4 for me and all of my friends to go see it. Time: 05:00 - 05:10 And I can't just act like I know what happens in the first 3 movies, so I'm gonna watch one movie per night. That way when I get home, I actually know what's going on. It's gonna feel so good to not fake laugh. Time: 05:10 - 05:20 So with that being said... Cheers! Okay, I'm honestly watching Shark Tank first. I love this show. Oh, they locked in the deal. Time: 05:20 - 05:30 That's huge. Good for him. I'm gonna save Kung Fu Panda for bed. Time: 05:30 - 05:40 Kung Fu Panda is loading. By the way, if you're wondering about the outfit, it is simply jammy time. Honestly, this motel has been great. The shower was hot. I brought my pull up gear. I'm still trying to do 100 pull ups a day this year, even on the road. Time: 05:40 - 05:50 Also, the bed is pretty nice. The last time I did this, the first hotel, I just used a sleeping bag on top, because there was some crazy stuff in that bed. But this room is actually really clean. Time: 05:50 - 06:00 There are still a few things I'm concerned about, but the good news is: the door wasn't kicked in. The smell was not \"OMG\", it was more like \"Oh\", which is solid. And I haven't even seen a single cockroach. Time: 06:00 - 06:10 The only review that's still spooking me out is: when Frans said that in the middle of the night, the hotel staff just started trying to break into her room, while she was sleeping. That would be extremely terrifying. And Frans did not provide any information as to why she was selected for that. Time: 06:10 - 06:20 Could it be random? Could it be a nightly occurrence? Fingers crossed that it's not happening. Anyways, I'm having a lot of fun. Time: 06:20 - 06:30 I'm wearing pyjamas. I never really wear pyjamas, so this is a treat. Let's watch this movie! So that my friends finally accept me. Nah, I'm serious. Time: 06:30 - 06:40 I woke up at 5:30 a.m. to the sound of...honestly, warfare. I slept really well. No hotel staff in the room. Time: 06:40 - 06:50 That's a plus. I've got a flight to catch to the next hotel. Here is my review. Time: 06:50 - 07:00 Albuquerque! I love you, but my heart is in Detroit, Michigan. This hotel looks completely unhinged. Time: 07:00 - 07:10 I'm nervous. I am now in Detroit, Michigan, standing in front Time: 07:10 - 07:20 of Saint Regis Hotel. This is absolutely the most confusing hotel of this video. If you made one of those word clouds for this hotel's reviews, it would look like this. Just soak that in for a second and imagine that I came here on purpose! Time: 07:20 - 07:30 The confusing thing about this hotel is that the website looks so nice. The hotel looks amazing, the rooms look beautiful. If this is accurate, this is gonna be the nicest hotel I have ever been to. Time: 07:30 - 07:40 However, the reviews say otherwise. Listen to this! \"Uncomfy. Unsafe. 20-30 ants crawling around my room. Stay anywhere else! If you are reading this, that means it's not too late. Time: 07:40 - 07:50 Don't do this!\" 1 star. Ooh! I'm gonna do it, Adam. I'm gonna. Alright, but what is Joe P. got to say about it? \"Disgusting room, security guard on a power trip. Time: 07:50 - 08:00 Don't ask him where vending machine is! You might get kicked out, which would be an honor.\" 1 star. Joe is savage. It would be an honor to get kicked out. That is actually a goaded review. Time: 08:00 - 08:10 Oh, you're gonna kick me out? It would be my honor. I just can't believe it. Like, even the building itself looks so nice. Look at that font! Do you guys see the font on that hotel? It's gold. David tried out the restaurant at the hotel. Time: 08:10 - 08:20 He said: \"Hour and a half waiting at restaurant for our drinks. Can't wait to see how long it takes to get our food. Will update.\" 1 star. There's no update. This review is from 8 months ago. Is David still waiting on his food? Time: 08:20 - 08:30 I'm gonna find him. And finally, the most savage 1 star review I could find is from Paul. \"I have found the worst hotel ever. Have you ever had a hotel room, where you were afraid to remove your socks? Time: 08:30 - 08:40 The carpet looks like a living organism. I was unwilling to climb into bed without a full body wetsuit, out of fear of the atrocities that are lurking in those sheets. My shower was so bad.\" 1 star. I don't have a wetsuit, but I do have socks. Time: 08:40 - 08:50 I don't know what to expect. The website says one thing, the reviews say another. I think we have enough intel to get started. Let's check in! Time: 08:50 - 09:00 Hey! How's it going? Receptionist: I'm pretty well. You? Ryan: Good. Just checking in. Last name is Trahan. Time: 09:00 - 09:10 This hotel is really nice. This hotel is nice. That's right, Ryan, but it's a little too nice. I stumbled upon an art gallery, and then when I walked towards the guest rooms, everything Time: 09:10 - 09:20 started to make more sense. What is this picture? I can't believe they would hang this up. This is terrifying. I decided to take the elevator to my room, and I have company. Time: 09:20 - 09:30 It's kind of loud. Well, that was weird. Time: 09:30 - 09:40 So I was just in a very fancy hotel lobby, but apparently now I'm in the back rooms of Detroit. What the heck? I don't know how to get to my room. Apparently, my hotel room is on the other side of this door, but I don't wanna open Time: 09:40 - 09:50 this. Do you hear that screeching noise? Well, I found the vending machine. I finally made it to my room, and just when I thought things couldn't get any weirder, Time: 09:50 - 10:00 they did. Alright, let's play a little game! 2 truths and a lie. 1: This hotel is freaking me out. Time: 10:00 - 10:10 I'm actually, like, freaked out right now. Everything here feels like a liminal space. 2: I'm gonna have to change my underpants after that elevator ride. Why is he making those noises? And 3: This room could really use a blue chair. Time: 10:10 - 10:20 Oh! You can guess the 2 truths on your own time. I've got a hotel to review. I do not know how to describe this hotel. I literally feel like I'm in a dream. Time: 10:20 - 10:30 The room just feels a little too empty. And why is the clock doing that? Why can't the clock just be working? It's weird because objectively, the furniture in here is so nice. But also there's parts of the room that aren't finished. Time: 10:30 - 10:40 It feels like it's half renovated. I mean, look at this view! It's so pretty. It's actually really nice. For some reason the bathroom door is closed, and I'm gonna open it now. That's what you do. That's what you do when you when you...when you buy a hotel room. Time: 10:40 - 10:50 Oh, wow! It's actually really nice. The shower looks pretty clean. Brand new tile. It comes with all this free stuff. Time: 10:50 - 11:00 The water...works. Let's see if there's breast milk in the fridge! It's...No, no, it's not. It was one time. When I approached this hotel, I was asking myself: Who's lying? Time: 11:00 - 11:10 The website or the reviews? And the answer is: both. This room feels like the exact middle ground of everything I've consumed on the internet about this hotel, which I guess is kind of what you should expect. Time: 11:10 - 11:20 What I'm trying to say is: I have 1 star reviews to test. And tonight I'm watching Kung Fu Panda 2. So looking forward to that. Look, I am trying to become the greatest reviewer of all time. Time: 11:20 - 11:30 Do I want to investigate if there are 20-30 ants in this hotel room? No. When I tell you that I checked every nook and cranny for a singular ant, I mean Time: 11:30 - 11:40 it. Oh, gosh! Honestly, they might be inside the TV. It's being weird. No ants under the trash can, no ants under the sink, and no ants inside the vending machine. I went to another floor and walked around, and I'm just so confused about what's Time: 11:40 - 11:50 happening here. Why is this massive room full of black futons? Who is lounging and sleeping in this room? At this point I decided to get a change of scenery. Time: 11:50 - 12:00 Go get some dinner, before I literally start panicking. Ramen sounded yummy, and it was. And now I'm ready to test more reviews. There's literally vending machines right here, and the security guard's here at the front. So... Hey, excuse me! Do you know where the vending machine is? Time: 12:00 - 12:10 I have made it back to Saint Regis Hotel. Time: 12:10 - 12:20 Ironically, the vending machine is not working, which is crazy. Like none of them are working. Luckily, I got my own snacks. It's a blue raspberry type of night. I've said it once and I'll say it again. Time: 12:20 - 12:30 It is absolutely jammy time. This is really my first time ever having pyjamas, so let me have this! While I feel like the 1 star reviews prepared me for my stay here, I'm not sure Time: 12:30 - 12:40 there's anything I could verbally say to express to you how strange this hotel is. But I have come to the conclusion that it is nice. It's a nice hotel. It's also fairly inexpensive to stay here, which is a huge Time: 12:40 - 12:50 plus. There's still one thing I have to do tonight, before I can go to bed and finalize my review. And that's watch the entirety of Kung Fu Panda 2. Yeah. See you in the morning! Time: 12:50 - 13:00 Mwah! Good morning, Detroit! First things first: coffee. And second things second: my review. Time: 13:00 - 13:10 Ah, man! I can't wait for the next one. I don't know if I'm more excited to leave Saint Regis Hotel or to fly to Missouri. I'll take anything at this point. Time: 13:20 - 13:30 You already know where I am. Kansas City, Missouri. This is quite the 180 from the Motel 6. Behind me is Hotel Phillips. From afar, Time: 13:30 - 13:40 it looks very nice. It looks very fancy. However, the reviews say otherwise. The photos of this hotel...look! Look at these! Look at these photos! Like, how could anyone have possibly left a 1 star review? Time: 13:40 - 13:50 Hear me out! Hotel dirty, dingy. Faucets green and red with algae and other particulates, which Rebecca says is some sort of benign calcification. Time: 13:50 - 14:00 I was bitten, sparking a harrowing allergic reaction.\" 1 star. Chrys! Did you get a college credit for this review? What's...why are we taking this so seriously? These vocabulary words are crazy. \"Benign calcification\". UPS truck! Ellie has some personal beef. Time: 14:00 - 14:10 \"Until they get rid of Rebecca, stay clear of this mess! Rebecca makes you feel like garbage. Spatters of blood on bed and phone.\" Time: 14:10 - 14:20 1 star. That's...why is it...why is it all of a sudden kind of scary? I know why. Darryl is our last seemingly normal review. \"This is a great place to stay, until my devices started disappearing, and the Time: 14:20 - 14:30 management did absolutely nothing to stop it.\" 1 star. Now I get it. There's something funny about how vague this feels. But then I looked a little deeper and things started getting weird. This is not a normal hotel. Time: 14:30 - 14:40 Oh! There we go. No going back. Listen to this next review from Scott! \"Room 511 is haunted, and the shower doesn't work.\" 1 star. First of all, Scott: I feel like the magnitude of these problems are just not Time: 14:40 - 14:50 the same. And I know I don't normally do this, but Steph left a 5 star exceptional review and said: \"Excellent facility, great staff. Time: 14:50 - 15:00 Toilet was haunted.\" 5 stars. I'm sorry! Did the ghost wipe your butt? Why was this 5 stars? If you look up this hotel online, there are tons of articles saying it's haunted. Specifically Room 511, Room 913, Room 1513 and Room 803. Time: 15:00 - 15:10 So with that being said, there are 3 dire threats that I have to overcome tonight: benign calcifications, haunted toilets, and Rebecca. Time: 15:10 - 15:20 Oh, please tell me Rebecca's off today! Let's hope I don't get one of those 4 rooms! I'm actually nervous. Okay. Oh, there's a bus. It's out of service. Why is it out of service? Time: 15:20 - 15:30 Ryan: How's it going? Vanity: Doing well. Vanity: How are you? Ryan: Good. Ryan: Just checking in. Vanity: Is that for Ryan? Ryan: Yes. Vanity: What brings you in to Kansas city? Ryan: Just to come to this hotel. Time: 15:30 - 15:40 Vanity: Really? Ryan: I heard it was haunted. Vanity: Are you serious? Ryan: Is that true? Vanity: It sure is. Ryan: Oh! Vanity: We do have a few stories to tell. Ryan: Okay. Vanity: So actually, yesterday I went down to our lower level. Time: 15:40 - 15:50 Ryan: Okay. Vanity: I never go down there, right? Ryan: Okay. Vanity: So as I'm down there, trying to work, the elevator just randomly opened. Ryan: No! Vanity: And I figured that it was one of our housekeepers, so I'm like: \"Oh, hi, Time: 15:50 - 16:00 hi!\" Ryan: Hello! Vanity: Nobody comes out, so I go peep nothing, but the door shut, and headed right back up. Ryan: Oh, my gosh! What's your name? Vanity: Vanity. Ryan: Vanity. Nice to meet you. Time: 16:00 - 16:10 Vanity: Yeah. I'm glad that you're here. You're definitely gonna have a good time. Ryan: Okay. Cheers! Vanity: So let me know! Ryan: Awesome. Thanks, guys! Vanity: Enjoy! If you've been watching my channel for a while now, you know that I don't do spooky. I don't participate in paranormal activity. Time: 16:10 - 16:20 Okay? But if any hotel that I've been to in my life has been haunted, it's Hotel Phillips. Spooky. Ah! Ooh! Time: 16:20 - 16:30 Alright. We are room... There's no way! 511. Guys, you can literally look up Hotel Phillips, Room 511. This is the room. Time: 16:30 - 16:40 It is literally one of the 4 rooms in this hotel that is considered to be definitely haunted. I'm just a boy who's trying to get elite status on Yelp. Okay? So dark. At least I have an exit right across from my room. Time: 16:40 - 16:50 Wow! Wow! Does it feel haunted? No. It feels nice. There are a few things to test other than the ghosts. However, I did bring some ghost hunting equipment, including a flashlight, an audio Time: 16:50 - 17:00 recorder, this thing. But I feel like I have to do it at night. And before the sun goes down, I wanna go get some testimonials from the staff. Did you hear the lady that checked me in? Time: 17:00 - 17:10 They're not even trying to hide it. Let's go get some answers! These two right here were the only staff members I could get to talk about the haunted Time: 17:10 - 17:20 stuff. Here's what they had to say. Girl in glasses: Some people had covers ripped off of them. Some people have had the sink come on and off all night. Lights above their bed, on and off. They couldn't explain what was going on. They come down, they're like: \"Sooo...is it haunted?\" Time: 17:20 - 17:30 And they're like: \"Yeah, just may, may have been\". Ryan: I went down to the hotel restaurant and got some pasta with chicken. Absolutely housed it. It was yummy. Maybe even a little bit too yummy. Time: 17:30 - 17:40 After that, I played shuffleboard with a stranger. Or was it a ghost? No, it's definitely a guy. It's just a guy named Greg. And then I waited for nightfall. Time: 17:40 - 17:50 It's jammy time. But, uh-oh! Look at the clock! It's also time to bust the ghost of Room 511. Let's get this guy! Sorry if that was jarring! It might've looked real. Sorry! I'm gonna play with my toys now. Just to get this out of the way: Time: 17:50 - 18:00 The phone does not have blood on it. That's a huge win for me. I don't plan on using the phone anyway, but if it had blood on it, that'd be gross. Time: 18:00 - 18:10 I have also left a device outside of my door. If it disappears, I'm in trouble. I'm in a lot of trouble. And finally I checked the shower. The shower is working, which is huge. That means: half of Scott's review is busted, which means the other half has got to be put Time: 18:10 - 18:20 to the test. I'm turning the lights off. So I've got the motion sensor set up right here. That's gonna be really useful tonight, but for now, I'm gonna turn it off, so I Time: 18:20 - 18:30 can use my other stuff more effectively. This thing is bright. It's me, Ryan. Oh, my goodness! Holy smokes! That is so bright. I expected this flashlight to be like, sleepover vibes. Time: 18:30 - 18:40 I'm being blinded by a military weapon. I have this device here. Looks high tech, right? Let's use it! There's something in the walls. Time: 18:40 - 18:50 Oh, we got something. Guys, I found something. There seems to be something spanning across this entire wall, right about here. Look at that! Boom! Time: 18:50 - 19:00 Look at that! All the way across. All the way. It also goes off every 18in or so. Like clockwork. As if someone literally designed wood beams... Time: 19:00 - 19:10 Oh, this is a stud finder. Okay. So this is pretty much the device you see on all those TV shows. It's like an electromagnetic reader thing. Time: 19:10 - 19:20 No electricity. Lamp electricity. Basically, if Scott is right and this hotel room is haunted, this is gonna go off when the guy or the ghost...whoever pulls up, this thing's going Time: 19:20 - 19:30 off. Apparently, ghosts carry a lot of static electricity. So if one of them walks by: \"Beep, beep!\" Busted. And then I don't know what I'll do, but the main thing I'm trying to say is: this is Time: 19:30 - 19:40 probably my best device, actually, for the night, to detect any wacky activity. I'm setting it up by my bed. That way, if something goes off, I'll wake up in the middle of the night and probably just scream. I don't know what else you do, other than that. Next I'm gonna set up my Time: 19:40 - 19:50 audio recorder. This is gonna record like all night. But just for now I'm just gonna show you a test. Yo, Scott! Anybody there? So we'll just play that back real quick. Time: 19:50 - 20:00 (Impersonating:) \"Like and subscribe!\" Obviously, I didn't hear anything. Did you hear anything? The main thing is: this is gonna be running for the rest of Time: 20:00 - 20:10 the night. So even in my sleep. If there's any noises, this will capture it. Okay. The motion sensor is set up. The EMT thingy is going. If this ghost wants to haunt me, he's gonna have to do it while I watch Kung Fu Panda 3. Time: 20:10 - 20:20 Nothing is gonna stop me. Kung Fu Panda 3 was great. I'm officially caught up on the movies. That's exciting. I do have to wake up at 3:30 a.m. Time: 20:20 - 20:30 to catch my next flight, which is kind of hilarious, because all those YouTubers back in the day made scary hotel videos at 3 a.m. Life comes at you fast. Time: 20:30 - 20:40 Oh, that's my cue. Good night! While I was sleeping, a few things happened. First of all: the light went off multiple times throughout the night, which was terrifying. And the audio recorder picked up multiple statements. (Impersonating:) \"I almost bought Bitcoin in 2011. Time: 20:40 - 20:50 Spock got into trash again. Time: 20:50 - 21:00 That's awesome. I'm out of Sour Strips.\" That was me. Time: 21:00 - 21:10 That's embarrassing. The main thing is: I'm awake at 3:30 a.m. I'm ready to write my review. Time: 21:10 - 21:20 No-one stole my device. Oh, my gosh! I forgot about this. Good news, Darryl. Time: 21:20 - 21:30 I am now on my way to the final frontier of this video. Time: 21:30 - 21:40 Omaha. This is not my first time in Omaha, Nebraska, which is why I have this hoodie. Behind me is my final hotel of this video. The Final Frontier, if you will. Let's hear from Jerry! \"4 star hotel. Time: 21:40 - 21:50 $300 a night. 2 Megabyte per second Internet and 1 towel. Make it make sense.\" 1 star. Jerry, that was beautiful. I feel like Ann really elaborates on why these 1 star reviews might be coming in. Time: 21:50 - 22:00 \"Surprisingly awful. 4 star hotel? Generally dirty. Used tissues under desk. Dried soda on drawers. Bugs in bed. Bundles of black hair on bathroom floor. Gross smell in bathroom. Time: 22:00 - 22:10 poorly draining shower. Tiny window. Warm refrigerator. The TV is horrid. Remote is sticky and unresponsive. Room service an hour late. Time: 22:10 - 22:20 Steak overcooked. They charged me $40. No ice machine. Elevator rickety and noisy. Closes too fast. I will never forget the atrocities of Room 439.\" 1 star. Time: 22:20 - 22:30 Oh, my gosh! Ann! Did they do anything right? Holy smokes! She just went in on this hotel. That's...that's everything. I think that's absolutely everything you experience in a hotel. And lastly, ERT posted this 1 star review. Time: 22:30 - 22:40 You can read that on your own time. Needless to say, this ain't gonna be easy. But I came here on a mission, and I'm not going down without a fight. Time: 22:40 - 22:50 Howdy! Yeah. I bought new sunglasses. The one liners feel way cooler if I put on sunglasses afterwards. It just makes me feel much more comfortable. Let's do this! Aquila Court. Time: 22:50 - 23:00 Wow! This is so nice. Are you. Ryan: Were you checking in? Oh, oh, oh! Hey! Woman: Checking in? Ryan: Oh, yes. Right here? This side? Jack: Okay. Time: 23:00 - 23:10 Jack: And way to get to your room is to go straight through the columns. Ryan: Okay. Jack: And you'll see a staircase. Climb the staircase, and then you will make a...right turn. Ryan: Okay. Awesome. What was. Time: 23:10 - 23:20 your name? Jack: Jack. Ryan: Jack. Appreciate it. I'm Ryan. Thanks! I follow Jack's directions to get to my hotel room, but I'm not very good at following directions. So now I'm lost. Hey! Sorry! I'm Room 2004. Is that this floor? Time: 23:20 - 23:30 Man: 2004? Ryan: Is that a different place? Man: I'm not sure. Ryan: Should I try it on 204, you think? Man: I guess, yeah. Ryan: Alright. We'll see. I wondered if it was a typo. So I went to Room 204, just to check if someone was in there. Time: 23:30 - 23:40 Someone was definitely in there. I decided to keep walking around. I stopped at Room 439. That was fun. Hey! Uh...my room is 2000. Time: 23:40 - 23:50 Woman: Yeah, that's a nice room. Ryan: Oh, sweet. Okay. Woman: So it's like one of these rooms. Like those big windows. Ryan: Oh, so it's that way? Woman: Yeah. Ryan: Oh, nice. Okay. Awesome. Thank you! I believe my room is somewhere up there. Time: 23:50 - 24:00 These sunglasses are only impairing my vision at this point. I'll put them back on when I have another one liner. These are the stairs I was supposed to go up. Jack was right. I just have a terrible sense of direction. Time: 24:00 - 24:10 I don't know what part of the hotel I'm in, but this is beautiful. Let's check out our room! See you on the inside! Oh, this can't be it! Time: 24:10 - 24:20 This can't be my room. What the heck? Welcome to my final 1 star! Time: 24:20 - 24:30 It was a lot cooler in my head. If this is 1 star to Omaha, I'm moving here. My friends! I don't think we're in Kansas anymore. Time: 24:30 - 24:40 How about a tour? There's an entire kitchen. And don't get me started on the fancy glasses! Oh, this? Just a dining room. The living room. This window is beautiful. It has a view of the courtyard. Time: 24:40 - 24:50 But what really made my jaw drop? There's an upstairs. Bedroom. Oh, welcome! Yeah, it's got one of these in it. Bathroom. Is this hotel room perfect? Time: 24:50 - 25:00 No. There are scuffs in many places. The wood floors are quite squeaky. There's some gaps in the flooring. The painting has some weird juice stains on it. And I haven't necessarily gotten situated Time: 25:00 - 25:10 yet, but I am so excited and grateful that this is the final room. And I don't wanna get my hopes up, because I have an entire night to get through. But compared to the other hotels, first impression is excellent. I am very interested to dive into everything this hotel has to offer. Time: 25:10 - 25:20 There's a shuttle that will pretty much take you anywhere within a 3 mile radius if you just ask. Room service. Even though the review was extremely concerning, I'm confident from my first Time: 25:20 - 25:30 impressions here: It's gonna be fire. The first thing I'm testing is the internet speeds. I simply will not believe it if it's actually 2 Megabytes per second. Oh, yes! Go, go, go! Time: 25:30 - 25:40 Oh! I already finished all the Kung Fu Panda movies. What do I need it for, anyway? That's so bad. Alright. Time: 25:40 - 25:50 Ryan: Thank you! So you guys just run this shuttle for guests? Driver: Yeah. Ryan: That's so nice. There is no feeling better than walking the streets of Omaha, Nebraska. Time: 25:50 - 26:00 Who's with me? Are you rolling? I didn't really have a plan. I found this really cool looking toy store and decided to look for a Kung Fu Panda toy. If I had come in here a week ago, I definitely would have bought a Pokémon Time: 26:00 - 26:10 plushie. But now I'm a die hard Kung Fu Panda fan, so I'm gonna pay money for a toy of it. When I finally made it back to the hotel, it was time to test the room service Time: 26:10 - 26:20 review. Hello! Can I order some food? Room service: Okay. What are we thinking? Ryan: I haven't fully seen the menu, but I would love a steak. Room service: Awesome. And how would you like it? Ryan: Anything but overcooked. Time: 26:20 - 26:30 Room service: So you want to do, like, a medium rare, medium? Ryan: Yeah. Medium would be awesome. Room service: Awesome. I would say probably about 20 to 30 minutes. Ryan: 20 to 30 minutes. Awesome. Thank you! A totally not overcooked steak is on the way. Time: 26:30 - 26:40 See you in 20 to 30 minutes! Room service: This is all you. Ryan: Awesome. Thanks so much! Dinner is served. It's crazy, but this dinner is half the price of this hotel room. Time: 26:40 - 26:50 I can't tell if that's a good deal or a bad deal, but it's happening. First, we have steak. That would actually be crazy if it was overcooked. Time: 26:50 - 27:00 We also have a ton of French fries, just like I asked. I still have the palate of an 8 year old, and that's okay. It's so weird. I don't have a Kung Fu Panda to watch tonight. Okay, well, it's definitely not overcooked. Time: 27:00 - 27:10 I asked for medium rare. That looks pretty good to me. Hey! To Omaha. Mhm! That's really good. If you're new here and you're wondering what I've been snacking on throughout this video, this is my candy brand, Joyride. Time: 27:10 - 27:20 As of right now, we have Sour Strips, and very soon we are releasing new candies. The reason we're making new candies in the first place is: because we've got the attention of retailers. Time: 27:20 - 27:30 Wow! I can't say who yet. But in the coming months, the best candy on earth is making its way to a store near you. If you wanna keep up to date, and be the first to know when we restock our Sour Strips and launch our new candies, follow us on Instagram! Time: 27:30 - 27:40 I'm trying to pass Sour Patch Kids at followers. Thank you guys so much for the support on Joyride so far! It literally means the world to me. It's crazy. I'm so grateful. I'd eat this for dinner if I could. That would be irresponsible. Time: 27:40 - 27:50 I'm gonna finish my meal, and then I'm gonna go get some free milk and cookies from my 1 star hotel. Whatever. Time: 27:50 - 28:00 Trade offer! I get... Jammy time. You get...to watch me eat milk and cookies. Time: 28:00 - 28:10 Take your time! Found the milk and cookies. Ryan: Alright. Jack: Everything's good. Time: 28:10 - 28:20 Ryan: Yummy! I poured myself a tall glass of cold milk, collected a couple cookies and ate them in the lobby in my pyjamas. I'm having a great night. Hey, I got the milk and cookies. Jack's the best. Jack! Time: 28:20 - 28:30 5 stars. Cheers! Ryan: Thanks so much! Jack: You bet, man. Ryan: Have a good one! Alright. What's up, guys? I got a full tummy. I actually think I ate way too much tonight. It's a little concerning, but, I mean, I'm having fun. I'm a little bit sad that the journey is coming to an end. Time: 28:30 - 28:40 This is the last hotel. But I am really excited, because when I go home, I get to watch a movie with my friends. And I'm actually gonna know what's going on, because I watched the first 3 movies on Time: 28:40 - 28:50 this trip. No, I'm actually really looking forward to it. I'm gonna go to sleep. I have a review to write in the morning. Sweet dreams! Time: 28:50 - 29:00 Panda. Time: 29:00 - 29:10 Ladies and gentlemen, the weekend. We're pulling up to the movie theaters, 12 deep, Time: 29:10 - 29:20 all in our jammies to watch Kung Fu Panda 4. The best part? I don't have to lie anymore that I've seen the other movies. I cannot describe how good it feels to walk into this movie without imposter syndrome. Time: 29:20 - 29:30 And it would not have been possible without my journey in this video. The movie was fire. Thanks for watching everybody! Watch another video! Time: 29:30 - 29:40 YouTube thinks you would like this video on screen right here. Give it a shot! It's probably really cool, and a handsome guy might even be in the video. No promises. Love you! Bye! Time: 29:40 - 29:50 Ryan as someone who lives here in abq I can easily say that motel 6 is very dangerous 😂 lots of killings and shootings happen there regularly",
      "comments": [
        {
          "text": "grab it 😂",
          "author": "Unknown",
          "likes": 18301,
          "timestamp": "I like how the desk lady said it was haunted but with confidence Ryan: \"I heard this place is"
        },
        {
          "text": "haunted.\" Desk Lady: \"IT SURE IIIS :D.\"",
          "author": "Unknown",
          "likes": 16141,
          "timestamp": "That security guard was definitely annoyed 😂😂"
        },
        {
          "text": "he just gave you a deep sigh!",
          "author": "Unknown",
          "likes": 7211,
          "timestamp": "“Benign calcifications, haunted toilets, and Rebecca”. 🤣🤣🤣🤣"
        },
        {
          "text": "Security guard - *all of his deep, unresolved beef in an inhale and exhale*",
          "author": "Unknown",
          "likes": 3925,
          "timestamp": "I'm dead that \"no breast-milk in the fridge\" 11:01 has become the standard for Ryan's hotel"
        },
        {
          "text": "fridge checks 😂",
          "author": "Unknown",
          "likes": 3411,
          "timestamp": "\"You might get kicked out, It would be an honor.\" Is crazyyy bro 😭"
        },
        {
          "text": "laugh so hard. Bro had flashbacks of Joe.",
          "author": "Unknown",
          "likes": 2514,
          "timestamp": "I will run 1 mile for every like this comment gets (for 1 day)"
        },
        {
          "text": "\"It sure is! 😄\"\n.......",
          "author": "Unknown",
          "likes": 1733,
          "timestamp": "THE FRONT LADY IS SO FUNNY CAUSE WHO IN THE WORLD WOULD BE LIKE \"OF"
        },
        {
          "text": "COURSEEEE, OUR HOTEL IS HAUNTED 😊😊😊😊 \" ITS SO FUNNY",
          "author": "Unknown",
          "likes": 1520,
          "timestamp": "12:09 the security guard def got that question millions of times 😭"
        },
        {
          "text": "paranormal investigation that’s why she gave you room 511. So sweet 😂",
          "author": "Unknown",
          "likes": 897,
          "timestamp": "That security guard sounded sooo DONE with that question"
        },
        {
          "text": "place he stays at",
          "author": "Unknown",
          "likes": 838,
          "timestamp": "that last hotel room is literally nicer than my ENTIRE apartment complex as a whole wtf, it's"
        },
        {
          "text": "sooooo nice and the staff being super friendly yeah whole place deserved the 5 stars\nwithout trying nicest hotel I've ever seen. I can see why the rooms are like $300/night lavish\naf.",
          "author": "Unknown",
          "likes": 820,
          "timestamp": "WOAH woah Ryan! Total cliff hanger with the Security guard/vending machine incident! I"
        },
        {
          "text": "NEED to know what happened after the intense *exhale*!",
          "author": "Unknown",
          "likes": 769,
          "timestamp": "Ryan: \"I heard this hotel is haunted\""
        },
        {
          "text": "Vanity the Hotel Keeper Lady: \"ITTT SURE IISS!! :D\"",
          "author": "Unknown",
          "likes": 750,
          "timestamp": "“The toilet is haunted. Did the ghost wipe your butt” got me rolling on the floor so hard 😂😂"
        },
        {
          "text": "enthusiasm 😭😭",
          "author": "Unknown",
          "likes": 653,
          "timestamp": "love how ryan keeps saying jammy time but wakes up without his jammys everyday"
        },
        {
          "text": "manages to find for every trip",
          "author": "Unknown",
          "likes": 643,
          "timestamp": "As someone who lives in Albuquerque I can confirm that Motel 6 is horrible. There are"
        },
        {
          "text": "police raids at least once a week and always someone getting shot.  Our sunsets are nice\nthough, especially the way the Sandia Mountains look during sunsets.",
          "author": "Unknown",
          "likes": 530,
          "timestamp": "My only fear is that I would bring bed bugs home from these motels"
        },
        {
          "text": "marketing tactic",
          "author": "Unknown",
          "likes": 492,
          "timestamp": "Ryan talking while sleeping was probably one of the funniest parts in the video 😅"
        },
        {
          "text": "happened 💀",
          "author": "Unknown",
          "likes": 476,
          "timestamp": "If anyone can make me laugh, it's Ryan. From his sarcasm to silliness to friendliness to"
        },
        {
          "text": "twists and turns, his videos make me happy.",
          "author": "Unknown",
          "likes": 474,
          "timestamp": "\"i'm out of sour strips\" was the scariest part of that haunted 511 room"
        },
        {
          "text": "about this.”",
          "author": "Unknown",
          "likes": 426,
          "timestamp": "The security guard being that upset that he asked for a vending machine in insane 💀"
        },
        {
          "text": "(Thank you for 200+ likes guys I'm famous 😎)",
          "author": "Unknown",
          "likes": 391,
          "timestamp": "12:00 the fact Ryan had to cross the street then go back to retrieve his camera just for that"
        },
        {
          "text": "clip 😂",
          "author": "Unknown",
          "likes": 366,
          "timestamp": "Ryan:”I heard this place is haunted”"
        },
        {
          "text": "Desk Lady:”IT SURE IIS :D”",
          "author": "Unknown",
          "likes": 361,
          "timestamp": "LOL. I think when the staff at Hotel Phillips heard he was there because it was haunted,"
        },
        {
          "text": "she purposely gave him 511.",
          "author": "Unknown",
          "likes": 353,
          "timestamp": "“I almost bought bitcoin in 2011” is probably one of the most haunted things to be said at"
        },
        {
          "text": "that hotel",
          "author": "Unknown",
          "likes": 338,
          "timestamp": "Ryan, You are the definition of the term \"Look on the bright side!\" and I love it. Keep up the"
        },
        {
          "text": "good work!",
          "author": "Unknown",
          "likes": 337,
          "timestamp": "15:01 “I’m sorry did the ghost wipe your butt?” Got me dying! 😂"
        }
      ]
    },
    {
      "video_id": "video_7",
      "title": "Overnight in the World's Loneliest HouseRyan: This is the loneliest house in the world. Oh, it's so lonely. No! There are tons of conspiracy theories around it. Like...like some people think a billionaire built this place in case of a zombie apocalypse. Some people think it's like, a religious cult.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 But most people just wanna move here and get away from their problems. Emma (man voice): Don't be surprised if one day I just... Ryan: No. But on a real note: this trip is said to be extremely dangerous. And locals say: Time: 00:10 - 00:20 you'd have to be stupid to try to go with no experience. Which really only leaves one man for this job. Hello, hello! Clearly, I'm not prepared for a country named Iceland. Time: 00:20 - 00:30 Basically, I'm taking a taxi to a ferry. That ferry is gonna drop me off at an island. And from that island, I'm going to the island with the loneliest house in the world on it. I made it. Time: 00:30 - 00:40 Lunar ma lunar. Ryan: Did I say that right? Sort of a celebratory... Phone: Hairy melons. Ryan: Oh, dear! It is so cold. I'm wearing shorts. I'm meeting a man named like, Bjarni or something. Time: 00:40 - 00:50 I don't know how to pronounce his name. Okay, I'm moving a little fast here, so let me explain! In 2017, a man named Bjarni uploaded this YouTube video. He explores the island and the house and everything, but he's only speaking Icelandic. Time: 00:50 - 01:00 So I reached out to him and he actually responded. And he said he would take me to the island and make me juicy steaks. So that's about all the information I'm pulling up with. Time: 01:00 - 01:10 And this is Bjarni. How do you pronounce your name? Bjarni: \"Bjarni\". Ryan: \"Bear knee\". Bjarni: \"Bjarni\". Ryan: \"Bertney\". Bjarni: Yeah. Ryan: So he shows me the boat we're going to be leaving on to go to the island in treacherous waters, might I add. Time: 01:10 - 01:20 Guys: Oh! That's a pretty large boat! Not bad. He should be fine on the water. Ryan: It's the small one. Time: 01:20 - 01:30 Bjarni: You get in front of the boat and you jump. Ryan: Are you serious? Bjarni: Yes. There's no...there's no pier or coshi. Ryan: Oh! Bjarni: This is raw nature. Ryan: Oh, my gosh! Time: 01:30 - 01:40 Bjarni: Oh! Ryan: \"Byart ney\". Bjarni: Yow. Ryan: Bjarni just gave me a bunch of clothes, because I wasn't prepared. Time: 01:40 - 01:50 Oh! Ready. I feel deathly sick to my stomach right now. Not sure if it's because I ate 2 bags of Icelandic candy, I haven't pooped in 48 hours, or...I'm so scared right now. Time: 01:50 - 02:00 Can I just say that? And we're going in 10 minutes. Bjarni: Hi! Time: 02:00 - 02:10 Ryan: Alright. Oh! It's a cinematic shot. I gotta get the camera. Bjarni: Of course, of course. Ryan: It's...So, just for the record, we're not taking this boat. Time: 02:10 - 02:20 Ryan: We're taking that one. Bjarni: Yeah, the small one. Ryan: Hi! Ragnar: Hey! How are you doing? Ryan: Ryan. Ragnar: Ragnar. Ryan: Ragnar? His name is Ragnar. My life is in the hands of a man who is 100% not afraid of anything. Time: 02:20 - 02:30 This dude probably eats fear for breakfast. The dark is afraid of him. Bjarni: He'll drive like crazy. Ryan: Are you serious? Man: And you will be sh***ing yourself on the way out. Time: 02:30 - 02:40 Joi: It's not a good sailing weather. Ryan: Ah! Love to hear that. The Icelandic ocean is literally freezing. And I also can't swim. So they give us this life vest that gives you... Time: 02:40 - 02:50 Joi: 1 hour to live in wintertime. Joi: Iceland cold. Ryan: Ah, okay. Joi: 1 minute if you are not. Ryan: Thank you! Joi: Okay. Ryan: I couldn't really fly my drone, so I found some free stock footage to, like, portray my Time: 02:50 - 03:00 experience on the boat to the island. So I just cut back and forth between... Time: 03:00 - 03:10 I just remembered I forgot to put on my goggles. Ryan: These are yours. Bjarni: Oh, yeah. Bjarni: Yeah, man. Ryan: Alright. Time: 03:20 - 03:30 Ah! I'm terrified. So this is the part of the video, where I can never really illustrate how scared I am. And, like, just how dangerous this is for someone like me, who has no experience doing anything. But I have to jump off of this boat over the icy, deathly waters. Time: 03:30 - 03:40 I hope I don't fall. Ragnar: Ready...ready... Jump! Time: 03:40 - 03:50 Ryan: This is insane. So this is the part where we actually climb up the mountain. We're around here. Time: 03:50 - 04:00 Ragnar: You go first. Ryan: Okay. Ragnar: And I'll be behind you. Ryan: Okay. Ragnar: Always one hand on the rope. Ryan: Okay. Ragnar: Great. Just go nice and easy! Go your pace! Ryan: So the camera ends up dying. Time: 04:00 - 04:10 So I'm just gonna do a quick Photoshop example of what actually happened. So we're climbing up this rope at a very steep angle. I'm terrified. Bjarni's just talking about juicy steak. Ragnar is like...Ragnar. Time: 04:10 - 04:20 He's like a Pokemon or something, I don't know. We're climbing up the mountain. We're climbing up the mountain. And at this point, I started getting ahead of Ragnar and Bjarni, and they're like: \"Ryan, slow down!\". And I'm like: \"Hey, guys! I can't hear you\". Ragnar is like: \"Ryan, watch out!\". Time: 04:20 - 04:30 And that is the exact moment. I slip and fall into the ocean. Time: 04:30 - 04:40 And then I levitate out of the water on a...on a flying shark. The shark...the shark also asked for my go... for the goggles. The orange ones. That was just part of the transaction. We're flying, we're flying. We're flying around the island. He takes me over here. Time: 04:40 - 04:50 He takes me over there. Bjarni can't believe his eyes. Finally, he drops me off right at the top of the mountain. He gives me my goggles back and he leaves. So now you're caught up. I regret this. And there's a lonely house on the other side of this mountain. Time: 04:50 - 05:00 And I've got 2 Icelandic dudes to share it with. Time: 05:00 - 05:10 Ryan: We made it. Bjarni & Ragnar: We made it. Ryan: So we made it to the loneliest house in the world. But I can't forget why I'm here. I need to find out who owns this place. How did they build it? How long could you survive here without leaving? Time: 05:20 - 05:30 The steaks are high, and they are juicy. Hopefully. I hope that's happening still. So I'm the 11,260...11,265th person to step foot in this house. Time: 05:30 - 05:40 Bjarni: Yeah. There's some snack here. Some small steaks. Ryan: Juicy. Bjarni: Yeah. Time: 05:40 - 05:50 Ryan: This is the dining and sitting area. Bjarni: Enjoy, my friend! Ragnar: Everything that's here, was carried up by hand. Ryan: Like, how we climbed up. Time: 05:50 - 06:00 Ragnar: Yep. Ryan: Oh, my gosh! Ragnar: Every nail, every wood, every stick. Everything was carried up. Ryan: I'm in the bedroom right now. I got this shot earlier. This is what it looks like. Time: 06:00 - 06:10 I can't believe we're... Where am I? This place is lonelier than an Instagram model in 2013. Like...Okay. Alright. I'm sorry if that was even remotely offensive to any sort of demographic Time: 06:10 - 06:20 or community. Bjarni said he's making some coffee and some pancakes in the morning, so don't mind me if I just teleport to the future, right? Time: 06:20 - 06:30 Morning! A brief lesson on the animals of the Lonely Island. Time: 06:30 - 06:40 Sheep. Puffin. Seals. A handsome guy. Time: 06:40 - 06:50 So we're about to eat. But the fog just disappeared for, like, 15 minutes. It's already back. I was able to snag some pictures, make some TikToks. Emma (man voice): Don't be surprised if one day I just... Time: 06:50 - 07:00 Ryan: I found it! Let's go eat breakfast! Ryan: Alright. Bjarni: Yeah. Ryan: Breakfast is served. Time: 07:00 - 07:10 Ragnar: Looking good. Ryan: This looks really good. So the time has finally come. I've built up the confidence to ask if a billionaire owns this place. And why this house is all by itself here. And Bjarni's answer was: that it's not. Time: 07:10 - 07:20 So this was the first loneliest house in the world. And that's the new one. So this isn't that lonely. There's...there's 2 houses. Oh, my gosh! Bjarni says that most people think this place was built for bird Time: 07:20 - 07:30 scientists to study the famous puffins. Bjarni: The bird scientist...they keep their stuff here. 6-12 guys stayed here. Ryan: Really? Bjarni: Yeah. Ryan: But that's pretty much all he can tell me. Time: 07:30 - 07:40 So I'm gonna go look for Jeff Bezos in the pantry. This is the pantry. How many days do you guys think you could survive off of this food right here? Ragnar: About a week, I would think. Ryan: A week? This is the workshop? Time: 07:40 - 07:50 Ragnar: Yeah. So pretty much here we have paints for the window and all kind of tools, because there's no hardware store in Italy. So we pretty much have everything. Time: 07:50 - 08:00 Ryan: This is the bathroom. Come on in! Got a sink here. Toothpaste. A mirror with a handsome guy in it. Time: 08:00 - 08:10 A shower. Nice toilet. Haven't used it yet, which...you know... You know what I'm talking about. 48 hours. Yeah, that's still happening. Um...And then out of nowhere, Ragnar got a call from the sailor back home that the seas Time: 08:10 - 08:20 are pretty calm right now, and we should probably leave. Otherwise, we might be stuck here for another week. And my flight leaves tomorrow, so... Well, one thing's for sure. I know where I'm going in a zombie apocalypse. Time: 08:20 - 08:30 Thanks, guys! Thanks, guys! I'm not constipated anymore. Time: 08:30 - 08:40You certainly know how to tell a story! Incredible video/journey with Ragnar and Bjarni.",
      "comments": [
        {
          "text": "once in a lifetime adventures like this. Bjarni and Ragnar seemed so nice.",
          "author": "Unknown",
          "likes": 18269,
          "timestamp": "Dude had spent time with two of the most wholesome people in the world."
        },
        {
          "text": "to the island and cok u jusy steaks",
          "author": "Unknown",
          "likes": 6073,
          "timestamp": "Can we just take a moment to appreciate the flying shark that saved Ryan's life 👏"
        },
        {
          "text": "to finally poop",
          "author": "Unknown",
          "likes": 4745,
          "timestamp": "This man is the definition of doing side quests"
        },
        {
          "text": "GREAT VIDEO!",
          "author": "Unknown",
          "likes": 3489,
          "timestamp": "So....Ragnar is alive afterall, I thought he was eaten by snakes..."
        },
        {
          "text": "welcoming.",
          "author": "Unknown",
          "likes": 2786,
          "timestamp": "Ryan - the hyper active guy"
        },
        {
          "text": "Ragnar - the stronk ,the guardian ,the ancestors!\nBjarni - jusy steak 😄",
          "author": "Unknown",
          "likes": 2579,
          "timestamp": "Icelandic people are actually very warm people despite it being a cold country. I was"
        },
        {
          "text": "fortunate enough to visit it a few years ago. I highly recommend it. There are so many crazy\ngeographical features there it is mind numbing. It is also one of the safest countries in the\nworld with very little crime and maybe 6 jails in the whole country. Fun facts.",
          "author": "Unknown",
          "likes": 2449,
          "timestamp": "Moral of the story: If there’s ever a zombie apocalypse just call up Bjarni and he’ll take you"
        },
        {
          "text": "to the island and cok u jusy steaks",
          "author": "Unknown",
          "likes": 2422,
          "timestamp": "he may be physically 5'8\"..."
        },
        {
          "text": "but he's 6'4\" in spirit",
          "author": "Unknown",
          "likes": 2370,
          "timestamp": "This was so entertaining"
        },
        {
          "text": "which is located in Iceland with raging waves and air as cold as Ice\"",
          "author": "Unknown",
          "likes": 2027,
          "timestamp": "Ryan: I know where I’m going in the zombie apocalypse"
        },
        {
          "text": "Ragnar and Bjarni: *laughs in Icelandic*",
          "author": "Unknown",
          "likes": 1822,
          "timestamp": "Bjarni says he’ll make jusy steak for everyone who subscribes 🥩😭"
        },
        {
          "text": "REALLY well done, good job!!",
          "author": "Unknown",
          "likes": 1583,
          "timestamp": "This sounds like literally one of the coolest things someone can do."
        },
        {
          "text": "Ragnar: 😐\nBjarni: 😃",
          "author": "Unknown",
          "likes": 1396,
          "timestamp": "The fact that they carried all the building materials and furniture for that house up the cliff is"
        },
        {
          "text": "mind-blowing",
          "author": "Unknown",
          "likes": 1295,
          "timestamp": "Why are you the young, comedic, Casey Neistat?"
        },
        {
          "text": "actually believe when it comes to Ryan, he can literally do anything",
          "author": "Unknown",
          "likes": 1212,
          "timestamp": "can we talk about how wholesome bjarni was and how regnar and him seemed so fun…."
        },
        {
          "text": "the trio was a mood loved it ❤❤❤",
          "author": "Unknown",
          "likes": 1095,
          "timestamp": "Amazing Video"
        },
        {
          "text": "experienced, fearless and serious one, Bjarni being the funny and wholesome guy with\ncooking skills and Ryan the young protagonist full of hope and determination embarked on\na journey/mission. Such a good story telling man!",
          "author": "Unknown",
          "likes": 1054,
          "timestamp": "The water looked so clear when he was jumping to the island, such a clean country!"
        },
        {
          "text": "anxiety and most of the time am afraid to leave my house, let alone going somewhere by\nmyself with people I don’t know. Oddly makes me happy and want to do more in my life.",
          "author": "Unknown",
          "likes": 915,
          "timestamp": "This is it. I finally found it. The most entertaining and hilarious video on YouTube. What a"
        },
        {
          "text": "fantastic adventure and a once in a lifetime experience.  Those dudes were so cool. I bet\nthey have some stories to tell. Well done handsome guy!",
          "author": "Unknown",
          "likes": 835,
          "timestamp": "As an icelandic person, its hilarious seeing you trying to pronounce everyone's names xd"
        },
        {
          "text": "*\"JUsy STeak\"*",
          "author": "Unknown",
          "likes": 788,
          "timestamp": "Ragnar keeps the house warm by staring at it and when he said all this food can make him"
        },
        {
          "text": "alive for a week it was including you.",
          "author": "Unknown",
          "likes": 741,
          "timestamp": "editing is just ALWAYS top tier when it comes to ryan videos i can’t 😂"
        },
        {
          "text": "warm but the ocean is not and green land is covered in ice which subconsciously tricks\nenemies to go to Greenland to look for eachother",
          "author": "Unknown",
          "likes": 708,
          "timestamp": "This feels like a house that someone would build after so many years in customer service."
        },
        {
          "text": "No town. No neighbors.\nJust over it.\n😂😂",
          "author": "Unknown",
          "likes": 703,
          "timestamp": "these 2 fellas were so kind-hearted and welcoming and that place is absolutely beautiful, i"
        },
        {
          "text": "think i would stay there for months if i could.",
          "author": "Unknown",
          "likes": 683,
          "timestamp": "Ragnar and Bjarni are two of the most chillest guys I’ve ever seen. I wont mind living with"
        },
        {
          "text": "them on that island. Seems like theyre fun to hangout with.",
          "author": "Unknown",
          "likes": 672,
          "timestamp": "I don't know why, but when Ryan started narrating the shark story, I was laughing to the"
        }
      ]
    },
    {
      "video_id": "video_8",
      "title": "Tesla Autopilot For 24 Hours Straight! Ryan: Have you ever wondered what it would be like to drive across the country using only Tesla autopilot? Here are some of the things we'll be looking at. Cost. How much will this trip cost, compared to your rich friend's mom's fully loaded 2020 Chevy Tahoe?",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 Convenience. How many times will we have to stop? Consistency. What is the percentage of the trip we can actually use autopilot for? How many times will it fail? And satisfaction. Time: 00:10 - 00:20 How enjoyable is it? Look! I'm nervous, but this is science, and I'm a scientist. Ryan Yerrow: You dropped out of school and you're unemployed. Ryan: That's not the point. Time: 00:20 - 00:30 Alright, so here's the plan. We're taking the autopilot Tesla from Texas to Chicago. A new SUV, according to this, will cost about $220 in gas, if it's fuel efficient. Okay. That's interesting. Is that interesting? Time: 00:30 - 00:40 Haley: Mhm! Ryan: Thanks for the support, babe! According to this as well Google Maps says: this trip should take 17 hours and 6 minutes. Okay. However...however, here's the switcheroo. Time: 00:40 - 00:50 This doesn't account for time spent recharging the car. We can't just go to a gas station, pucker up, and refuel our Tesla. Okay? That's not how electric vehicles work, apparently. Time: 00:50 - 01:00 Guys, do we have any guesses how long the charging is gonna add to the trip in duration? Ryan Yerrow: 7 hours. Ryan: 7 hours? Friend: 24. Ryan: It's going to add 24 hours. Is what your guess? That's your actual guess. Time: 01:00 - 01:10 Ryan: Okay. Carter? Carter: 10. Ryan: 10. Add 10 hours. Haley, are you pooping? Ryan: What is your guess? What do you think the charging will add to the trip duration? Haley: How long? Ryan: Yeah. Haley: Uhh...6 hours. Ryan: (Whispers:) She's pooping. She's literally pooping. Time: 01:10 - 01:20 Thanks, babe! Nick, what do you think? Nick: Uh...5 hours. Ryan: Add 5 hours. Ryan: Alright. Guys, come here! We'll plug it in. So, 17 hour trip turns into...27 hours. Time: 01:20 - 01:30 Ryan Yerrow: Who said 10 hours? Ryan: Carter said 10 hours. Dude! Carter: You got it. Ryan: So we're stopping in Waco, Denton, Ardmore, Oklahoma City, Catoosa. Joplin. What the heck is...Springfield, Rolla, Melville, Springfield. Time: 01:30 - 01:40 Ryan Yerrow: And Normal. Ryan: And Normal. Interesting. Autopilot 24 hour challenge. Ryan Yerrow: Overnight. Ryan: Well, yeah. Ryan Yerrow: 3 a.m. Friend: No stops. Ryan Yerrow: Ouija board. Time: 01:40 - 01:50 Ryan: It's time to get on the road. We're already...we're already on the road. Okay, so here's what we're gonna do. Chicago. Calculating the route. Apparently, it'll automatically determine the superchargers in our area on the way to Time: 01:50 - 02:00 the trip, so we'll see. Okay. Yeah, we have a lot of stops here. Apparently, when we get to Chicago, we're gonna have 10% battery. Nick: That's crazy that it calculates that. Ryan: Navigate on autopilot. Time: 02:00 - 02:10 And you know what we're gonna do? Boop! Let's go to Chicago! 24 hours autopilot. I'm nervous. I'm a lot of things. Hungry, constipated. Okay, so I think I have to get it on the highway. Time: 02:10 - 02:20 This is one thing about autopilot. You can't just, like, whoa, start it from your driveway and go to Chicago. You have to get on roads with lanes. So we're gonna get on the highway, and then it's hands free, if you know what I'm saying. Here we go. Let's test the autopilot for the first time! Time: 02:20 - 02:30 Ryan: Ready? Nick: Sure. Ryan: Turn it on! Nick: That blue wheel. Ryan: That means that autopilot is on. I don't know if it'll detect this red light. Is it gonna turn? I don't know if it'll turn by itself. Time: 02:30 - 02:40 All right, we'll see if it turns by itself. I don't think it does. Okay. It doesn't. It doesn't turn by itself. I was not even supposed to go. This is not off to a good start. Okay. This is gonna be a long road trip. Autopilot engaged. Time: 02:40 - 02:50 I have the settings set to where if it wants to change lanes, I have to actually activate it. So right now, it's gonna wait until there's an opening and it's trying to go. It's trying to go. Better hurry up. Yo, this person's not letting me over. Time: 02:50 - 03:00 Ryan: No way! Nick: Just missed the turn. Ryan: Was not supposed to take this exit. I blame the person behind me. They didn't let me over. Autopilot is not 100% autopilot. Every like 8-10 seconds Time: 03:00 - 03:10 you have to apply a small turning force to the wheel, just so they know that you're actually present. You have to be awake at the wheel. Alright, we're on the road. Autopilot engaged. We're on this road for 135 miles. I guess I'll let you know when something crazy happens. Time: 03:10 - 03:20 All right. We're only ten minutes away from the supercharger location. This has been a breeze. It's literally been 100 miles of just straight away. Every 10 seconds I go like this. Sometimes there's, like, 30 second spans, where I don't even touch the Time: 03:30 - 03:40 wheel at all. And I've been in the fast lane the whole time, just chilling. Eyes closed, just swinging. I mean, it's essentially what's happening here. I'm actually a little nervous to see what the supercharger location is like. Time: 03:40 - 03:50 I'm hoping there's like food. I think we're all hungry and want to freshen up. So honestly, autopilot has been a lot better. Oh my God, oh my God, oh my God! What's going on? Oh! Looks like there's a closed exit up here. Let's actually see if it comes out of this lane! Time: 03:50 - 04:00 Oh, no! It's accelerating. Oh, no! Oh, no! Oh, no! Ryan: Okay. Nick: Nope, nope. Ryan: Alright. Nick: Oh, my God! Ryan: Yeah. This is not good. That's why you can't fall asleep at the wheel, dude. Like, literally we would have ran into cones or worse. Time: 04:00 - 04:10 I don't know if you guys can see this interface, but the cameras on the Tesla literally detect, first of all, what kind of cars are around us and whether or not there's like a wall nearby. Cones. See the cones on the screen? Time: 04:10 - 04:20 That's crazy. Like, the cameras have such a long range. The cones are over there. This has been actually a really nice experience so far. Let's be honest! Like when we're driving, we get distracted. Whether it be like in a conversation or...oh, Time: 04:20 - 04:30 my phone is ringing right now. But now there's another entity making sure I'm safe. Thank you, Elon! Is he an angel? Alright. Let's check out this supercharger! It says we're here. Time: 04:30 - 04:40 Is it...Oh, I see it. You guys see the Teslas in the distance? So this is a chuper, okay. A chuper starger. Chuper starger station. Alright, so what's around us? We have a bakery. Time: 04:40 - 04:50 We have a chicken restaurant. Alright. It looks like there's some available superchargers. I don't know if I have to pay. If I have to pay, that changes a lot of things. Let's go! Wait! \"Show your Tesla key to get any tea, coffee or coffee drink on us!\" Time: 04:50 - 05:00 Nick: Wow! Ryan: What? So we have 80 miles and it's currently 2:47 p.m., so... Okay, I don't know if this is just... I don't see, like, a... Did I just plug this in? Nick: Yeah. Go for it! Ryan: Wait! Time: 05:00 - 05:10 It's working? What? Do I not have to pay then? Okay, I'm pulling up the app right now. Oh, it says super charging on my phone. 20 minutes to continue your trip. Alright. We got 20 minutes, guys. Time: 05:10 - 05:20 Let's rock and roll! Let's go get our free tea, coffee or coffee drink! Time: 05:20 - 05:30 Alright, so we're here at Collin Street Bakery. Supercharging Stop 1. Apparently, if I go up to a cashier and I'm like: \"Yeah, I got a Tesla. I'm out of here Time: 05:30 - 05:40 charging on your superchargers\", then we're gonna get a free coffee. And that sounds like a good deal. I'm attempting it now. We're in the middle of Texas. Time: 05:40 - 05:50 Hello! I wanted to try to get a free coffee. Ryan: I have Tesla. Cashier: Regular coffee? Ryan: Yeah. That works. That's so cool. Can you tell I'm losing my voice? I can't either. Physically hurts. I'm perfect health. Thank you so much! Time: 05:50 - 06:00 And that's all I need. Okay. Sweet. Thank you! That's super cool. Ryan: That's awesome. Nick: For a car you get a free coffee. Ryan: Look! I got my free coffee. Let's see if it tastes like eco friendly! Time: 06:00 - 06:10 I'm trying to see if this coffee tastes like Elon Musk's must. Oh, look at that! That's gorgeous. Here we go. The ultimate test. No stirring. Ah! You tried to help me. Time: 06:10 - 06:20 Haley: Why'd you do that? Ryan: I thought it was friendly. Alright. We were in there for a lot longer than we expected. It was like 50 minutes, but we got a full charge, which is kind of insane. Time: 06:20 - 06:30 And I didn't pay a single dime. Cost $0. Convenience. I mean, yeah, we had to stop for 50 minutes, but we just got a meal anyway. Pretty convenient. Let's keep rolling! Let's go! Autopilot engage. Time: 06:30 - 06:40 I don't know why, but I'm gradually losing my voice. Couldn't be worse timing, honestly. We've been on the road for a couple of hours and 81...No way! We've been on the road for a couple of hours. Time: 06:40 - 06:50 And here's the scary thing. 81 miles until our next supercharger destination, right? Only 111 miles left in our battery. That's a 20 mile difference. Time: 06:50 - 07:00 We started with like, a 90 mile difference, and that is because I've been speeding the whole time. Not speeding, but like a small 5-6 mile an hour discrepancy. And I guess that drains the battery. Time: 07:00 - 07:10 So now it's saying...if you can see this, it says: \"Stay below 65mph to reach destination\". And that's pretty slow. Now what I'm gonna do is: stop at a closer supercharger. Time: 07:10 - 07:20 It fills up super fast in the first 15 minutes, so I think we'll just get a short little break. Everybody want a break, huh? Guys! Excitement. Promises. Ryan: Excitement. Haley: I can't hear you. Time: 07:20 - 07:30 Friend: Yeah. Ryan: Clearly, we're all thriving. Made it to supercharger. Mhm! Let's go! Just put in all my voice cracks at this point. Made it to Supercharger 2. Time: 07:30 - 07:40 We're about 5 hours into the road trip, still in Texas, which is absurd. If you're from Texas, who's with me? Currently we have a whopping 89 miles left in the tank. We're just gonna throw the supercharger on real quick. Time: 07:40 - 07:50 Still free, I guess. That's...okay. And stick that big boy... Hey, hold up! Stick that big boy in there! Hey! Alright, we're gonna give it about 15 minutes, and then we're gonna get back on the Time: 07:50 - 08:00 road. What are you guys doing? Making TikToks? Ryan Yerrow: Renegades. Ryan: Rene...Well, let me in on this! Supercharging breaks be like. I did so Time: 08:00 - 08:10 good, I did. It's a banger and a half. Time: 08:10 - 08:20 What the heck, man? Look at all them birds! Man! You guys have no idea... what? These birds are literally insane. So far, the experience has been... Time: 08:20 - 08:30 Other than my voice, pleasant. Autopilot literally feels like I am a passenger on this long road trip, and it... Maybe that's not a good thing, I don't know. I think it's a good thing, because normally on road trips, I've done several. Time: 08:30 - 08:40 I'm kind of a big deal. These birds are pooping. Go away! There's multiple poops on my car already. Normally on road trips, your eyes are peeled on the road, and it's so mentally and Time: 08:40 - 08:50 physically exhausting, that you actually can start falling asleep at the wheel. I've done that a couple times and it's very scary. We're here. I like have autopilot on. I'm obviously paying attention, but I'm looking over here at some pretty trees. Time: 08:50 - 09:00 I'm looking over here at a hill. I don't know, it doesn't matter. I can look at it. And we're still in Texas. We just kind of demotivating. We have a long way to go. But the mileage, I will say, as a con, is not very accurate. Time: 09:00 - 09:10 I'm probably gonna have to fill up the battery much sooner than expected, but it's much better than just like running out of battery, because that would be a bad Time: 09:10 - 09:20 situation. You can't just call AARP or whatever. You know... Ryan: What's it called? Haley: I don't know. Ryan: So... Roadside Assistance. Charge is super fast. We're almost at 200 miles already. I don't know why I looked at my watch. I don't have that information on my watch. Time: 09:20 - 09:30 We're just gonna keep tracking. Hopefully things don't go wrong. I mean, what could go wrong? Time: 09:30 - 09:40 Police officer: Why did it take you so long to stop? Ryan: Oh, I'm about to go to a supercharger. I'm about to go to a supercharger. My car is about to die. It's an electric vehicle. Police officer: Okay, that's... Ryan: It's like right around the corner. Ryan: I was gonna go. Police officer: No, Time: 09:40 - 09:50 I know where it's at. Y'all have driver's license and ID's? Police officer: How old are you? Ryan: I do. I'm 21. Police officer: Oh, okay. You look like you're 12. Ryan: I get that a lot. Um...Let's see! Ryan: Yes, they do. Police officer: Are you all 21? Time: 09:50 - 10:00 Ryan: No. Police officer: Okay. Do you live in Oklahoma? Ryan: No. We're road tripping from Austin to Chicago right now. It's a little scary with this, because the superchargers are, like, so spaced out. Time: 10:00 - 10:10 Police officer: Yeah. Alright. Well, go get charged up! Ryan: Thank you so much! Happy New Year! Nick: She didn't even tell you what she pulled you over for. Usually that's the first thing they tell you. Ryan: Yeah, that was weird. Time: 10:10 - 10:20 Haley: I smiled at that lady, and she was like... Ryan: Did she smile back or no? Haley: No. She was mean facing me. Ryan: What the heck? Did you get that? Nick: We'll find out. Ryan: That was so weird. Time: 10:20 - 10:30 Supercharger 4. Ryan Yerrow: It's a zero, 3 or 4. Nick: It's 3, actually. Ryan Yerrow: I think it's 3. Nick: It's 3. Friend: 3. Nick: 3. Ryan: So we're gonna go eat. But honestly, at the other stops, we got to watch some something, something. Time: 10:30 - 10:40 And maybe Ryan Trahan, maybe You Season 2, I don't know. Let's go eat! So we're about 8 hours into the road trip. Time: 10:40 - 10:50 How are you guys feeling? You guys enjoying this trip? Friend: I'm wide awake, man. Ryan Yerrow: I'm feeling good. I'm up for another 8 hours. Ryan: 8 hours? Powerful stuff. That is. So yeah, we just finished up eating, refueling and according to my app, we Time: 10:50 - 11:00 are at a fat 252 miles of range. Ryan: It's actually ins... Ryan Yerrow: You sound disgusting, dude. Ryan: Do I sound disgusting? Ryan Yerrow: Yeah. You do. Ryan: You look disgusting. Time: 11:00 - 11:10 Ryan Yerrow: I know I do. Ryan: So far, I think the stops are actually making it more fun. Based on our other road trips, everyone's either sleeping, someone's driving, and this is more of a fun stop than going to a gas station for 3 minutes. Time: 11:10 - 11:20 We're making memories along the way. I mean, this dude's literally deep throating a gummy worm, so... Nick: It's my first time at Freddy's. Ryan: First time at Freddy's? In...where are we? Oklahoma? Mhm! Time: 11:20 - 11:30 Let's get back on the road! Time: 11:30 - 11:40 Recording. Hey, y'all! Time: 12:10 - 12:20 I have 4 Cough Drops in my mouth, because my...my throat hurts. 4 Cough Drops is beyond the recommended amount. It is no longer nighttime. Nighttime was a trick. Time: 12:20 - 12:30 Okay? I sound like Bernie Sanders. I sound like Bernie Sanders right now. Health care! Health care! I sound like Bernie Sanders. We have a few more hours left in this road trip. Time: 12:30 - 12:40 Several, in fact. And it was quite the experience, let me tell you! I'm not gonna lie. Charging is becoming a hassle. Does anyone have remedies for throat pain? Time: 12:40 - 12:50 On to Springfield. We've been to about 8 superchargers at this point. We got a couple more to go, and then we will have completed our 24 hour. Actually, it's gonna be more like 30 hour Time: 12:50 - 13:00 cross country road trip in a Tesla, which, by the way, is getting very scary. Let me tell you why! This thing right here... it says you have 270 miles, but you don't. Time: 13:00 - 13:10 Let me just say that again! You don't. Literally... I can go, like 200 miles on a full tank, when it says 270. That's scary, because superchargers are few and far between. Time: 13:10 - 13:20 My guy, Elon, @elonmusk. Overall, still a good experience. Feels like I'm a passenger in an airplane. Everyone has their own seat. Everyone is getting restless though, because we haven't really slept. Time: 13:20 - 13:30 In the next clip, my voice is gonna be perfectly healed. Law of attraction, baby. Look it up! Time: 13:30 - 13:40 Last stop before we finish this freaking 24 hour challenge. Time: 13:40 - 13:50 My voice is still... We figured something out about the Tesla, that they don't tell you about the Tesla before you go on a big road trip. Guess what? They artificially limit the amount of miles you can charge up to...why? Time: 13:50 - 14:00 Elon! More like peon. Peon me! Why don't you? So anyways, now this bad boy is not gonna charge up to 270 miles. No, no, no. This sucker right here with the bird poop on the hood is gonna charge to 300. Time: 14:00 - 14:10 So that's actually really nice. So we're gonna drive straight to Chicago, finish this autopilot trip, and I pray to God Time: 14:10 - 14:20 that my voice gets better in the next clip. Haha! Alright, I'm good. Time: 14:20 - 14:30 Turns out we had to stop one more time. This seems to be a trend. It's actually kind of frustrating at this point, I feel like. We've been driving in the cold basically this whole time, and apparently Time: 14:30 - 14:40 that drains the battery. There's...as you can see, check this out! There's snow outside. This is literally the last fill up. And this 24 hour challenge has turned into more of a...almost 40 hour challenge. Time: 14:40 - 14:50 I'm gonna go make a snowball...snowman. I'm gonna go do that. Good enough. Time: 14:50 - 15:00 I have named him Hamilton. There it is. Home, sweet home. Actually, it's not home at all. It's Chicago. Our destination. My voice...my voice has completely deteriorated over the course of this road Time: 15:00 - 15:10 trip. It has been approximately 36 hours, since we started. I think I'm about to start tearing up. Time: 15:10 - 15:20 There it is. Mission accomplished. Challenge complete. We did it! This is not our final destination. We got an Airbnb. I'm not that stupid. Time: 15:30 - 15:40 It's been over a week since this road trip came to a conclusion, and I have some Time: 15:50 - 16:00 thoughts. Okay, first of all: costs. Dude, literally, this trip was free. Like apart from food, it cost us $0 to drive across the country. That's insane. I mean, what other cars can do that? Time: 16:00 - 16:10 None. There's none. I did put a couple thousand miles on the car, which definitely depreciated the value, but overall, like this... Out of pocket cost nothing to travel. 10/10. Convenience. Time: 16:10 - 16:20 Okay, this is bad. Like, this is really bad. I'm not gonna lie. The first half of the trip, I was like: \"Oh, this is fun\". Like, I'm making the most out of these every hour and a half, 2 hour stops. You know, it's cool to, like, stop in a different city, and get some food with Time: 16:20 - 16:30 friends. Like, most of them were fun experiences, but only because we made them fun. But the big buts. Everytime we would have to stop for a supercharger, we would have to like, deviate Time: 16:30 - 16:40 away from our actual path to Chicago, like 5 or 10 miles. So overall, when you have to stop 10 times, it adds so much time to the trip. And like towards the end it got really frustrating, because...first of all: you're Time: 16:40 - 16:50 going to supercharger to get more miles, yet you're using so many extra miles just to get to the supercharger location. If there were just more supercharger locations, I think it'd be solved. But it was really annoying. Time: 16:50 - 17:00 Like on the drive back, I was getting frustrated at how long it would take to just drive like 100 miles, because also convenience... So many times we had to drive under the speed limit, just so we would get to the next Time: 17:00 - 17:10 supercharger location. Because we were driving through the cold, and apparently that makes the battery less efficient. So many different factors, but it was really frustrating. So unfortunately, gotta give it a 4/10. Consistency. Time: 17:10 - 17:20 So did we actually even use autopilot the whole time? Was it safe? Did it work? Blah blah blah. I'm gonna be honest: autopilot on road trips is probably the most OP thing that mankind has ever experienced. Time: 17:20 - 17:30 I was able to look around. I was able to like rest my eyes, whereas I've done other road trips. Feels like literally your eyes are peeled to the 50 yards in front of you forever, especially nighttime. It gets really scary and dangerous when you start seeing things. Time: 17:30 - 17:40 There were a few times, whenever...you know, there was road work or like a lane would merge and you could tell, like the cameras on the Tesla wouldn't be able to detect the fact that the lanes...or it is now like stranger. You just get used to figuring out: Time: 17:40 - 17:50 \"Oh, okay, autopilot is not gonna do well here. Turn it off. And I'm just gonna drive for real for like 2 minutes\". So overall, you did great, honey. Time: 17:50 - 18:00 You did good. Consistent. You get what you asked for, except... Satisfaction. Alright. Overall score. What am I gonna rate it? Look! This SUV is awesome. I mean, it's spacious, fast, decent range. Time: 18:00 - 18:10 Autopilot is sick. I think I fell in love with this SUV on the...on the trip. I think I've realized, like: \"Wow! I really do love this car\", but I would never do this again. 100% never going on a long road trip in this vehicle that requires 11 superchargers. Time: 18:10 - 18:20 We were in Chicago for a shorter amount of time, than we were on the road driving. That's ludicrous. There are games on the Tesla, which is fun. Entertain yourself, while you stop at a supercharger. Time: 18:20 - 18:30 I didn't feel unsafe because autopilot was great. Friends. The only reason I think that this was actually a decent memory to look back on. And 5/10. Thank you guys so much for watching this video that you didn't ask Time: 18:30 - 18:40 for! Smash the \"Like\" button! Subscribe! Peace! I wanted to see if I photoshopped celebrities into my Instagram photos, if Time: 18:40 - 18:50 anyone would notice. You never know if a celebrity could be right behind you. Oh, hey! What's going on? Time: 18:50 - 19:00“You look like you’re 12” wow that cop had no chill",
      "comments": [
        {
          "text": "done anything wrong and comments on his appearance were very unprofessional.\n(Is this when I say I have a YouTube channel?)",
          "author": "Unknown",
          "likes": 21600,
          "timestamp": "Cop : \"You look like you're 12\""
        },
        {
          "text": "Ryan later in the video : Hits puberty",
          "author": "Unknown",
          "likes": 11423,
          "timestamp": "Thanks for stopping by our Waco location! We hope you enjoyed your free coffee."
        },
        {
          "text": "Me an intellectual: that’s not possible",
          "author": "Unknown",
          "likes": 8486,
          "timestamp": "Falling asleep by keeping the tesla in autopilot is like \"If I die, I die\""
        },
        {
          "text": "REALLY well done, good job!!",
          "author": "Unknown",
          "likes": 6139,
          "timestamp": "“How old are you?”"
        },
        {
          "text": "“Im 21”\n“Oh.. you look like youre 12”\nTHE DISRESPECT\nBut also thats kind of fitting bc he sounded like he was hitting puberty the whole video",
          "author": "Unknown",
          "likes": 5477,
          "timestamp": "\"im 21\""
        },
        {
          "text": "\"yeah u look 12\"\n...",
          "author": "Unknown",
          "likes": 4320,
          "timestamp": "That female cop was on a straight power trip. Off the bat she was aggressive with her"
        },
        {
          "text": "yelling “show me your hands” like if she even had a reason for being so aggressive. Cops\nlike her are the reason some cops aren’t trusted. I’m glad y’all got there safely! You make\ngreat content! 󰗢",
          "author": "Unknown",
          "likes": 4199,
          "timestamp": "Ryan: *Talks loudly for 24 hours.*"
        },
        {
          "text": "Ryan: WhY AM i LoSInG mY VoIce?!?\neveryone: ._.\nEdit: now that I have a famous comment. NOTICE ME SENPAI, Or Pingu will visit you\nwhen you go to bed.",
          "author": "Unknown",
          "likes": 4186,
          "timestamp": "why isn’t everyone talking about the fact that they have to road trip back to their house..."
        },
        {
          "text": "Ryan hitting puberty during this whole video",
          "author": "Unknown",
          "likes": 3063,
          "timestamp": "Ryan: “You have to be awake at the wheel”"
        },
        {
          "text": "Also Ryan: *is asleep in the thumbnail*",
          "author": "Unknown",
          "likes": 3062,
          "timestamp": "Nobody:"
        },
        {
          "text": "Trahan: I’m done with driving this damn car, the car is gonna drive me",
          "author": "Unknown",
          "likes": 3060,
          "timestamp": "That “you look like your 12” comment was extremely disrespectful"
        },
        {
          "text": "Edit after 3 months: most likes ever on a comment of mine\nno one gives a sheet\n2nd edit: time stamp for the “look like your 12 comment” 9:54 cuz somebody asked",
          "author": "Unknown",
          "likes": 2878,
          "timestamp": "Plot twist: he’s actually 12 and has voice cracks because he’s going through puberty"
        },
        {
          "text": "something I would expect from a cop especially since she pulled him over for no reason..",
          "author": "Unknown",
          "likes": 2857,
          "timestamp": "Ill see this comment in 2 years"
        },
        {
          "text": "video, I actually forgot he was on autopilot .-.",
          "author": "Unknown",
          "likes": 2503,
          "timestamp": "*\"We're still in Texas.\"*"
        },
        {
          "text": "- every Texan on a road trip",
          "author": "Unknown",
          "likes": 2416,
          "timestamp": "Why does he look like Gordon Ramsay's kid"
        },
        {
          "text": "Realizes he has to drive all the way back",
          "author": "Unknown",
          "likes": 2189,
          "timestamp": "Imagine u just steal the car and it goes straight to the police station"
        },
        {
          "text": "Police officer: you look 12\nPoor Ryan.. :(",
          "author": "Unknown",
          "likes": 1822,
          "timestamp": "Did anyone else notice that when he looked to see if his car was charging, the Tesla was"
        },
        {
          "text": "named Billie? 🤣",
          "author": "Unknown",
          "likes": 1722,
          "timestamp": "*\"You look 12 years old...\"*"
        },
        {
          "text": "*\"You look so Unprofessional..\"* 😊",
          "author": "Unknown",
          "likes": 1690,
          "timestamp": "So autopilot is essentially a glorified cruise control."
        },
        {
          "text": "YouTube: Wanna watch a random guy Trying Tesla Autopilot ?",
          "author": "Unknown",
          "likes": 1615,
          "timestamp": "The “look like you’re 12” comment was completely unprofessional and uncalled for. That’s"
        },
        {
          "text": "extremely disrespectful.",
          "author": "Unknown",
          "likes": 1593,
          "timestamp": "i like how they make it seem he’s broke when he has a tesla"
        },
        {
          "text": "He feels pretty genuine\nThat’s why he makes me feel good watching his vids and he’s entertaining\nI just hope he stays that way\nEven when he gets really famous,and hope he doesn’t change",
          "author": "Unknown",
          "likes": 1228,
          "timestamp": "Imagine we are stealing a car and it takes us to the police station"
        },
        {
          "text": "😬: I’m not driving, my Tesla is.",
          "author": "Unknown",
          "likes": 1152,
          "timestamp": "no one:"
        },
        {
          "text": "ryan: im nervous but this is science and im a scientist\nalso ryan: you dropped out of school and you're unemployed",
          "author": "Unknown",
          "likes": 1105,
          "timestamp": "his voice cracks were so funny he literally sounded like a 14 year old boy"
        },
        {
          "text": "daylight.",
          "author": "Unknown",
          "likes": 985,
          "timestamp": "dosent tell you why she pulled you over, ryan: hm thats weird    dosent smile back ryan:"
        },
        {
          "text": "what the heck did you catch that!",
          "author": "Unknown",
          "likes": 973,
          "timestamp": "\"How old are you?\""
        }
      ]
    },
    {
      "video_id": "video_9",
      "title": "I Built a Survival Shelter Ryan: There's a small community of primitive builders that still exist in our modern era. The only problem? They're YouTubers. Oh, no! Only doing it for the views.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 I would never do that. However, I'm going to attempt to survive a night in a shelter that I build all by myself. No camera crew, no technology, no excavators. So I'm flying across the country to go to the woods. Time: 00:10 - 00:20 So these woods are owned by a dude named Rob. Hi, Rob! It's Rob. I'm giving myself 72 hours to build what I'm calling the Giga Hut. Time: 00:20 - 00:30 However, I spent yesterday learning from Rob, an expert bushcrafter on how to use tools. The axe. We chopped down a few trees. It was awesome. I also learned how to saw, how to start a fire. Time: 00:30 - 00:40 Fire. How do we put this out? How to carve wood to make it look pretty. And now I'm all on my own in the woods, so I can build a Giga Hut. So I walked around with Rob yesterday, scouted everything out, and I landed on this Time: 00:40 - 00:50 area. This is what I'm envisioning. Front door, roof wall, back wall, and then a cute little trail that goes into it. I think that's gonna be perfect. So time is of the essence. Time: 00:50 - 01:00 I'm going to sleep in the shelter in, like 2 days. Oh, yeah, these red lines are because Rob doesn't own the full forest. Someone else owns the forest past that, which is crazy. So yeah, I've got like 40 hours to surprise Rob with the best Giga Hut he's ever seen. Time: 01:00 - 01:10 And I'm pretty much basing this purely off of a YouTube channel I love watching: Cyprien Outdoor Adventures. I love this man to death, but I think he's a little bit better at this than I am. Time: 01:10 - 01:20 Surprise! There's no snakes down here, he said right before there was a snake down there. Looks like I'm digging my...my own grave here. Time: 01:20 - 01:30 I'm trying to lay down in here. Dude, I've got a lot of headroom. For the record, I'm 6'4\". Okay. I know I'm not. I think it's time we move on to the next step: the first wall. Time: 01:30 - 01:40 So right now I'm bringing this stack of wood to my Giga Hut. Now this is some wood that Rob already had cut down. But basically yesterday for like 4 hours, we carved the wood. Time: 01:40 - 01:50 We just carved the bark off of it, so it looks pretty. And I will say it does look very pretty. It's...it's kind of a trek to the Giga Hut, but it's gonna be worth it. Wood. Time: 01:50 - 02:00 I'm gonna use this stuff to build my first wall. Rob said that I am gonna need more, so that's why we cut down 2 trees yesterday. So later I'll get to carve those myself. Time: 02:00 - 02:10 I don't know why I threw that, I need that. Let's get to building this wall! This wall is gonna be essential, because it's gonna be the first and most important structural aspect of my Giga Hut. If a mountain lion tries to get me, let me get him! Time: 02:10 - 02:20 There really are mountain lions out here. So...Rob taught me a building method that's different from Cyprien Outdoor Adventures. Time: 02:20 - 02:30 Cyprien, if you're watching this, I love you. But basically it requires 2 of these on each side. And then you basically just put logs in the middle. You just stack them. And it's super easy, super beautiful. So I'm just gonna do exactly what I just did, again. Time: 02:30 - 02:40 Oh, gosh! Reminder: I have no experience. The rock in there. Time: 02:40 - 02:50 My guy. You're going there. I just sawed all of these from our pile. I'm not sure if this is gonna be tall enough for the whole wall, but if it's not, I'm just Time: 02:50 - 03:00 gonna make the wall shorter by cutting it down. Well, I was trying to think of something awesome to say. Time: 03:00 - 03:10 I couldn't think of anything. I'm gonna start building our wall. This is gonna be insane. Not bad. It looks pretty good. There's a little bit of AC. Time: 03:10 - 03:20 I'm gonna tie these support beams together, and I think it should be pretty solid. Rob taught me some knots. That is a figure-eight knot. Time: 03:20 - 03:30 That has destroyed my wall. Oh, this? Oh, yeah. It's just the wall. So can barely hear you over there. Time: 03:30 - 03:40 I'm gonna keep building. This is the Giga Hut so far. Next, we're gonna build a roof. Basically one of Rob's trees that we cut down. I'm gonna take the bottom part of it, the heaviest part, and set it on this wall. Time: 03:40 - 03:50 And that's gonna be the other side that we're gonna be able to connect the roof to. It's gonna be beautiful. So I'm gonna go collect that log. I keep hearing noises. Time: 03:50 - 04:00 It literally sounds like Minecraft noises. I swear I've heard a creeper like 4 times. Now that would be bad. There's the tree we chopped down yesterday. Still here. I estimate for our rock wall we're gonna need a big log, about this long, so I'm gonna start... Time: 04:00 - 04:10 Start sawing. Why don't I just start sawing? Got this saw for a reason. That is a nice log. Time: 04:10 - 04:20 I'll tell you. There's nothing like being in the woods. I wills. All right. I want the logs to go down to there. Time: 04:20 - 04:30 In theory, I should be able to stuff a log in there and set it there. Time: 04:30 - 04:40 Technically, you know, I'm gonna try to lay some wood Time: 04:40 - 04:50 Oh, look at that! I have good news and bad news. The good news: I upgraded my saw. I was using this one. Found a bigger one. This one just wasn't cutting it. Time: 05:00 - 05:10 And the bad news: Well, it's actually double good news. I have a turkey sandwich. This is awesome. I'm gonna bring you inside. I'm gonna bring you inside. This is literally the most fun thing I've ever done. I basically made a bit of a frame here, and I think I'll be able to make a door here. Time: 05:10 - 05:20 Also, I put that massive rock on that rock. I'm not sure why. They don't show these in the survival videos. I guarantee you, they got them. Oh, this is gonna be so good. Time: 05:20 - 05:30 Mhm! That's awesome. I love it here. You wouldn't expect the Giga Hut to be so cozy. Time: 05:30 - 05:40 I'm gonna process this tree we cut down. So this is the tree. Very nice. I'm gonna cut all the branches off, and then we're gonna skin this bad boy. Time: 05:40 - 05:50 You did nothing wrong, by the way. It's okay, it's okay. Time to carve. Time: 05:50 - 06:00 Get some building off camera. Time: 06:00 - 06:10 I have been wanting to say that since I decided to do this video. This is the difference between husked and un-husked. It's almost hard to see that tree. It actually is. This took like an hour and a half. But between this and this, I think I Time: 06:10 - 06:20 have enough wood to finish this thing. At least the wood part. Oh, yeah. There it is. Okay. Oh, I'm gonna finish building the roof now. Time: 06:20 - 06:30 I think I can do that. I feel like I'm in Twilight right now or Shrek. I can't decide. Let's finish this roof! I'm basically just gonna stack wood horizontally all the way across until we have Time: 06:30 - 06:40 a shape of a window. I'm just gonna horizontally lay them down. Let's do it! Time: 06:40 - 06:50 Hey, I'm gonna give you a little tour on my phone. Doesn't look like much, right now. Actually... You know what? Yeah, it does. This is awesome. We got a rock on another rock. Time: 06:50 - 07:00 Look at this shelter! I know you guys see the vision. A door there. We'll put moss all over the top. That's gonna be insane. We have potentially a fireplace here. No idea if that's safe or if I'm gonna be able to do it. And then the back looking pretty good, you know, mid-century modern. Time: 07:00 - 07:10 That's what I'm calling it, you know. Absolute fortress. Let me show you on the inside! Let me show you the inside! Oh, yeah. Oh, yeah. So cozy. Guys, life is crazy. Time: 07:10 - 07:20 I'm building a Giga Hut. I feel pretty safe in here. Which is kind of crazy because I built it. I'm not even gonna front. I'm sleeping in a hotel between these days. I'm not gonna sleep out here until the shelter is done. Time: 07:20 - 07:30 I'm not tough like other YouTubers. I'm not cool like other YouTubers. But I am survival. I'm at the hotel. Pretty different from the woods. Time: 07:30 - 07:40 Sorry! Tomorrow night will be very different. That's for certain. However... Time: 07:40 - 07:50 Time to grind. Okay. Moment of truth. Let's see if this Giga Hut is still here! Time: 07:50 - 08:00 Yes, I got Starbucks. This is the least survival-y video I've ever seen. Three, two, one. Oh, my gosh! I'm actually so surprised. I'm sleeping in this bad boy tonight. Time: 08:00 - 08:10 So it's time to upgrade the Giga Hut. I'm gonna work on the front door. Time: 08:10 - 08:20 Oh, wow! That is a frame, my friends. Time: 08:20 - 08:30 So before I go and fill this in, I'm gonna try to dig this out some more, because the front door is gonna hinge from there, and I don't want it to, like...it can't open. Time: 08:30 - 08:40 Okay. Much better. I even added a step. You're gonna walk in? Time: 08:40 - 08:50 Cool. Use the step. Also got a ton of rocks from that excursion. That's what I call... I'm gonna keep building. Time: 08:50 - 09:00 That seems pretty legit. Okay. This is literally the dumbest thing I've ever seen. Time: 09:00 - 09:10 This is a door. This is to create tension. So these things don't all roll over like a curtain. I'm gonna see if it stands. I'm gonna be the laughing stock of this forest. Here we go. The rock fell out. Time: 09:10 - 09:20 No! So I got some wood here, got some sticks. And they have a bunch of string all over them, don't they? We're not gonna have a door. Time: 09:20 - 09:30 This might be the worst news I've ever gotten. You're telling me I come out here, build this shelter, and I can't build a door with no experience? But nightfall is in, like, 6.5 hours, so there's work to do. Time: 09:30 - 09:40 So that's the back wall. It's looking cute and wholesome. Look at that chimney! Wow! The Giga Hut is looking better than ever. I can't believe I'm not gonna have a door. Time: 09:50 - 10:00 Okay, so next, I'm gonna go get the branches from the tree we cut down. Cover the roof. Waterproof a little bit. Soon enough, I'm gonna put moss on this thing. It's gonna look so cool. We'll see what we do in the back, in the front. Time: 10:00 - 10:10 But it's branch time. I said that way to chill. It's branch time. Now... It's time to weatherproof the roof. All right, I'm gonna go get some branches. There they are. Let's give it a go! Time: 10:10 - 10:20 Might have to use this. Saw a commemorative branch. Time: 10:20 - 10:30 Oh, gosh! Look at that! Time: 10:30 - 10:40 Huh! Beautiful. So apart from that massive hole in the middle, there should be no rain or anything that can get inside this Hut. Time: 10:40 - 10:50 I'm gonna put dirt over this now, and then I'm gonna start collecting moss, which is gonna be so fun because I don't have moss in Texas. Moss is awesome. Moss-some, even. Time: 10:50 - 11:00 I'm so sorry! Let's cut that out! Time: 11:00 - 11:10 Y'all. Look at this! This is so cool. I'm probably gonna clean it up, get rid of those branches. But for now, the moss. Oh, yeah. Okay, this is crazy. Time: 11:10 - 11:20 This stuff is so pretty. How does this work? Wow, it's so strong. No way. Look at that! It's like a...it's like a nature roof. Look at that! Yeah. Got a bunch of moss in my hand right now. Time: 11:20 - 11:30 I'm pretty survival. I'm pretty primitive. Okay, my friends, this is the commemorative moss I'll put up to the Giga Hut. Time: 11:30 - 11:40 That was awesome. Time: 11:40 - 11:50 It's so cool. Y'all. Time: 11:50 - 12:00 The Giga Hut is forming. Look how crazy this looks! Dude, you just stumble across this in the woods. What are you doing? You're going inside. Look how cool it is! This is looking so good. Time: 12:00 - 12:10 It's actually so quiet in here. Our next 3 tasks are simple. 1. Try to finish the chimney. 2. Clean up the landscaping. Maybe rake or something. Time: 12:10 - 12:20 Use the...I don't know. And 3. Plant some ferns. It's gonna look so cute. After that, I can actually start working on my bed. I keep forgetting I'm sleeping here tonight. So let's get rolling! Time: 12:20 - 12:30 Oh, yeah. Time: 12:30 - 12:40 On a trek to get some fern. I'll do anything for landscaping. Oh, this is great. Look how pretty it is! I hope it's not poisonous. Time: 12:40 - 12:50 I don't know, I don't know anything. All right, up. There we go. Okay. Time: 12:50 - 13:00 Last idea is some moss right in this section. This stuff is so good. I mean, not that I've tried it. It looks so...I don't know. Very fun to rip out of the ground. Time: 13:00 - 13:10 The moss adds so much. It looks so cool. Time: 13:10 - 13:20 The chimney's so cute. Here, I'm gonna add some horizontal logs. I'm not gonna worry about carving them. And then some... Some of this stuff. Hopefully that'll keep me warm tonight. Apparently now it's gonna be 37°F, which is almost freezing. Time: 13:20 - 13:30 A few more. Yes! Time: 13:30 - 13:40 It's gonna start putting the branches here. I don't want it to catch on fire, that's for sure. That should make us a little warmer tonight. That should. It should do something. I'm gonna go check inside, see how we're doing. Time: 13:40 - 13:50 Okay. This is insane. This is where the wind would be coming from tonight, I think. I honestly don't know. I'm just trying to make myself feel better about this wall. Time: 13:50 - 14:00 Ooh, yeah! I actually can't believe I built this. I'm gonna do one more thing, and then I'm gonna eat a sandwich. So I'm just gonna collect some winter green thistle. Time: 14:00 - 14:10 That's what it's called. And I'm gonna put it in here. That's what I'm going to sleep on. It should make me warmer, according to Rob, than just the bare ground. Giga Hut appreciation moment. Nice. So Rob taught me that this is winter green. Time: 14:10 - 14:20 Like the same stuff they put in gum. He literally said you could... I'm gonna grab a bunch of this stuff and put it in the bed. I want to make Rob proud. Time: 14:20 - 14:30 All 1. It's gonna put that there. Gonna need quite a bit of this stuff. All 2. Let's put that right there! Testing it out. Oh! Oh, that's actually so much better than the ground. Time: 14:30 - 14:40 I'm gonna get more. That's nice. And it smells good. Guys. I think it's about that time. Time to eat my turkey sandwich. Time: 14:40 - 14:50 I've also got some candies. So can you believe this? Now, seriously. I genuinely cannot believe this. I had no idea what I was gonna be able to do. No clue. Tonight I wanna start a fire in the chimney. Time: 14:50 - 15:00 I'm super excited to show Rob. And honestly, I'm just excited to sleep in this thing. I have no clue how this came together. Like, honestly, my luck, it's just gonna fall over any second. I'm not gonna say that. I'm not gonna say that. But this is definitely out of my Time: 15:00 - 15:10 comfort zone. And I will say that my attire this whole time has been so good. The boots, the sweatpants, the construction vest. Oh, and if you guys were wondering what hoodie I'm wearing, very good for survival. Time: 15:10 - 15:20 I'll show you what hoodie this is. It's my hoodie that I'm...that I'm launching. That's why this video is sponsored by Shopify. Come here! Come here! So I haven't personally sold anything on YouTube in such a long time. Growing up, Time: 15:20 - 15:30 I wanted to start businesses all the time, and I actually did in high school and a little bit in college. However, they failed. Now YouTube took a big front seat for me. Time: 15:30 - 15:40 I just started working super hard on my YouTube videos, and I kind of told myself: I'm not gonna try to sell anything unless it's just perfect and I'm super excited about it. Well, you may have seen me wearing this awesome hoodie throughout the video, and Time: 15:40 - 15:50 maybe even this t shirt as well. Today is a super exciting day because I'm launching Howdy Howdy. See? It says \"Yeehaw\". See? It says \"Howdy\". The merch brand I'm working with is kind of nervous because these designs Time: 15:50 - 16:00 are, um, amateur, I guess. I think they're awesome. Look how silly the little skeleton cowboy is. He's got goofy glasses on. He's even drinking a coffee. That's so cute. I've worked super hard on it. Time: 16:00 - 16:10 I think this drop is so good, and Shopify has helped me throughout the entire process. Shopify is an e-commerce platform, so any business you wanna launch, you can launch it with Shopify. I even built the Howdy Howdy website with Shopify. Time: 16:10 - 16:20 Very easy. And they give you an amazing dashboard to see all of your data, like who's coming to your website, if people are buying your stuff or just leaving. So if you're like me and you've been thinking about trying to start something for a long time, let this be your sign! Time: 16:20 - 16:30 Just give it a shot! If you go to shopify.com/ryantrahan and start your business, you get a free trial. You got nothing to lose. So huge thank you to Shopify for encouraging me to do this. I'm nervous. If none of you want the \"Yeehaw\" hoodie, it's okay. But if you do, you can Time: 16:30 - 16:40 pre-order through the link in the description. Howdy Howdy. I am so excited to see Rob's reaction. I'm gonna try to start a fire. Time: 16:40 - 16:50 Alright. I just collected a bunch of wooden sticks. So I've got these to try to keep the fire going. And Rob taught me a trick of getting 3 kinds of pieces of wood: pencil lead, pencil, marker. I'm gonna try to start a fire. Time: 16:50 - 17:00 This is kind of crazy. Time: 17:00 - 17:10 Oh! Come on! Yes! The chimney's working. This is crazy. Time: 17:10 - 17:20 That is a fire. Potentially a hazard as well. I don't know anything about survival. This is crazy. One day with Rob, that's all I have. But Giga Hut is thriving. Time: 17:20 - 17:30 Oh! Okay, guys, here is the final Giga Hut tour. The front yard. Oh! The side yard. Time: 17:30 - 17:40 Diag...diagonal yard. I don't know. The roof. Structurally unsound, but cool. The chimney. Need I say more? Time: 17:40 - 17:50 The back of the Giga Hut. That's gonna keep me warm. What a beautiful home. This might be the best thing I've ever done in my life. I'm in New Hampshire. Who knew you could do stuff like this in New Hampshire? So I just got a text from Rob. Time: 17:50 - 18:00 He's coming over to my... To my hut. I'm gonna meet him in the woods because I don't want him to see it. I'm gonna do a little countdown, surprise him. So let's go meet up with the master and see what he thinks about his student. Time: 18:00 - 18:10 Rob, I'm so excited to show you what I built. Rob: Man, I can't wait. Ryan: Oh, my gosh! Oh, you got pizza. All right, we're approaching it, so eyes down. Follow me! Follow me! Time: 18:10 - 18:20 Little bit more, little bit more. All right. Three, two, one. Rob: Oh, wow! Rob: You're somewhere behind this house? Ryan: Yeah, that's it. Time: 18:20 - 18:30 Rob: Man. I gotta go in. Ryan: You gotta go in. Rob: Yeah. Ryan: I did have a fire going earlier. Rob: That's safe. Ryan: Yeah. Rob: I would use that. Ryan: Really? Rob: Nice job. Ryan: Let's go! Time: 18:30 - 18:40 All right. Let's see what we got here! Oh, baby! Ryan: Cheers, Rob! Rob: Cheers! Ryan: To the Giga Hut! Wow! Rob: I'm proud, dude. Ryan: Thank you! Rob: Good job, man. Ryan: Thank you, Rob! This is honestly one of the most fun. Time: 18:40 - 18:50 This is the most fun video I think I've ever shot. Rob: Really? Ryan: Yeah. Do you think it earned the name Giga Hut? Yes, absolutely. Time: 18:50 - 19:00 So Rob left me with a care package of sorts, including this beanie. Gave me this little fabric and a sleeping bag. He said it's gonna get insanely cold. Like, not underestimate how cold it's gonna get tonight. Time: 19:00 - 19:10 He also said I can make a pillow using this and putting some of this fern inside. So I'm gonna make a pillow. That's a pillow waiting to happen. And then build a pillow. And just lay this out like this, cross, and then I'm gonna tie Time: 19:10 - 19:20 it. My phone is definitely not in my mouth. And that is a pillow. Oh, it's actually so nice. Rob also gave me a sleeping bag. Time: 19:20 - 19:30 There it is. Oh, yeah. Oh, man. I don't know what just fell on me. I'm honestly pretty warm right now, but I am just kind of freaking out. Time: 19:30 - 19:40 It's just really quiet out here. Kind of crazy. As soon as...as soon as I stopped cording, I seriously...I seriously just got to go to bed. Time: 19:40 - 19:50 See you in the morning! Hopefully. I feel fine. I'm being dramatic. All right. Good night! Time: 19:50 - 20:00 Rob! Rob: Morning! Ryan: Oh, he's got the coffee. Oh! Rob: How was it? Ryan: Oh, it was off. Time: 20:00 - 20:10 It was off. Rob: You survived. Ryan: Yeah, I survived. Rob: This is nice and hot. Ryan: Oh! Thank you! Thank you! Time: 20:10 - 20:20 Mhm! You know what, Rob? I think you could say that this Giga Hut is now a Giga Home. Time: 20:20 - 20:30 Ryan: Cheers! Rob: Cheers! Ryan: All right. That's good. Time: 20:30 - 20:40 Thank you! That's Rob's wife holding the camera right now. Thank you! Time: 20:40 - 20:50How did Ryan survive this long with out mc Donald’s ice coffee 😮",
      "comments": [
        {
          "text": "Coyote Bushcraft. Love you brother!\n-Rob\nP.s that was hemlock!",
          "author": "Unknown",
          "likes": 5677,
          "timestamp": "Other YouTubers are out there doing mansion tours, so seeing Ryan get excited over a"
        },
        {
          "text": "stick hut is very refreshing",
          "author": "Unknown",
          "likes": 4391,
          "timestamp": "Rob was so wholesome and supportive"
        },
        {
          "text": "Hides nothing and don't care. This is what makes Ryan so awesome! Well that and the\nconstant corny jokes.",
          "author": "Unknown",
          "likes": 3670,
          "timestamp": "Ryan: \"waterproofs\" roof with moss and leaves"
        },
        {
          "text": "Also Ryan: leaves a big hole in the middle",
          "author": "Unknown",
          "likes": 3465,
          "timestamp": "I love how Ryan actually captures the reality of camping in a more natural way. Your food"
        },
        {
          "text": "tastes better, the shelters feel cozy, and overall it's a super peaceful experience that\neveryone needs to try.",
          "author": "Unknown",
          "likes": 3078,
          "timestamp": "ryan is such a simple guy getting pleased by simple things"
        },
        {
          "text": "proud of him 😭😭😭 ♥♥♥",
          "author": "Unknown",
          "likes": 1817,
          "timestamp": "Ryan is really out here trying to complete all side quests."
        },
        {
          "text": "do that and actually shows he's a truthful person",
          "author": "Unknown",
          "likes": 1603,
          "timestamp": "I feel like he's not \"afraid\" to show us absolutely every detail to us and I love it like for the"
        },
        {
          "text": "hotel and starbucks part xD",
          "author": "Unknown",
          "likes": 1395,
          "timestamp": "Watching Ryan being so excited to show rob what he made is actually so wholesome"
        },
        {
          "text": "survival shelter until he sees it and tells his kids all about it",
          "author": "Unknown",
          "likes": 840,
          "timestamp": "“And the bad news…we’ll it’s actually double good news.”"
        },
        {
          "text": "I feel like Ryan is the only person who’s ever said that.\nI love how positive this man is",
          "author": "Unknown",
          "likes": 781,
          "timestamp": "I like how Ryan just makes so many friends along the way, with whatever endeavor he’s"
        },
        {
          "text": "accomplishing. It’s heart warming ❤",
          "author": "Unknown",
          "likes": 780,
          "timestamp": "Rob is such a great guy. Giving you a chance to do this, always bringing food or coffee. we"
        },
        {
          "text": "need more pure souls like he is.",
          "author": "Unknown",
          "likes": 747,
          "timestamp": "Ryan looks like he is living a childhood dream and that's wholesome as hell"
        },
        {
          "text": "Also Ryan: builds an amazing hut in 2 days",
          "author": "Unknown",
          "likes": 670,
          "timestamp": "Ryan has this perfect intentional awkwardness to him. Love it!"
        },
        {
          "text": "other horrible youtubers",
          "author": "Unknown",
          "likes": 634,
          "timestamp": "Full-time Army dood here, and watching someone with little to no experience build a shelter"
        },
        {
          "text": "this good was quite impressive. Very well done, buddy. 👏",
          "author": "Unknown",
          "likes": 622,
          "timestamp": "Can we just give him a round of applause for how hard he worked 👏"
        },
        {
          "text": "smiling towards the end (and i dont usually smile at videos like this), especially when u\nguys had pizza. well done ryan! :))",
          "author": "Unknown",
          "likes": 536,
          "timestamp": "I love how Ryan is just friends with everyone man, one of the most extroverted youtubers I"
        },
        {
          "text": "have ever seen.",
          "author": "Unknown",
          "likes": 525,
          "timestamp": "Ryan is really one of the kings of not clickbaiting or faking videos."
        },
        {
          "text": "actual tools and didn’t make a door",
          "author": "Unknown",
          "likes": 515,
          "timestamp": "I love how Ryan went from 100 days in vr to, I'm gonna build a hut and survive in the wild"
        },
        {
          "text": "I think that something that puts him apart from others is his editing style. The editing style\nused in the videos is very basic, but also unique",
          "author": "Unknown",
          "likes": 491,
          "timestamp": "Rob is literally so kind! And the hut was actually  wonderful"
        },
        {
          "text": "chill music background, just another normal day with Ryan.",
          "author": "Unknown",
          "likes": 454,
          "timestamp": "How Ryan always manages to outdo himself will never cease to amaze me."
        },
        {
          "text": "almost had the door right, but instead of a rock a branch going horizontally across the other\nbranches and winding the string around it with each log and you'd have a door",
          "author": "Unknown",
          "likes": 383,
          "timestamp": "You looked so genuinely happy building that shelter! Please make this a series on how to"
        }
      ]
    },
    {
      "video_id": "video_10",
      "title": "I Stayed in “OMG!” Airbnbs Ryan: There is actually an OMG section on Airbnb's website full of the weirdest houses in the entire world. A crane, a literal UFO, an apocalypse bunker, whatever this is.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 Today I'm leaving America to go stay in the most strange Airbnbs on the entire planet that you won't believe are real. However, I must have an OMG moment at each location. Time: 00:10 - 00:20 Otherwise I have to leave a 1 star review. And I hate 1 star reviews. Also, I have to buy a dog toy in each country I visit because my Chihuahua, Spock is so bored of all of his toys. Time: 00:20 - 00:30 Oh, no! It's actually really sad. I just wanna make him happy. So with that being said, to Amsterdam. Time: 00:30 - 00:40 I am in Amsterdam. I am in the Netherlands. Before I climb up the stairs and go inside of this crane to sleep in it, I'm gonna read some of these 5 star reviews that I think are hilarious. Silke said: Time: 00:40 - 00:50 \"We can't stop raving! What a brilliant idea to turn old crane into hotel. And when it's an idea as such, thoughtful, thoughtful thoughtful, thoughtful, thoughtful! This is the smallest, most perfect, most cozy, panoramic, steepest, coolest, and most Time: 00:50 - 01:00 loving hotel we have ever been allowed to move into!\" 5 stars. That is a huge statement, Silke. What does she mean she moved into it? Time: 01:00 - 01:10 Is she still in there? Patrick said: \"We took full advantage that you can turn crane. Sunset and pizza in the evening. Sunrise and coffee in morning. Crane spacious enough for 2 adult and 1 baby. Only the spider plague in the area was very disturbing in the evening.\" Time: 01:10 - 01:20 5 stars. I'm sorry! What? Spider plague? Patrick! Talk to me, Patrick! What do you mean by that? Finally, Joanna said: \"Our delivery boy had a laugh when he arrived with our food. Time: 01:20 - 01:30 He want to come in and operate crane, but we didn't feel comfortable.\" 5 stars. Needless to say, I am very excited to go up in that crane. Enough yapping. Let's crane! Time: 01:30 - 01:40 All right, I made it. That's the crane operating room. And this is the Airbnb. Time: 01:40 - 01:50 This is so crazy. So this place doesn't really need much of a tour. It's basically one room and a bathroom, but it's segmented. So the dining room, the bedroom, the kitchen also very nice. Time: 01:50 - 02:00 The bathroom. Oh, sorry! The bathroom's in here. This bathroom is so cool. But I think the coolest thing about this place by far is stuff like this. That is Time: 02:00 - 02:10 simply part of the crane. Like, I think that's where the crane rotates. While this place is amazing, have I had my OMG moment yet? No. I want that moment of moving the crane around to be so special that I have an Time: 02:10 - 02:20 involuntary reaction and I actually say OMG. Unironically. I'm gonna wake up early for the sunrise if I survive that long. According to Patrick's review, I estimate that a spider plague is gonna hit this Time: 02:20 - 02:30 crane in about 2 hours. I just don't know what that means. So if I make it to tomorrow morning, that's gonna be a miracle in itself. Time: 02:30 - 02:40 Before the spider plague hits, I think I'm gonna run to the pet store, get Spock a toy. Then I'm gonna order some pizza to see if a delivery boy will actually climb up these stairs and give me a pizza here. And then I guess I'm just gonna find a way to survive the spiders. Time: 02:40 - 02:50 I went out to a local pet store to get Spock a new toy. The cool thing about Europe is I've literally never seen any of these dog toys in America. And now that we're one step closer to making Spock happy, I headed back to the Time: 02:50 - 03:00 crane for a pizza. New York pizza in Amsterdam. Let's do it! An hour later, I started hearing footsteps outside of the crane. It sounds like a small militant group is coming up these stairs. Time: 03:00 - 03:10 These sounds are not comforting. However, I do smell pizza. There he is. Awesome. Thank you! Delivery guy: Here you go, man. Ryan: Cheers! Time: 03:10 - 03:20 Appreciate you, Camille. All right, take care! Bye-bye! Oh, yeah! What the...I don't think I ordered that, but it looks gas. Nothing quite like a New York pizza in the Netherlands. Time: 03:20 - 03:30 That's crazy. To many OMGs in this video. I'm impressed, Amsterdam. It's just so funny, I'm in a crane right now. Time: 03:30 - 03:40 I'm having a great time. But this is just one of many OMG Airbnbs in this video. This video is an adventure. This is gonna be crazy. It is definitely evening and so far no spiders, which is a Time: 03:40 - 03:50 huge win. I'm gonna destroy this pizza, take a shower and go to bed. It's an early night for me because I do not wanna miss sunrise. I cannot miss my OMG moment. Mm. Time: 03:50 - 04:00 Good night, everybody! Good morning, Sleepyheads! I'm over here. I'm gonna go do the crane. Time: 04:00 - 04:10 All right. I'm entering the operating room and losing my voice at the same time. Whoa! Whoa! This is insane. Oh, this is actually kind of scary. All right, here goes nothing. Time: 04:10 - 04:20 Does that work? It is kind of slow, but I think that's appropriate. Time: 04:20 - 04:30 Wow. Needless to say, this was an OMG moment. And with that, I've got a flight to catch to the next one. Time: 04:30 - 04:40 To the next OMG Airbnb. All right. So every single Airbnb that I'm going to in this video are countries that I've either never been to before, or have spent very little time in. Time: 04:40 - 04:50 The next one is in Wales. I cannot wait to go to Wales. Before I headed to the next Airbnb, I stopped at a local pet store and got Spack a toy. Star Monkey. He's gonna love this one. Time: 04:50 - 05:00 Let's check out the Airbnb! I have been abducted by aliens. It's true. And it was on purpose. I am currently in Wales, like rural Wales. It is so beautiful here. Time: 05:00 - 05:10 It actually feels like another planet. It does, which is fitting because it was behind me. Came from another planet. This Airbnb behind me is probably the most famous one that I'm going to. It's literally the photo that Airbnb uses to promote their OMG section. Time: 05:10 - 05:20 They use a UFO icon as well. So this is a pretty big deal. There is one image on the listing that actually gave me a jump scare when I was swiping through it. It's this one. My goodness, that is a horrifying image. Time: 05:20 - 05:30 Why is he standing like that? Regardless, I'm...I'm recreating it. I have to. Before I step inside and get fully abducted, listen to these 5 star reviews! First we have Karen. This gotta be the only five star review a Karen has ever left. Time: 05:30 - 05:40 This is probably not true. \"Great experience. Had heaps of fun recreating alien landing with all the props provided.\" 5 stars. Recreating alien landing? That sounds sick. I'm doing that. Time: 05:40 - 05:50 Wayne said: \"It's just so unusual, there is no comparison. Completely unique dwelling. There is also 2 planes, submarine, bubble tent and more. Also a disco church.\" 5 stars. What in the world? Looks like somebody's going exploring later. Time: 05:50 - 06:00 It's me. I'm referring to myself. Finally, Minty said: \"Not very cozy, but it is spaceship. Not known for their comforts! The kids enjoyed Galaxy Projector at night. Time: 06:00 - 06:10 However, we were snug as bugs in this space.\" 5 stars. I wanna be snug as a bug. I love European reviews. They have so much personality. I feel like Americans just leave reviews like this. And for some reason, we're always a Time: 06:10 - 06:20 little mad. All right, now I have a plan. Let's proceed! Just in case there's really aliens in here, and I'm gone forever after this, thanks for watching my videos! Time: 06:20 - 06:30 I really appreciate it. This looks insane. What's up guys? I come in peace. Just got abducted by aliens. I'm just gonna show you guys around my room. Little bed for baby aliens. Another little bed for baby aliens. Time: 06:30 - 06:40 Queen size bed for mom and dad. Think I'm taking this one tonight. Robot dog and this thing. Can't wait for nighttime. That's gonna be sick. Another robot dog and lava lamp, which I just turned on. That should look cool pretty soon. Time: 06:40 - 06:50 Moon table. How do they fit that thing on there? Dude, I love this place. There's also Space Invaders. Little cute robots. Movies about space. How much better does it get than Lego Star Wars? Time: 06:50 - 07:00 Dude, come on! This is so fun. There's also a nice bench outside which looks eerily fake. Like that does not look like it's real. I'm gonna go try to sit on it, okay? I'm gonna...I'm gonna go try to sit on it. Time: 07:00 - 07:10 I'm fine, guys. It's me, Ryan. Right? Me? What up? Stupid, stupid. I'm actually having so much fun. Time: 07:20 - 07:30 Who is that? I didn't realize I wasn't alone. Am I seeing things? Why didn't they walk to... Oh, there they are. As I was saying, I feel like this Airbnb was designed for a kid or Time: 07:30 - 07:40 just an adult who's interested in aliens and space stuff, which, I fit that category. I do. This place is gonna get fun at night. The outside lights are customizable. Time: 07:40 - 07:50 I can recreate that image I wanna recreate. But until then, I've got some housekeeping to do. This Airbnb comes with this guest house with a bunch of amenities. So before the sun goes down, I've got some stuff to take care of in the guest house. Time: 07:50 - 08:00 And I also wanna go to this cute town, like 10 minutes away to grab dinner. It looks gorgeous. It's a beautiful day. And when night falls, we recreate alien landing. Time: 08:00 - 08:10 I walked over to the guest house to do some laundry and I was just thinking: \"Man, I could live in a UFO for my entire life\". I decided to explore a little bit and see if that review was right. And he was. This airplane is also an Airbnb. Time: 08:10 - 08:20 It seems like they are still working on it. I can finally say I stepped foot in a private jet. This is crazy. I also found the disco church, I think, and decided it was time for dinner. Time: 08:20 - 08:30 I drove down to the town to get some food. In Wales, you drive on the left side of the road which was very scary. I finally made it. I walked into town, walked back to get my camera and thought, wow, where the heck am I? Time: 08:30 - 08:40 I would have never come here if this UFO was not listed on Airbnb, and this might be one of the prettiest towns I've ever seen in my life, especially because they got burgers. It was really good. As I was walking back to my car, I saw the moon over the ocean. Time: 08:40 - 08:50 It wasn't quite OMG but it was bruh. It was beautiful. Oh, yeah! I'm in the United Kingdom. Oh, whoa! Time: 08:50 - 09:00 Almost fell. Made it back to my UFO. I feel like that's the most YouTuber thing I could have possibly said in my life, but I'm rolling with it. Is this cute? That is the funniest looking robot. I'm sorry! He's funny. Time: 09:00 - 09:10 I cannot stop thinking about Karen's review where she said she recreated a UFO landing. I am really tempted to ask the host to help me do that. Like what do I do to recreate a UFO landing? Time: 09:10 - 09:20 But while I build the confidence to message him, I've got some things to do around the UFO. Apparently there's curtains for the windows under the bed. I've got to play Space Invaders and I might as well watch Guardians of the Galaxy. Time: 09:20 - 09:30 It's gonna be a good night. Let's get started! Time: 09:30 - 09:40 Guys, come on! This is so cool. There's a lot of action going on outside. That's my main takeaway. How could these possibly be adjacent to each other? And this one and even this one, that one. Time: 09:40 - 09:50 That's a view of a planet. I also plugged in Space Invaders. I stink at this game. I got a little frustrated, but luckily I have something else to do. Watch the entire first movie of Guardians of the Galaxy to prepare for my alien landing. Time: 09:50 - 10:00 As I watched 11 year old Chris Pratt get abducted by aliens, I started to really question my decisions for this week. All right, I'm proud to announce that I have texted Jake, the Airbnb host, about Time: 10:00 - 10:10 recreating this UFO landing. He said on my way. Is that good or bad? For better or worse, we're gonna find out. I think he's here. Hey! Jake: How are you? Ryan: Good. How's it going? Time: 10:10 - 10:20 So I'm here with Jake and Toby. What should I do? I'm gonna walk out. And should I, like, say something like, uh, \"we're turning on some smoke\". Jake: \"I'm here, Earthlings.\" I like that one. That might be better. Ryan: Oh, that's so much better. Time: 10:20 - 10:30 I'm here, Earthlings. Can I say that with the accent or no? Jake: Yeah. Ryan: Is that okay? Jake: I'm here, Earthlings. Ryan: I'm here, Earthlings. All right. Cool. Time: 10:30 - 10:40 Match cut. All right. Ready? Time: 10:40 - 10:50 I am here, Earthlings. That was sick. Like and subscribe Time: 10:50 - 11:00 or else...That was good, Tobi. They're really gonna be afraid of that. That was so fun. I don't know what makes me happier. The fact that I got to do that, or the fact that they did that for a woman named Karen Time: 11:00 - 11:10 from the UK who didn't document it or anything. This is absurd. Honestly, our journey has just begun. I'm gonna get some sleep because I've got a UFO to catch in the morning. I'm just going to the airport. Good night! Good night, guys! Time: 11:10 - 11:20 I actually just woke up in a UFO. Good morning! Time: 11:20 - 11:30 Let's go to the next one! Next, I hopped on a flight to a country that I, with all due respect, did not know existed prior to this video. And honestly, that's a disservice because it is the most beautiful country I have ever Time: 11:30 - 11:40 been to. I am now in Slovenia. Slovenia. I love you, but where the heck am I right now? Our next OMG Airbnb is this mountain chalet. Time: 11:40 - 11:50 You don't know what a chalet is either? I'm gonna look it up. What is a...okay. Oh, yeah. Yeah. That's it. Just getting to this Airbnb might warrant an OMG in itself. Time: 11:50 - 12:00 First I got a rental car. They gave me a Mercedes. I drove in the car for 35 minutes until I got to a ski lift. And then I did a ski lift ride up this mountain with a bunch of strangers. Time: 12:00 - 12:10 I don't know where they're going. Then I did a chair ride even higher up this mountain. And lastly, I did a 15 minute hike until I got here. But I think I can easily say this is the craziest view I've ever seen in my life. Time: 12:10 - 12:20 Even on the way up, I got this shot. I can't believe that's real. Slovenia. The only thing that can make this better is if I see this little guy from the listing, Time: 12:20 - 12:30 the Airbnb listing. It's a little cold out here, though. I don't blame him if he's down in Florida for the winter or something, I don't know. Before I step into the chalet, I'm gonna read some of these 5 star reviews. Time: 12:30 - 12:40 Patricia said: \"Our stay at chalet was amazing! Nik, wonderful host. He is known for his warm welcome. From dining room you can see the Alps and the sunset, like a movie directed by Time: 12:40 - 12:50 Hollywood.\" 5 stars. I haven't run into Nik yet. Maybe he was on the ski lift. Tanya said: \"House in perfect condition, with so many technological gadget, we couldn't believe it! You find everything in house that heart desire - sauna, big smart screen TV, Time: 12:50 - 13:00 comfortable beds, food and drink. And I cannot explain the sunrise or sunset. The only thing to say is »what«.\" 5 stars. I'm looking forward to that. That's a little anticlimactic, but I'm not judging. Time: 13:00 - 13:10 I don't know. Jared said: \"Don't make mistake...\" Is that it? Oh! \"That ladder steep.\" 5 stars. I don't know what the ladder is to, but can't wait to climb it. Time: 13:10 - 13:20 And maybe most profound of all, Astrid's 5 star review says: \"Everything is fine. We'd love...\" 5 stars. That's...that's it. That's enough reviews. Time: 13:20 - 13:30 I'm going inside. Oh, my gosh! I said OMG. That was not voluntary I promise. Time: 13:30 - 13:40 Wow! I am 25 years old. If this is a chalet, I've been missing out my whole life. This mudroom is so cozy! Sandals? Y'all. Time: 13:40 - 13:50 This kitchen, bench and dining combo. Unbelievable. Oh, that's fire. It's literally. I see what Tanya was saying about the technology. Time: 13:50 - 14:00 There's so many electronics right here. We've also got a pantry room with a fridge, super cozy lounge area, and maybe my favorite part: a sauna. Time: 14:00 - 14:10 My dad is gonna lose it when he watches this. He loves saunas. That means don't get that man around anything 180°F! This chalet is amazing. I love saying chalet. I'm gonna keep saying it. Time: 14:10 - 14:20 However, I think what makes this place OMG is absolutely this view. This window looks like a screensaver. Look at this! I might just take a photo and make this my actual screensaver on my phone. Time: 14:20 - 14:30 Put my money where my mouth is, I might as well do it. See? This place is silly. This is just a silly experience. I think I'm gonna shovel a walkway just to make going in and out a little bit easier. Time: 14:30 - 14:40 And then to celebrate, I'm gonna go get dinner. There's a restaurant, like, 10 minute walk away. Let's do it! You literally can't tell I did anything, but I did. Time: 14:40 - 14:50 You saw it on camera. I captured it as evidence. I'm gonna go to dinner. It's about a half mile walk to the restaurant. But if you're filming for a YouTube video, it's about a mile. Time: 14:50 - 15:00 I can't just leave my camera behind. I made it to the restaurant and potentially heaven. Um, would not be surprised if it looked like this. I hope they're open, I really do. Time: 15:00 - 15:10 Hey, you said you guys are out of food? Okay, gotcha. Thank you! So I've been a busy bee today. I haven't eaten yet. It's dinner time. Time: 15:10 - 15:20 I go to the restaurant. They're out of food. Peculiar thing for a restaurant to be. So I'm walking back to my chalet. I'm panicking. I'm thinking, what am I gonna do tonight for dinner? Can't DoorDash to a chalet. Time: 15:20 - 15:30 And I get a text from an unknown number. It's Nik. I was wondering when he would show up. He's saying there's loads of food in the chalet. I didn't see it, but I believe him. I'm also extremely confused and maybe even concerned as to how he got my number, and how Time: 15:30 - 15:40 he knew that I was rejected at the restaurant. Well, all right. Time: 15:40 - 15:50 I am back home. If you saw me slip in the snow, no, you didn't. So according to the text message that Nick sent me, this right here, inside the floor is where a bunch of food is, which is like, I don't know, that's kind Time: 15:50 - 16:00 of cool, but it's also kind of weird. I guess I'm just gonna bust into the floor, try to find some Cheez-Its or something. Time: 16:00 - 16:10 What the heck? I thought I was just gonna be a hole in the ground with, like, a bag of goldfish. Look at this! I'm scared I'm gonna get trapped down here. Some pasta, some sauce. Time: 16:10 - 16:20 Can't go wrong with pasta night. That's all I know. I did not expect this to turn into a cooking video, but here we are. Welcome to pasta night with Ryan in Slovenia in an OMG Airbnb, because the restaurant ran Time: 16:20 - 16:30 out of food. It's a weekday, so it's understandable that they haven't gotten their food shipment yet. I'm still working on the title of this show. First things first, you wanna fill up a pot with water. Time: 16:30 - 16:40 Next, put it on the stove top. Your water should immediately be boiling. Even though I don't realize it yet, this is way too much pasta for one small boy. Stir the pasta regularly. I learned that from my boy, Gordon Ramsay. Time: 16:40 - 16:50 Finally, drain your spaghetti and toss it like this because it looks cool. I just dumped it into a big glass bowl that I found and a ton of sauce as well. And voila, spaghetti night is complete. Time: 16:50 - 17:00 I think I'm gonna have some leftovers. This is a lot of pasta, but I'm also really hungry. You know what? I'm happy I had to make dinner. This is a treat. I haven't had spaghetti in so long. Time: 17:00 - 17:10 Game plan for the rest of the night: eat 14 servings of spaghetti. Then I'm gonna go back down to the bunker, find some dessert. Then I gotta hit the sauna. You can't be here and not do the sauna. After that, I might cuddle up. Time: 17:10 - 17:20 Wait! Where's the... I don't know where the bed is. Well, after the sauna, I'm gonna try to find the bed. Hopefully there's one of those. And if I can find it, cuddle up in bed, watch cozy movie. Time: 17:20 - 17:30 Let's get after it! That spaghetti was so good. I have saw stains around my lips. Time: 17:30 - 17:40 I tried getting it out for 10 minutes. Let's not talk about it! Let's not do that! I'm going back down to see if I can find a fun snack. And Jared is right. This is a steep ladder. Oh! Fun snack, fun snack. Time: 17:40 - 17:50 I mean, there's some sort of juice. Looks like rice, beans, sauce, water. A variety pack of Joyride Sour Strips? Time: 17:50 - 18:00 What are the odds of Survival Bunker in Slovenia has all 4 flavors of Joyride? Sike! I planted these here myself. While you were busy watching a time lapse of me eating 14 servings of spaghetti, I snuck down here and planted my personal stash of Sour Strips Time: 18:00 - 18:10 in this underground pantry in a mountain. All of that effort: just so I could naturally tell you about Joyride without making it Time: 18:10 - 18:20 awkward. Let's go upstairs! It's cold. If you're like me, you love fun snacks. When I think of my wish list for a fun snack, I think of three things. It's not gonna make me feel awful, no artificial stuff and taste amazing. Time: 18:20 - 18:30 Well, recently I launched my candy called Joyride, and I can honestly say: this accomplishes all three of those wishes. I mean, look at our blue raspberry Sour Strip! This is the only blue raspberry Sour Strip in the world that does not use fake colors to Time: 18:30 - 18:40 make it look like a crayon. Joyride is coming to retail stores very soon. My dream is to get my candy into Target. They responded to me and said they need to see that people care about us. Time: 18:40 - 18:50 Which, fair. So if you've bought Joyride or if you just wanna help your boy out, follow Joyride on Instagram, so that Target sees that y'all care about us. Time: 18:50 - 19:00 Tag them in a story with Joyride! Comment on their post to put our Sour Strips in! As of right now, we are sold out of our 4 packs, which...that is insane. But if you wanna be the first person to find out when our Sour Strips are off the Time: 19:00 - 19:10 line, click the link in the description! Put in your email, your phone number! I'll let you know. Now that I've had my fun snack, let's hop in the sauna! Time: 19:10 - 19:20 This sauna is incredible. Which means the shower must be insane. Time: 19:20 - 19:30 Not a ton of water. I am ready to sleep in this OMG Airbnb. Now, I was convinced that I would be sleeping on this bench tonight. I thought this was the bed. Would have been fine with it. Time: 19:30 - 19:40 I would have been happy with it. But I kept thinking about Tonya's review, explicitly saying that the beds are comfortable. And look what happened as I was about to start recording this clip! Time: 19:40 - 19:50 Attic. I think these are the steep stairs that Jared was talking about. Going up. This is just extremely ominous, that's all. I found all the beds. Oh, look at light! Okay, this ladder is extremely steep. Time: 19:50 - 20:00 Jared, you're valid. Life at the chalet. We should get some nice daylight in the morning. Ah! Waking up in Slovenia. Time: 20:00 - 20:10 I made some coffee. It was so good. And then I made my way back down to the mainland to buy Spock's toy. Dude, this one looks pretty cool. New Spock toy alert, all the way from Slovenia. Time: 20:10 - 20:20 I am now on my way to the final country. European airports are the best. I had to take multiple flights to get to this one, which makes sense because it literally looks like an apocalyptic bunker. It probably shouldn't be easy to access. Time: 20:20 - 20:30 Oh yeah, I couldn't do the match cut thing this time. It's the middle of the night. I don't know where I am. I flew on a prop plane to Norway, and ever since I landed, Time: 20:30 - 20:40 I've been driving 3.5 hours through the Norwegian Highlands. Also, I could get to this abandoned ski resort. I'm supposed to meet the Airbnb host here, and they're gonna take me up a hike to get to Time: 20:40 - 20:50 what looks like a billionaire's apocalypse bunker. This \"Bird Box\" Airbnb needs a new section on the website. WTF? I think I see him. This is Seiv. She walks 40 minutes up a mountain with you, just to make sure you get to her Airbnb. Time: 20:50 - 21:00 She is so nice. Thank you! Ryan: Oh, that's nice. Seiv: Okay. Are you ready? Ryan: I'm ready. Let's do it! Woo! 30 to 40 minute hike. Time: 21:00 - 21:10 We got this. So what are the top 3 best things about the Bird Box? Seiv: The view, silence. And that you are getting really near nature. Time: 21:10 - 21:20 Ryan: Oh, yes. I have arrived to the Bird Box. Seiv dipped. She's gone. Before I go any further, look how crazy this place is! Boom! Bang! Pow! Onomatopoeias! They're useful. They are. They're good. I cannot express the amount of effort it took to get here. Time: 21:20 - 21:30 But I also cannot express how beautiful it is. And it's nighttime. Like I can barely see. I know in the morning it's gonna be... It's gonna be crazy. It's gonna be unreal. Before I step inside, I cannot get enough of these European 5 star reviews, okay? Time: 21:30 - 21:40 Magni said: \"Have you first found the place? Hike up in the heather with result of a host, pure joy. Nothing missing place, drinks and water provided. Time: 21:40 - 21:50 I order breakfast and tapas. Everything has brilliant. May we have another opportunity.\" 5 stars. Magni. That review is golden. But was that last part a question or a threat? Time: 21:50 - 22:00 And guess what? Your boy also got breakfast and tapas. Yep. Thank you! Yeah, it was like a reasonable thing to get. So Harvard said: \"Impeccable view. Cozy box. Cozy landlord. Who is concerned that you Time: 22:00 - 22:10 should have a good time during stay. Recommend it.\" 5 stars. Seiv is actually the best. And...and cozy. Yeah, that's it. And finally, best of all, Ida, said: \"Seiv 5 star.\" Time: 22:10 - 22:20 I knew Google translated to a lot of languages, but I didn't know they translated to facts. Ida speaking facts. I love how much appreciation Seiv is getting in these reviews. She deserves it. You know what? Time: 22:20 - 22:30 I'm sending this video to Seiv. We should just spam the comments with \"We love Seiv\". Imagine she comes to the video and there's every comment just says that. Well, that's that. Oh! Almost slipped while standing in place. How Texan can I get? Time: 22:30 - 22:40 I mean, that's crazy. Without further ado, I'm stepping foot inside the Bird Box. Time: 22:40 - 22:50 Dude, I just know this is gonna look crazy in the morning. I look like a 9 year old Norwegian boy. This is...what is this outfit? There is so much food here. Did she give me 2 sets of food? Time: 22:50 - 23:00 Oh, that's gonna make me sad. No! Not the \"His and Her\" slippers! Bruh! Come on! Missing Haley and Spock levels maxed. Other than that, the bed looks crazy cozy. Time: 23:00 - 23:10 I mean, these pillows are huge. Are those even pillows? These are, like, small mattresses. I know it's nighttime, but I think this is the main attraction. There's like a massive circle window here. And this is the seating area that you enjoy Time: 23:10 - 23:20 it. Don't judge me that I already got that out! I'm getting to work. There's also a cooler with lots of drinks and snacks, and a heater, so you don't freeze to death. I'm gonna eat now. So it's actually really late right now. It's like midnight. It's been a long day getting here, so my plan is to fuel up, go to Time: 23:20 - 23:30 sleep, and then wake up to this. And if you think about it, the faster I go to sleep, the faster I wake up. Simple math. I'm gonna absolutely slam this. Time: 23:30 - 23:40 I'll see you in the morning. I'm right here. I just wanted to try that transition. Time: 23:40 - 23:50 Made myself a cappuccino. Time: 23:50 - 24:00 Guys, I cannot describe how insane it was to wake up to this view. Time: 24:00 - 24:10 Look at that! Look at that video! It's also so cool, there's people just skiing around me right now. It appears this ski resort is not abandoned. It was just midnight when I arrived, so that explains a lot. Time: 24:10 - 24:20 This was actually the first Airbnb I slept all the way through the night. I think the jet lag from America to Europe was really kicking my butt. It was, but the Bird Box was cozy. She has some pillows in there that...I mean, you saw them. Time: 24:20 - 24:30 They're huge. I snuggled one of them all night. That's right. Something crazy I discovered this morning, whenever the sun was out is: that there's a bathroom and it looks like this. Time: 24:30 - 24:40 And on the inside, there's a massive window, which means you can... you know what, and have this view. I've been saving the OMG title screen for a reason. Okay? I have. That's something I'm gonna tell my grandkids about. Time: 24:40 - 24:50 I'm gonna finish off my cappuccino and it's gonna get rowdy in that bathroom. I'm sorry! It's gross. Probably not gonna get that crazy. I relaxed and enjoyed my iced coffee. I also grabbed an orange juice. That was so good. You guys, I gotta use the bathroom. Time: 24:50 - 25:00 I'm really excited to use this, but it doesn't make me feel good that there's some guy working on this pole. And if he walks over here, he can clearly see through the window. Time: 25:00 - 25:10 But some things must be done. This has to be the toilet with the best view in the world. It has to be. All right, guys, I got to fight this battle on my own. Time: 25:10 - 25:20 See you in a sec. All right, guys, I've got my bags packed. This video has been so special. Like, I'm truly so grateful to be able to go to these places that people have clearly Time: 25:20 - 25:30 worked so hard on. But I miss Haley and Spock so much, and I think I've got one more OMG up my sleeve. I made my way back down the mountain, drove 3.5 hours back to the city, made my way to a Time: 25:30 - 25:40 Norwegian pet store and got an adorable sloth. I just know Spock's gonna love this one. And after an entire day of traveling home, it's time for Spock's OMG moment. Time: 25:40 - 25:50 I have all four toys right here. Spock is so excited. Okay, here you go, Spock. Yay! Which one? Which one? He can't believe it. I think Spock likes the toys. Time: 25:50 - 26:00 So happy to be home. Haley: So happy to be home. Ryan: Thanks for watching! Ryan: Bye! Haley: Bye! Ryan: Spock's favorite is sloth. Watch another video! Youtube thinks this video on screen right now will be your Time: 26:00 - 26:10 favorite. Could be a really fun adventure. Click here! Bye! Time: 26:10 - 26:20♥ *We love Seiv* ♥",
      "comments": [
        {
          "text": "Not only did she escort you for a 40-minute hike up, but she also had to turn around and do\nanother 40 minutes on her own!",
          "author": "Unknown",
          "likes": 8871,
          "timestamp": "The fact that Seiv met you that late to walk you 40 minutes 1 way to the home and then 40"
        },
        {
          "text": "minutes back, by herself. That is true dedication.\nGreat video, man!",
          "author": "Unknown",
          "likes": 7056,
          "timestamp": "Genuinely, Seiv is such a kind and considerate person for what she does."
        },
        {
          "text": "blessing.",
          "author": "Unknown",
          "likes": 4213,
          "timestamp": "14 servings of spaghetti sounds like a solid game plan. ☺"
        },
        {
          "text": "Edit:  I love Spock",
          "author": "Unknown",
          "likes": 3624,
          "timestamp": "People like Seiv are amazing, like the passions that she has, they make the world go"
        },
        {
          "text": "around,",
          "author": "Unknown",
          "likes": 3547,
          "timestamp": "We love Seiv! she seems like a kind soul, and a fun caring host"
        },
        {
          "text": "Edit : bro when it was at 38 i said I'll run a mile everyday  and recored. Now 685?? idk if i\ncan do this bro 😭 but thanks for the likes",
          "author": "Unknown",
          "likes": 2455,
          "timestamp": "I will walk 1 foot every like this gets, and I will walk another foot for every comment"
        },
        {
          "text": "landing scenario was super wholesome. Who said there was anything wrong with adults\nhaving imaginations and child like spirits. Super awesome. <3",
          "author": "Unknown",
          "likes": 2293,
          "timestamp": "One like = one treat for Spock 🐶🐾"
        },
        {
          "text": "Wales. Hope Spock liked his gift! ❤",
          "author": "Unknown",
          "likes": 1905,
          "timestamp": "Ryan! It was lovely meeting you in the airport the other day! You’re my hero and you inspire"
        },
        {
          "text": "me to make videos just like yours someday!! You’re so genuine and kind and I will always\nbe grateful to have met you, and will never forget it!",
          "author": "Unknown",
          "likes": 1506,
          "timestamp": "My initial reaction is simply OMG"
        },
        {
          "text": "time someone rents your Airbnb to make sure they’re safe. We love seiv",
          "author": "Unknown",
          "likes": 1160,
          "timestamp": "Here from Slovenia!! I am SOOOOSOSOSOSO GLAD you had a great time! I am so"
        },
        {
          "text": "surprised to see one of my favorite youtubers visit here, hope you get to visit the other\nplaces here, as we're basically sorrounded by nature LOL ❤",
          "author": "Unknown",
          "likes": 808,
          "timestamp": "We love Seiv"
        },
        {
          "text": "footage. Like when he says something he doesn't like, he just sits there and awkwardly\nchuckles and looks at the camera, and like walking down a road and the run ing back to get\nthe camera. 🤣I love it. It's such an unprofessional but professional thing.",
          "author": "Unknown",
          "likes": 726,
          "timestamp": "Siev is the GOAT.  WE LOVE SEIV…Meeting you in the middle of the night to walk you 40"
        },
        {
          "text": "minutes up a mountain and the back down by herself.  This is by far the best video I’ve ever\nseen on YouTube.  Those Air  BnB’s were absolutely incredible.  I really hope you do this\nagain.  It was fun to watch.",
          "author": "Unknown",
          "likes": 677,
          "timestamp": "We love seiv! The amount of work she puts into running this place is insane!"
        },
        {
          "text": "What amazing places you saw! Thanks for sharing! I can’t travel easily, so this kind of video\nbrings me joy!",
          "author": "Unknown",
          "likes": 641,
          "timestamp": "We love Seiv, and that awesome Norwegian hospitality! Love from Australia 🙌🙌🙌"
        },
        {
          "text": "the footage is an extra bonus for sure.",
          "author": "Unknown",
          "likes": 592,
          "timestamp": "We love Seiv! ❤ She is so kind, and she even walks 40 minutes to make sure the guest"
        },
        {
          "text": "gets to the AirBNB safe. She really is the kind of person we need in this world 💗",
          "author": "Unknown",
          "likes": 582,
          "timestamp": "i live in Slovenia, so its always nice to see youtubers talk about my country."
        },
        {
          "text": "admiration. \"We love Seiv\" resonates not merely as a sentiment, but as a testament to the\nprofound impact of an individual within their community. Seiv, with their innate charm and\ngenuine character, effortlessly cultivates bonds that transcend mere acquaintance, weaving\na tapestry of camaraderie and mutual respect. Their ability to empathize and uplift others\nserves as a cornerstone for the relationships they nurture. Beyond their inherent charisma,\nSeiv's unwavering support and encouragement inspire those around them to reach greater\nheights and embrace their fullest potential.",
          "author": "Unknown",
          "likes": 561,
          "timestamp": "Can I just say I love the authenticity and purity of Ryan’s videos. Like I can watch him at my"
        },
        {
          "text": "grandmas and not be stressed about something inappropriate coming up during his video\nbut they’re SO enjoyable. Thank you Ryan!! And God bless you my christian brotha 😎💕",
          "author": "Unknown",
          "likes": 539,
          "timestamp": "1 like = 1 toy for spock"
        },
        {
          "text": "sweetest most compassionate thing in the world. i hope her pockets are full, because her\nheart definitely is ❤",
          "author": "Unknown",
          "likes": 501,
          "timestamp": "One like= one dollar for sieve siv siev"
        },
        {
          "text": "1st edit : don't know which one is right so I put both sieve and siv :/\n2nd edit one of the replies said siev",
          "author": "Unknown",
          "likes": 493,
          "timestamp": "I can’t wait to show my mom the segment in Slovenia! She’s going to be over the moon to"
        },
        {
          "text": "see a huge YouTuber giving it so much love!!!",
          "author": "Unknown",
          "likes": 475,
          "timestamp": "WE LOVE SIEV!!"
        },
        {
          "text": "complementing and actually acksonwalding Wales and its looks. I don't know why but when\nyou showed a picture of Tenby I genuinely screamed in happiness. Keep being awesome\nRyan <3",
          "author": "Unknown",
          "likes": 426,
          "timestamp": "Seiv is the best!  We love you, Seiv!"
        },
        {
          "text": "These are all awesome looking places",
          "author": "Unknown",
          "likes": 419,
          "timestamp": "Hey, so the reason the food is below the ground is because most of is ment to be stored in"
        },
        {
          "text": "a dry space and semi-cool (below room temp.) but upstairs is so hot it could ruin it. Also\nyou don't need a pantry to take space in the main living area. So yeah, im glad you came to\nmy country Ryan and showed some of its beauties, there is so much more we have, since\nwe're a small country u can see so much in little time, so i hope you comeback oneday to\nexplore more of our country. Cheers from Slovenia <3",
          "author": "Unknown",
          "likes": 394,
          "timestamp": "We love you, Seiv! God bless youuuu"
        },
        {
          "text": "the view is 󰴵. I love it and I need it 😭",
          "author": "Unknown",
          "likes": 382,
          "timestamp": "That last air bnb 😍 it was gorgeous!! We love Seiv!!"
        },
        {
          "text": "3:16, or how he sits introducing the ufo, just pure wholesome relatablilty seeping through\nevery crack",
          "author": "Unknown",
          "likes": 362,
          "timestamp": "We love Seiv! Glad you came to see the beautiful country of Norway <3"
        },
        {
          "text": "Feel like you would enjoy Thailand or Dubai. Some really amazing activities in the desert\nthere (Thank yall for 346 likes , insanity)",
          "author": "Unknown",
          "likes": 347,
          "timestamp": "Seiv is genuinely kind and a sweet person, she does deserve all that love."
        }
      ]
    },
    {
      "video_id": "video_11",
      "title": "I Survived the World's Loudest Room Ryan: What do you think would be harder? 1 hour in the world's quietest room, or 1 hour in the world's loudest room? Okay, maybe I'm being dramatic for the intro, but when you actually turn on the sound in this room, things get crazy.",
      "description": "",
      "published_at": "",
      "view_count": 0,
      "duration": "PT0S",
      "transcript": "Time: 00:00 - 00:10 Let's begin! So I packed my bags, put on the nicest outfit I could find. If you know, you know. And found myself back where I started. Ryan: Orfield Laboratories. Steve: What can I do for you? Time: 00:10 - 00:20 Ryan: Howdy, Steve! This is Steve. Steve Orfield. Sorcerer of sound, the founder of these rooms, and possibly the villain of Stranger Things Season 4. Steve: I dressed down, you dressed up. Ryan: I know, there it is. Time: 00:20 - 00:30 Steve: You're a jinx. Ryan: Well, I have no idea what a jinx is, but I'll take that as a compliment. I've got a bag full of Cheeto Puffs and a dream. A few weeks ago, I attempted to break the world record for the longest time spent in the world's quietest room. Time: 00:30 - 00:40 45 minutes. And after 1 hour of the most intense silence the Earth has to offer... Steve told me that it's not actually hard to stay in there, and I could probably stay in Time: 00:40 - 00:50 there for days if I wanted to. But the loudest room...the loudest room is different. Ryan: So Steve said, if I wanted a real challenge... Steve: You'd play some chamber music in the reverb room. Time: 00:50 - 01:00 Ryan: I don't know what that is. After an intense Google session, I learned that chamber music is simply the classics: Bach, Mozart and Pitbull on the weekends. Time: 01:00 - 01:10 And the reason for it is: because chamber music is so precise, so delicate that the reverb room reflects each note and distorts it so much, that the music eventually just becomes an awful, never ending screeching noise. Time: 01:10 - 01:20 Ryan: So yeah. Then we went to the room. Steve: Come into the reverb room! Ryan: Alright. Steve: A reverb room is a room that's... pretty close to 100% reflective. Time: 01:20 - 01:30 And so...no matter where you are in a reverb room, it doesn't get any louder or any quieter. Time: 01:30 - 01:40 It's a perfectly diffuse room, which means: the sound is the same everywhere. Ryan: For context of loudness: whispering is about 30dB. Thunder: 120dB. Now let's say you go to a rock concert! Time: 01:40 - 01:50 You probably know this by now, but the front row is about 150dB. But in a reverb room, that noise just reflects like, listen to this! I'm no scientist, but I'm pretty sure that the room with the fiberglass wedges echoes a Time: 01:50 - 02:00 little bit less. Steve: So, unlike being outside, where the louder you talk, the more you'll hear...in a reverb room, the louder you talk, the worse it is. Time: 02:00 - 02:10 Ryan: With that in mind, Steve and I developed a game. I'm gonna yell at him from across the room, and his theory is that he won't even be able to understand me, due to the reflections of sound. Steve, are you hiding any demogorgons in the basement? Time: 02:10 - 02:20 Steve: I'm sure he said something intelligible. Ryan: Answer the question, Steve! Time: 02:20 - 02:30 Steve: There's some things in the basement. Ryan: I thought that was pretty funny, until we heard actual screeching coming from...below us. Time: 02:30 - 02:40 Steve's got a battle of his own, but I've got some... I've got one as well. There was no more running from it. It's time to see how long I can last in the world's loudest room. Time: 02:40 - 02:50 And unlike the quietest room, it doesn't have to be pitch black for it to work. I brought in the largest speakers I could rent, and Steve doesn't even think I'll last 10 minutes in here at full volume. Steve: Ryan seems like a gentle fellow, so we'll have to test this. Time: 02:50 - 03:00 Ryan: But what does he know? He actually knows everything about...this is literally his life's work. Regardless, I spent 30 minutes in the anechoic chamber leading up to this challenge, so now my ears are ultra sensitized to the reflections in the reverb Time: 03:00 - 03:10 room. Let's do this! I'm gonna speak as quietly as possible, because we are in the world's loudest room, and if I speak loudly, it will echo. Learned that from my boy, Steve. Time: 03:10 - 03:20 I'ma find those demogorgons. And upon Steve's recommendation, we're listening to Bach, who famously said: \"Bring me my coffee, before I turn into a goat!\". Time: 03:20 - 03:30 Which is a really weird thing to say. So yeah. Here we go. Ryan: Oh, my gosh! Steve: Are you okay? Ryan: I just damaged my ears. Time: 03:30 - 03:40 That was the wrong song. Holy smokes! That was loud. Yeah. As you can see here, I actually have a physical reaction. So intense Time: 03:40 - 03:50 to the sound, that my primitive instincts kick in. I physically...I just sprint away, I just run. I'm not gonna sit here and act like I'm not embarrassed, but I am gonna try again. I found the correct music. Time: 03:50 - 04:00 Here we go. As I was sitting in this chair, I wondered to myself: Can noise make a dude Time: 04:00 - 04:10 die? Yeah it can. Apparently the European Space Agency has a sound weapon that if they wanted to, could... It could put you in a coffin. Time: 04:10 - 04:20 Let's put it that way! In this moment, I'm thinking 3 things: Time: 04:20 - 04:30 This music sounds awful. I didn't know Ribcages could vibrate until now. And I can't believe I thought the world's quietest room actually gave me real problems. My ears just started making noises. Time: 04:30 - 04:40 What the heck? Well, I look like I'm doing just fine. Time: 04:40 - 04:50 A lot of people don't know this, but if you have an iPhone, you can check how loud you listen to stuff. My average volume is 85dB. Steve: It turns out that the amount of sound you can get off an iPhone in America... Time: 04:50 - 05:00 You can't get in Europe. They don't sell that iPhone in Europe, because the Europeans won't tolerate it. Ryan: Probably because they're saving all that noise for their sound weapons. That's none of my business. Time: 05:00 - 05:10 So here you can see me internally trying to remember, why I do things like this. And ultimately, it comes down to 1 reason: and that is to have Dr. Phil become my legal grandfather. You know, by now. His agent will let us ask him. Time: 05:10 - 05:20 I recently met him in person. It was too nervous to ask. His agent actually emailed and said that she likes my videos, and agreed to let us meet with him if we pass him in subscribers. This war is ruthless, but we are gaining on Dr. Phil rapidly. Time: 05:20 - 05:30 Join the...join the battle! At this point, I was trying to not cover my ears, because I thought it made me look weak. Time: 05:30 - 05:40 But I couldn't help it. And then I realized: I don't think anyone on the planet thinks not covering your ears in a 120 decibel room is cool. Steve: 120db of noise... Ryan won't want to be in there too long. Time: 05:40 - 05:50 Ryan: It's the same volume. It's the same volume everywhere I go. Oh, my gosh! Time: 05:50 - 06:00 Okay. Okay. Time: 06:00 - 06:10 1 minute in this room has destroyed me. But what would happen if you spent 10 years in here, Steve? Steve: You'd have significant hearing loss. I mean, you'd...you wouldn't have any hearing left to speak of. And it wouldn't take 10 Time: 06:10 - 06:20 years. Ryan: That's good to know, Steve. Good to know. After 1 hour in the world's quietest room, I couldn't help but just sit and enjoy the sounds of nature outside. And as I'm sitting here, experiencing actual sensory overload, I can't help but long for Time: 06:20 - 06:30 the same thing. I just wanna eat my Cheeto Puffs outside next to a tree, and hear a bird scream. And even though this music is beautiful, I'm realizing that even the Time: 06:30 - 06:40 prettiest of noises can sound horrible in the wrong environment. Time: 06:40 - 06:50 Oh, my gosh! Time: 06:50 - 07:00 I'm done. I quit. I lasted 3 minutes and 37 seconds in here. Time: 07:00 - 07:10 Yeah, uh...I think I would much rather prefer the quiet one. I physically could not stay still. I am going to a doctor. Time: 07:10 - 07:20 Turns out I didn't damage my ears. Thank goodness! And Steve never did tell me what was screeching in that basement. So I guess we'll just have to wait for Season 4 of Stranger Things to find out if my theory is true. Regardless, I think I'll stick to normal rooms from now on. Time: 07:20 - 07:30 Normal rooms with normal volumes. But it's not every day you can say you're sitting down under a tree with Cheeto dust on your fingers, in a suit you bought from Amazon to impress a 73 year old sound Time: 07:30 - 07:40 sorcerer, after he let you stay in the world's quietest and loudest room, in hopes of passing a celebrity doctor in subscribers on the internet. Thanks for watching! Time: 07:40 - 07:50 Now I think you should face the \"world's most average sounding room.\"",
      "comments": [
        {
          "text": "Normal volume especially a crouded grocery store gives me sensory overload",
          "author": "Unknown",
          "likes": 4916,
          "timestamp": "Thank you Ryan  for experienced this so I don’t have to 😂"
        },
        {
          "text": "ALL unless it’s music i put on myself) I feel the pain watching this video",
          "author": "Unknown",
          "likes": 3409,
          "timestamp": "“I lasted 3 minutes and 37 seconds” keeping this quote"
        },
        {
          "text": "Kindergarten teachers: *thats adorable*",
          "author": "Unknown",
          "likes": 3190,
          "timestamp": "What if Steve is Dr.Phil in disguise and he's actually letting you go in these rooms to try to"
        },
        {
          "text": "end you and prevent you from ever passing him??",
          "author": "Unknown",
          "likes": 2742,
          "timestamp": "Ngl, Ryan. I was hoping you would have eaten the cheetos in there for testing reasons. The"
        },
        {
          "text": "crunch would have been magical.",
          "author": "Unknown",
          "likes": 2724,
          "timestamp": "gives a whole new meaning to ‘death metal’"
        },
        {
          "text": "loudest room",
          "author": "Unknown",
          "likes": 1358,
          "timestamp": "This video was too existentially profound for me, more cheetos less thinky thinky"
        },
        {
          "text": "me: *jamming down the volume.*",
          "author": "Unknown",
          "likes": 1029,
          "timestamp": "Plot twist: he is actually deaf... 😳"
        },
        {
          "text": "drown it out",
          "author": "Unknown",
          "likes": 989,
          "timestamp": "imagine if he had to listen to cardi b in this"
        },
        {
          "text": "Deaf People: *\"Are you sure about that?\"*",
          "author": "Unknown",
          "likes": 608,
          "timestamp": "Hey man, I just wanna let you know that Ive been having a really hard time with life lately"
        },
        {
          "text": "and your videos made me smile and laugh. You probably won’t see this but , thank you.",
          "author": "Unknown",
          "likes": 557,
          "timestamp": "PLEASE make sure Steve is doing alright, like how’s his life? I feel like he needs a hug."
        },
        {
          "text": "painful to watch but it's nice to see a neurotypical person experience it and have it change\ntheir perspective.",
          "author": "Unknown",
          "likes": 496,
          "timestamp": "i survived my classroom"
        },
        {
          "text": "Meanwhile Deaf people : *bruh*",
          "author": "Unknown",
          "likes": 459,
          "timestamp": "I’m a classical musician, and seriously, Bach’s chamber music is amazing. I do recommend"
        },
        {
          "text": "people do listen to it at the correct volume",
          "author": "Unknown",
          "likes": 458,
          "timestamp": "\"You're a jinx.\""
        },
        {
          "text": "\"Well, I have no idea what a jinx is, but I'll take that as a compliment.\"\n*jinx - a person or thing that brings bad luck* 😂",
          "author": "Unknown",
          "likes": 453,
          "timestamp": "I spent 10 minutes in the bell tower of a Cathedral which has one of the largest sets of"
        },
        {
          "text": "church bells in the World. I was stood a few 3 metres way from one of the smaller bells and\nthe full set of 12 were ringing. I had noise cancelling headphones on to protect my ears\notherwise I would have suffered significant damage to my hearing. However, the physical\ntrauma to my body was still significant. A church bell is shaped like the human rib cage and\nhas multiple harmonics. This means that my rib cage was resonating in harmony with one\nof the bells and that was painful.",
          "author": "Unknown",
          "likes": 427,
          "timestamp": "This man is eventually going to fill the entire “Guinness World Record” book."
        },
        {
          "text": "TO HARD 💀😂😂😂",
          "author": "Unknown",
          "likes": 389,
          "timestamp": "To be honest just based on his actions and movement in the room , as long as they were"
        },
        {
          "text": "guniune, kind of makes me think that someone could experience a small form of what a lot\nof people with autism experience. Just like he said he was experiencing sensory overload.\nHe said it was hard to sit still and by the looks of it, it seemed that way too. Now I don't\nwant to offend anyone cause I really don't know that much about autism or the background\nbehind it but what little I do know poses an interesting question. Is it possible to show and\nhave someone feel something similar to what people with autism experience on a daily\nbasis?",
          "author": "Unknown",
          "likes": 371,
          "timestamp": "That man is 100% holding people in his basement"
        },
        {
          "text": "in that room; it would be a living hell in there with even just the voices and if the music was\nturned on I'd be running out shaking and crying in pain. If someone were to lock the door I\nwould 100% be severely traumatized from the experience.",
          "author": "Unknown",
          "likes": 333,
          "timestamp": "\"I didn't know ribs could vibrate\""
        },
        {
          "text": "Yep. That's me near any bass speaker, drum set, or anything that gives off hard vibrations\nconsistently. It gets bad enough in some places, like Carnage screaming in a theater with\nsurround sound, that I had a massive headache for HOURS. Another time I was parallel to\na drum set during church and had chest pains the rest of the day.",
          "author": "Unknown",
          "likes": 325,
          "timestamp": "you're probably the toughest person i've ever seen!!!!!!!"
        }
      ]
    }
  ]
}